zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/**
 * \brief Component description for PIC32CZ/CA70 PWMC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_PWMC_COMPONENT_H_
#define _PIC32CZ_CA70_PWMC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_PWMC Pulse Width Modulation Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PWMC */
/* ========================================================================== */

/* -------- PWMC_CMR : (PWMC Offset: 0x00) (R/W 32) PWMC Channel Mode Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t CPRE:4;                    /**< bit:   0..3  Channel Pre-scaler                            */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CALG:1;                    /**< bit:      8  Channel Alignment                             */
    uint32_t CPOL:1;                    /**< bit:      9  Channel Polarity                              */
    uint32_t CES:1;                     /**< bit:     10  Counter Event Selection                       */
    uint32_t UPDS:1;                    /**< bit:     11  Update Selection                              */
    uint32_t DPOLI:1;                   /**< bit:     12  Disabled Polarity Inverted                    */
    uint32_t TCTS:1;                    /**< bit:     13  Timer Counter Trigger Selection               */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t DTE:1;                     /**< bit:     16  Dead-Time Generator Enable                    */
    uint32_t DTHI:1;                    /**< bit:     17  Dead-Time PWMHx Output Inverted               */
    uint32_t DTLI:1;                    /**< bit:     18  Dead-Time PWMLx Output Inverted               */
    uint32_t PPM:1;                     /**< bit:     19  Push-Pull Mode                                */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CMR_bits_t;

#define PWMC_CMR_CPRE_Pos                     (0)                                            /**< (PWMC_CMR) Channel Pre-scaler Position */
#define PWMC_CMR_CPRE_Msk                     (0xFU << PWMC_CMR_CPRE_Pos)                    /**< (PWMC_CMR) Channel Pre-scaler Mask */
#define PWMC_CMR_CPRE(value)                  (PWMC_CMR_CPRE_Msk & ((value) << PWMC_CMR_CPRE_Pos))
#define   PWMC_CMR_CPRE_MCK_Val               (0x0U)                                         /**< (PWMC_CMR) Peripheral clock  */
#define   PWMC_CMR_CPRE_MCK_DIV_2_Val         (0x1U)                                         /**< (PWMC_CMR) Peripheral clock/2  */
#define   PWMC_CMR_CPRE_MCK_DIV_4_Val         (0x2U)                                         /**< (PWMC_CMR) Peripheral clock/4  */
#define   PWMC_CMR_CPRE_MCK_DIV_8_Val         (0x3U)                                         /**< (PWMC_CMR) Peripheral clock/8  */
#define   PWMC_CMR_CPRE_MCK_DIV_16_Val        (0x4U)                                         /**< (PWMC_CMR) Peripheral clock/16  */
#define   PWMC_CMR_CPRE_MCK_DIV_32_Val        (0x5U)                                         /**< (PWMC_CMR) Peripheral clock/32  */
#define   PWMC_CMR_CPRE_MCK_DIV_64_Val        (0x6U)                                         /**< (PWMC_CMR) Peripheral clock/64  */
#define   PWMC_CMR_CPRE_MCK_DIV_128_Val       (0x7U)                                         /**< (PWMC_CMR) Peripheral clock/128  */
#define   PWMC_CMR_CPRE_MCK_DIV_256_Val       (0x8U)                                         /**< (PWMC_CMR) Peripheral clock/256  */
#define   PWMC_CMR_CPRE_MCK_DIV_512_Val       (0x9U)                                         /**< (PWMC_CMR) Peripheral clock/512  */
#define   PWMC_CMR_CPRE_MCK_DIV_1024_Val      (0xAU)                                         /**< (PWMC_CMR) Peripheral clock/1024  */
#define   PWMC_CMR_CPRE_CLKA_Val              (0xBU)                                         /**< (PWMC_CMR) Clock A  */
#define   PWMC_CMR_CPRE_CLKB_Val              (0xCU)                                         /**< (PWMC_CMR) Clock B  */
#define PWMC_CMR_CPRE_MCK                     (PWMC_CMR_CPRE_MCK_Val << PWMC_CMR_CPRE_Pos)   /**< (PWMC_CMR) Peripheral clock Position  */
#define PWMC_CMR_CPRE_MCK_DIV_2               (PWMC_CMR_CPRE_MCK_DIV_2_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/2 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_4               (PWMC_CMR_CPRE_MCK_DIV_4_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/4 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_8               (PWMC_CMR_CPRE_MCK_DIV_8_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/8 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_16              (PWMC_CMR_CPRE_MCK_DIV_16_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/16 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_32              (PWMC_CMR_CPRE_MCK_DIV_32_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/32 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_64              (PWMC_CMR_CPRE_MCK_DIV_64_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/64 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_128             (PWMC_CMR_CPRE_MCK_DIV_128_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/128 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_256             (PWMC_CMR_CPRE_MCK_DIV_256_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/256 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_512             (PWMC_CMR_CPRE_MCK_DIV_512_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/512 Position  */
#define PWMC_CMR_CPRE_MCK_DIV_1024            (PWMC_CMR_CPRE_MCK_DIV_1024_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Peripheral clock/1024 Position  */
#define PWMC_CMR_CPRE_CLKA                    (PWMC_CMR_CPRE_CLKA_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Clock A Position  */
#define PWMC_CMR_CPRE_CLKB                    (PWMC_CMR_CPRE_CLKB_Val << PWMC_CMR_CPRE_Pos)  /**< (PWMC_CMR) Clock B Position  */
#define PWMC_CMR_CALG_Pos                     (8)                                            /**< (PWMC_CMR) Channel Alignment Position */
#define PWMC_CMR_CALG_Msk                     (0x1U << PWMC_CMR_CALG_Pos)                    /**< (PWMC_CMR) Channel Alignment Mask */
#define PWMC_CMR_CPOL_Pos                     (9)                                            /**< (PWMC_CMR) Channel Polarity Position */
#define PWMC_CMR_CPOL_Msk                     (0x1U << PWMC_CMR_CPOL_Pos)                    /**< (PWMC_CMR) Channel Polarity Mask */
#define PWMC_CMR_CES_Pos                      (10)                                           /**< (PWMC_CMR) Counter Event Selection Position */
#define PWMC_CMR_CES_Msk                      (0x1U << PWMC_CMR_CES_Pos)                     /**< (PWMC_CMR) Counter Event Selection Mask */
#define PWMC_CMR_UPDS_Pos                     (11)                                           /**< (PWMC_CMR) Update Selection Position */
#define PWMC_CMR_UPDS_Msk                     (0x1U << PWMC_CMR_UPDS_Pos)                    /**< (PWMC_CMR) Update Selection Mask */
#define PWMC_CMR_DPOLI_Pos                    (12)                                           /**< (PWMC_CMR) Disabled Polarity Inverted Position */
#define PWMC_CMR_DPOLI_Msk                    (0x1U << PWMC_CMR_DPOLI_Pos)                   /**< (PWMC_CMR) Disabled Polarity Inverted Mask */
#define PWMC_CMR_TCTS_Pos                     (13)                                           /**< (PWMC_CMR) Timer Counter Trigger Selection Position */
#define PWMC_CMR_TCTS_Msk                     (0x1U << PWMC_CMR_TCTS_Pos)                    /**< (PWMC_CMR) Timer Counter Trigger Selection Mask */
#define PWMC_CMR_DTE_Pos                      (16)                                           /**< (PWMC_CMR) Dead-Time Generator Enable Position */
#define PWMC_CMR_DTE_Msk                      (0x1U << PWMC_CMR_DTE_Pos)                     /**< (PWMC_CMR) Dead-Time Generator Enable Mask */
#define PWMC_CMR_DTHI_Pos                     (17)                                           /**< (PWMC_CMR) Dead-Time PWMHx Output Inverted Position */
#define PWMC_CMR_DTHI_Msk                     (0x1U << PWMC_CMR_DTHI_Pos)                    /**< (PWMC_CMR) Dead-Time PWMHx Output Inverted Mask */
#define PWMC_CMR_DTLI_Pos                     (18)                                           /**< (PWMC_CMR) Dead-Time PWMLx Output Inverted Position */
#define PWMC_CMR_DTLI_Msk                     (0x1U << PWMC_CMR_DTLI_Pos)                    /**< (PWMC_CMR) Dead-Time PWMLx Output Inverted Mask */
#define PWMC_CMR_PPM_Pos                      (19)                                           /**< (PWMC_CMR) Push-Pull Mode Position */
#define PWMC_CMR_PPM_Msk                      (0x1U << PWMC_CMR_PPM_Pos)                     /**< (PWMC_CMR) Push-Pull Mode Mask */
#define PWMC_CMR_Msk                          (0x000F3F0FUL)                                 /**< (PWMC_CMR) Register Mask  */

/* -------- PWMC_CDTY : (PWMC Offset: 0x04) (R/W 32) PWMC Channel Duty Cycle Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t CDTY:24;                   /**< bit:  0..23  Channel Duty-Cycle                            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CDTY_bits_t;

