zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
#define PWMC_CDTY_CDTY_Pos                    (0)                                            /**< (PWMC_CDTY) Channel Duty-Cycle Position */
#define PWMC_CDTY_CDTY_Msk                    (0xFFFFFFU << PWMC_CDTY_CDTY_Pos)              /**< (PWMC_CDTY) Channel Duty-Cycle Mask */
#define PWMC_CDTY_CDTY(value)                 (PWMC_CDTY_CDTY_Msk & ((value) << PWMC_CDTY_CDTY_Pos))
#define PWMC_CDTY_Msk                         (0x00FFFFFFUL)                                 /**< (PWMC_CDTY) Register Mask  */

/* -------- PWMC_CDTYUPD : (PWMC Offset: 0x08) (/W 32) PWMC Channel Duty Cycle Update Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t CDTYUPD:24;                /**< bit:  0..23  Channel Duty-Cycle Update                     */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CDTYUPD_bits_t;

#define PWMC_CDTYUPD_CDTYUPD_Pos              (0)                                            /**< (PWMC_CDTYUPD) Channel Duty-Cycle Update Position */
#define PWMC_CDTYUPD_CDTYUPD_Msk              (0xFFFFFFU << PWMC_CDTYUPD_CDTYUPD_Pos)        /**< (PWMC_CDTYUPD) Channel Duty-Cycle Update Mask */
#define PWMC_CDTYUPD_CDTYUPD(value)           (PWMC_CDTYUPD_CDTYUPD_Msk & ((value) << PWMC_CDTYUPD_CDTYUPD_Pos))
#define PWMC_CDTYUPD_Msk                      (0x00FFFFFFUL)                                 /**< (PWMC_CDTYUPD) Register Mask  */

/* -------- PWMC_CPRD : (PWMC Offset: 0x0c) (R/W 32) PWMC Channel Period Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t CPRD:24;                   /**< bit:  0..23  Channel Period                                */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CPRD_bits_t;

#define PWMC_CPRD_CPRD_Pos                    (0)                                            /**< (PWMC_CPRD) Channel Period Position */
#define PWMC_CPRD_CPRD_Msk                    (0xFFFFFFU << PWMC_CPRD_CPRD_Pos)              /**< (PWMC_CPRD) Channel Period Mask */
#define PWMC_CPRD_CPRD(value)                 (PWMC_CPRD_CPRD_Msk & ((value) << PWMC_CPRD_CPRD_Pos))
#define PWMC_CPRD_Msk                         (0x00FFFFFFUL)                                 /**< (PWMC_CPRD) Register Mask  */

/* -------- PWMC_CPRDUPD : (PWMC Offset: 0x10) (/W 32) PWMC Channel Period Update Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t CPRDUPD:24;                /**< bit:  0..23  Channel Period Update                         */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CPRDUPD_bits_t;

#define PWMC_CPRDUPD_CPRDUPD_Pos              (0)                                            /**< (PWMC_CPRDUPD) Channel Period Update Position */
#define PWMC_CPRDUPD_CPRDUPD_Msk              (0xFFFFFFU << PWMC_CPRDUPD_CPRDUPD_Pos)        /**< (PWMC_CPRDUPD) Channel Period Update Mask */
#define PWMC_CPRDUPD_CPRDUPD(value)           (PWMC_CPRDUPD_CPRDUPD_Msk & ((value) << PWMC_CPRDUPD_CPRDUPD_Pos))
#define PWMC_CPRDUPD_Msk                      (0x00FFFFFFUL)                                 /**< (PWMC_CPRDUPD) Register Mask  */

/* -------- PWMC_CCNT : (PWMC Offset: 0x14) (R/ 32) PWMC Channel Counter Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t CNT:24;                    /**< bit:  0..23  Channel Counter Register                      */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CCNT_bits_t;

#define PWMC_CCNT_CNT_Pos                     (0)                                            /**< (PWMC_CCNT) Channel Counter Register Position */
#define PWMC_CCNT_CNT_Msk                     (0xFFFFFFU << PWMC_CCNT_CNT_Pos)               /**< (PWMC_CCNT) Channel Counter Register Mask */
#define PWMC_CCNT_CNT(value)                  (PWMC_CCNT_CNT_Msk & ((value) << PWMC_CCNT_CNT_Pos))
#define PWMC_CCNT_Msk                         (0x00FFFFFFUL)                                 /**< (PWMC_CCNT) Register Mask  */

/* -------- PWMC_DT : (PWMC Offset: 0x18) (R/W 32) PWMC Channel Dead Time Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t DTH:16;                    /**< bit:  0..15  Dead-Time Value for PWMHx Output              */
    uint32_t DTL:16;                    /**< bit: 16..31  Dead-Time Value for PWMLx Output              */
  };
  uint32_t w;
} __PWMC_DT_bits_t;

#define PWMC_DT_DTH_Pos                       (0)                                            /**< (PWMC_DT) Dead-Time Value for PWMHx Output Position */
#define PWMC_DT_DTH_Msk                       (0xFFFFU << PWMC_DT_DTH_Pos)                   /**< (PWMC_DT) Dead-Time Value for PWMHx Output Mask */
#define PWMC_DT_DTH(value)                    (PWMC_DT_DTH_Msk & ((value) << PWMC_DT_DTH_Pos))
#define PWMC_DT_DTL_Pos                       (16)                                           /**< (PWMC_DT) Dead-Time Value for PWMLx Output Position */
#define PWMC_DT_DTL_Msk                       (0xFFFFU << PWMC_DT_DTL_Pos)                   /**< (PWMC_DT) Dead-Time Value for PWMLx Output Mask */
#define PWMC_DT_DTL(value)                    (PWMC_DT_DTL_Msk & ((value) << PWMC_DT_DTL_Pos))
#define PWMC_DT_Msk                           (0xFFFFFFFFUL)                                 /**< (PWMC_DT) Register Mask  */

/* -------- PWMC_DTUPD : (PWMC Offset: 0x1c) (/W 32) PWMC Channel Dead Time Update Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t DTHUPD:16;                 /**< bit:  0..15  Dead-Time Value Update for PWMHx Output       */
    uint32_t DTLUPD:16;                 /**< bit: 16..31  Dead-Time Value Update for PWMLx Output       */
  };
  uint32_t w;
} __PWMC_DTUPD_bits_t;

