zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
#define PWMC_DTUPD_DTHUPD_Pos                 (0)                                            /**< (PWMC_DTUPD) Dead-Time Value Update for PWMHx Output Position */
#define PWMC_DTUPD_DTHUPD_Msk                 (0xFFFFU << PWMC_DTUPD_DTHUPD_Pos)             /**< (PWMC_DTUPD) Dead-Time Value Update for PWMHx Output Mask */
#define PWMC_DTUPD_DTHUPD(value)              (PWMC_DTUPD_DTHUPD_Msk & ((value) << PWMC_DTUPD_DTHUPD_Pos))
#define PWMC_DTUPD_DTLUPD_Pos                 (16)                                           /**< (PWMC_DTUPD) Dead-Time Value Update for PWMLx Output Position */
#define PWMC_DTUPD_DTLUPD_Msk                 (0xFFFFU << PWMC_DTUPD_DTLUPD_Pos)             /**< (PWMC_DTUPD) Dead-Time Value Update for PWMLx Output Mask */
#define PWMC_DTUPD_DTLUPD(value)              (PWMC_DTUPD_DTLUPD_Msk & ((value) << PWMC_DTUPD_DTLUPD_Pos))
#define PWMC_DTUPD_Msk                        (0xFFFFFFFFUL)                                 /**< (PWMC_DTUPD) Register Mask  */

/* -------- PWMC_CMPV : (PWMC Offset: 0x00) (R/W 32) PWMC Comparison 0 Value Register -------- */

typedef union
{
  struct
  {
    uint32_t CV:24;                     /**< bit:  0..23  Comparison x Value                            */
    uint32_t CVM:1;                     /**< bit:     24  Comparison x Value Mode                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CMPV_bits_t;

#define PWMC_CMPV_CV_Pos                      (0)                                            /**< (PWMC_CMPV) Comparison x Value Position */
#define PWMC_CMPV_CV_Msk                      (0xFFFFFFU << PWMC_CMPV_CV_Pos)                /**< (PWMC_CMPV) Comparison x Value Mask */
#define PWMC_CMPV_CV(value)                   (PWMC_CMPV_CV_Msk & ((value) << PWMC_CMPV_CV_Pos))
#define PWMC_CMPV_CVM_Pos                     (24)                                           /**< (PWMC_CMPV) Comparison x Value Mode Position */
#define PWMC_CMPV_CVM_Msk                     (0x1U << PWMC_CMPV_CVM_Pos)                    /**< (PWMC_CMPV) Comparison x Value Mode Mask */
#define PWMC_CMPV_Msk                         (0x01FFFFFFUL)                                 /**< (PWMC_CMPV) Register Mask  */

/* -------- PWMC_CMPVUPD : (PWMC Offset: 0x04) (/W 32) PWMC Comparison 0 Value Update Register -------- */

typedef union
{
  struct
  {
    uint32_t CVUPD:24;                  /**< bit:  0..23  Comparison x Value Update                     */
    uint32_t CVMUPD:1;                  /**< bit:     24  Comparison x Value Mode Update                */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CMPVUPD_bits_t;

#define PWMC_CMPVUPD_CVUPD_Pos                (0)                                            /**< (PWMC_CMPVUPD) Comparison x Value Update Position */
#define PWMC_CMPVUPD_CVUPD_Msk                (0xFFFFFFU << PWMC_CMPVUPD_CVUPD_Pos)          /**< (PWMC_CMPVUPD) Comparison x Value Update Mask */
#define PWMC_CMPVUPD_CVUPD(value)             (PWMC_CMPVUPD_CVUPD_Msk & ((value) << PWMC_CMPVUPD_CVUPD_Pos))
#define PWMC_CMPVUPD_CVMUPD_Pos               (24)                                           /**< (PWMC_CMPVUPD) Comparison x Value Mode Update Position */
#define PWMC_CMPVUPD_CVMUPD_Msk               (0x1U << PWMC_CMPVUPD_CVMUPD_Pos)              /**< (PWMC_CMPVUPD) Comparison x Value Mode Update Mask */
#define PWMC_CMPVUPD_Msk                      (0x01FFFFFFUL)                                 /**< (PWMC_CMPVUPD) Register Mask  */

/* -------- PWMC_CMPM : (PWMC Offset: 0x08) (R/W 32) PWMC Comparison 0 Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t CEN:1;                     /**< bit:      0  Comparison x Enable                           */
    uint32_t :3;                        /**< bit:   1..3  Reserved                                      */
    uint32_t CTR:4;                     /**< bit:   4..7  Comparison x Trigger                          */
    uint32_t CPR:4;                     /**< bit:  8..11  Comparison x Period                           */
    uint32_t CPRCNT:4;                  /**< bit: 12..15  Comparison x Period Counter                   */
    uint32_t CUPR:4;                    /**< bit: 16..19  Comparison x Update Period                    */
    uint32_t CUPRCNT:4;                 /**< bit: 20..23  Comparison x Update Period Counter            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CMPM_bits_t;

#define PWMC_CMPM_CEN_Pos                     (0)                                            /**< (PWMC_CMPM) Comparison x Enable Position */
#define PWMC_CMPM_CEN_Msk                     (0x1U << PWMC_CMPM_CEN_Pos)                    /**< (PWMC_CMPM) Comparison x Enable Mask */
#define PWMC_CMPM_CTR_Pos                     (4)                                            /**< (PWMC_CMPM) Comparison x Trigger Position */
#define PWMC_CMPM_CTR_Msk                     (0xFU << PWMC_CMPM_CTR_Pos)                    /**< (PWMC_CMPM) Comparison x Trigger Mask */
#define PWMC_CMPM_CTR(value)                  (PWMC_CMPM_CTR_Msk & ((value) << PWMC_CMPM_CTR_Pos))
#define PWMC_CMPM_CPR_Pos                     (8)                                            /**< (PWMC_CMPM) Comparison x Period Position */
#define PWMC_CMPM_CPR_Msk                     (0xFU << PWMC_CMPM_CPR_Pos)                    /**< (PWMC_CMPM) Comparison x Period Mask */
#define PWMC_CMPM_CPR(value)                  (PWMC_CMPM_CPR_Msk & ((value) << PWMC_CMPM_CPR_Pos))
#define PWMC_CMPM_CPRCNT_Pos                  (12)                                           /**< (PWMC_CMPM) Comparison x Period Counter Position */
#define PWMC_CMPM_CPRCNT_Msk                  (0xFU << PWMC_CMPM_CPRCNT_Pos)                 /**< (PWMC_CMPM) Comparison x Period Counter Mask */
#define PWMC_CMPM_CPRCNT(value)               (PWMC_CMPM_CPRCNT_Msk & ((value) << PWMC_CMPM_CPRCNT_Pos))
#define PWMC_CMPM_CUPR_Pos                    (16)                                           /**< (PWMC_CMPM) Comparison x Update Period Position */
#define PWMC_CMPM_CUPR_Msk                    (0xFU << PWMC_CMPM_CUPR_Pos)                   /**< (PWMC_CMPM) Comparison x Update Period Mask */
#define PWMC_CMPM_CUPR(value)                 (PWMC_CMPM_CUPR_Msk & ((value) << PWMC_CMPM_CUPR_Pos))
#define PWMC_CMPM_CUPRCNT_Pos                 (20)                                           /**< (PWMC_CMPM) Comparison x Update Period Counter Position */
#define PWMC_CMPM_CUPRCNT_Msk                 (0xFU << PWMC_CMPM_CUPRCNT_Pos)                /**< (PWMC_CMPM) Comparison x Update Period Counter Mask */
#define PWMC_CMPM_CUPRCNT(value)              (PWMC_CMPM_CUPRCNT_Msk & ((value) << PWMC_CMPM_CUPRCNT_Pos))
#define PWMC_CMPM_Msk                         (0x00FFFFF1UL)                                 /**< (PWMC_CMPM) Register Mask  */

/* -------- PWMC_CMPMUPD : (PWMC Offset: 0x0c) (/W 32) PWMC Comparison 0 Mode Update Register -------- */

typedef union
{
  struct
  {
    uint32_t CENUPD:1;                  /**< bit:      0  Comparison x Enable Update                    */
    uint32_t :3;                        /**< bit:   1..3  Reserved                                      */
    uint32_t CTRUPD:4;                  /**< bit:   4..7  Comparison x Trigger Update                   */
    uint32_t CPRUPD:4;                  /**< bit:  8..11  Comparison x Period Update                    */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t CUPRUPD:4;                 /**< bit: 16..19  Comparison x Update Period Update             */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CMPMUPD_bits_t;

#define PWMC_CMPMUPD_CENUPD_Pos               (0)                                            /**< (PWMC_CMPMUPD) Comparison x Enable Update Position */
#define PWMC_CMPMUPD_CENUPD_Msk               (0x1U << PWMC_CMPMUPD_CENUPD_Pos)              /**< (PWMC_CMPMUPD) Comparison x Enable Update Mask */
#define PWMC_CMPMUPD_CTRUPD_Pos               (4)                                            /**< (PWMC_CMPMUPD) Comparison x Trigger Update Position */
#define PWMC_CMPMUPD_CTRUPD_Msk               (0xFU << PWMC_CMPMUPD_CTRUPD_Pos)              /**< (PWMC_CMPMUPD) Comparison x Trigger Update Mask */
#define PWMC_CMPMUPD_CTRUPD(value)            (PWMC_CMPMUPD_CTRUPD_Msk & ((value) << PWMC_CMPMUPD_CTRUPD_Pos))
#define PWMC_CMPMUPD_CPRUPD_Pos               (8)                                            /**< (PWMC_CMPMUPD) Comparison x Period Update Position */
#define PWMC_CMPMUPD_CPRUPD_Msk               (0xFU << PWMC_CMPMUPD_CPRUPD_Pos)              /**< (PWMC_CMPMUPD) Comparison x Period Update Mask */
#define PWMC_CMPMUPD_CPRUPD(value)            (PWMC_CMPMUPD_CPRUPD_Msk & ((value) << PWMC_CMPMUPD_CPRUPD_Pos))
#define PWMC_CMPMUPD_CUPRUPD_Pos              (16)                                           /**< (PWMC_CMPMUPD) Comparison x Update Period Update Position */
#define PWMC_CMPMUPD_CUPRUPD_Msk              (0xFU << PWMC_CMPMUPD_CUPRUPD_Pos)             /**< (PWMC_CMPMUPD) Comparison x Update Period Update Mask */
#define PWMC_CMPMUPD_CUPRUPD(value)           (PWMC_CMPMUPD_CUPRUPD_Msk & ((value) << PWMC_CMPMUPD_CUPRUPD_Pos))
#define PWMC_CMPMUPD_Msk                      (0x000F0FF1UL)                                 /**< (PWMC_CMPMUPD) Register Mask  */

/* -------- PWMC_CLK : (PWMC Offset: 0x00) (R/W 32) PWMC Clock Register -------- */

typedef union
{
  struct
  {
    uint32_t DIVA:8;                    /**< bit:   0..7  CLKA Divide Factor                            */
    uint32_t PREA:4;                    /**< bit:  8..11  CLKA Source Clock Selection                   */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t DIVB:8;                    /**< bit: 16..23  CLKB Divide Factor                            */
    uint32_t PREB:4;                    /**< bit: 24..27  CLKB Source Clock Selection                   */
    uint32_t :4;                        /**< bit: 28..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CLK_bits_t;

