zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
#define PWMC_CLK_DIVA_Pos                     (0)                                            /**< (PWMC_CLK) CLKA Divide Factor Position */
#define PWMC_CLK_DIVA_Msk                     (0xFFU << PWMC_CLK_DIVA_Pos)                   /**< (PWMC_CLK) CLKA Divide Factor Mask */
#define PWMC_CLK_DIVA(value)                  (PWMC_CLK_DIVA_Msk & ((value) << PWMC_CLK_DIVA_Pos))
#define   PWMC_CLK_DIVA_CLKA_POFF_Val         (0x0U)                                         /**< (PWMC_CLK) CLKA clock is turned off  */
#define   PWMC_CLK_DIVA_PREA_Val              (0x1U)                                         /**< (PWMC_CLK) CLKA clock is clock selected by PREA  */
#define PWMC_CLK_DIVA_CLKA_POFF               (PWMC_CLK_DIVA_CLKA_POFF_Val << PWMC_CLK_DIVA_Pos)  /**< (PWMC_CLK) CLKA clock is turned off Position  */
#define PWMC_CLK_DIVA_PREA                    (PWMC_CLK_DIVA_PREA_Val << PWMC_CLK_DIVA_Pos)  /**< (PWMC_CLK) CLKA clock is clock selected by PREA Position  */
#define PWMC_CLK_PREA_Pos                     (8)                                            /**< (PWMC_CLK) CLKA Source Clock Selection Position */
#define PWMC_CLK_PREA_Msk                     (0xFU << PWMC_CLK_PREA_Pos)                    /**< (PWMC_CLK) CLKA Source Clock Selection Mask */
#define PWMC_CLK_PREA(value)                  (PWMC_CLK_PREA_Msk & ((value) << PWMC_CLK_PREA_Pos))
#define   PWMC_CLK_PREA_CLK_Val               (0x0U)                                         /**< (PWMC_CLK) Peripheral clock  */
#define   PWMC_CLK_PREA_CLK_DIV2_Val          (0x1U)                                         /**< (PWMC_CLK) Peripheral clock/2  */
#define   PWMC_CLK_PREA_CLK_DIV4_Val          (0x2U)                                         /**< (PWMC_CLK) Peripheral clock/4  */
#define   PWMC_CLK_PREA_CLK_DIV8_Val          (0x3U)                                         /**< (PWMC_CLK) Peripheral clock/8  */
#define   PWMC_CLK_PREA_CLK_DIV16_Val         (0x4U)                                         /**< (PWMC_CLK) Peripheral clock/16  */
#define   PWMC_CLK_PREA_CLK_DIV32_Val         (0x5U)                                         /**< (PWMC_CLK) Peripheral clock/32  */
#define   PWMC_CLK_PREA_CLK_DIV64_Val         (0x6U)                                         /**< (PWMC_CLK) Peripheral clock/64  */
#define   PWMC_CLK_PREA_CLK_DIV128_Val        (0x7U)                                         /**< (PWMC_CLK) Peripheral clock/128  */
#define   PWMC_CLK_PREA_CLK_DIV256_Val        (0x8U)                                         /**< (PWMC_CLK) Peripheral clock/256  */
#define   PWMC_CLK_PREA_CLK_DIV512_Val        (0x9U)                                         /**< (PWMC_CLK) Peripheral clock/512  */
#define   PWMC_CLK_PREA_CLK_DIV1024_Val       (0xAU)                                         /**< (PWMC_CLK) Peripheral clock/1024  */
#define PWMC_CLK_PREA_CLK                     (PWMC_CLK_PREA_CLK_Val << PWMC_CLK_PREA_Pos)   /**< (PWMC_CLK) Peripheral clock Position  */
#define PWMC_CLK_PREA_CLK_DIV2                (PWMC_CLK_PREA_CLK_DIV2_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/2 Position  */
#define PWMC_CLK_PREA_CLK_DIV4                (PWMC_CLK_PREA_CLK_DIV4_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/4 Position  */
#define PWMC_CLK_PREA_CLK_DIV8                (PWMC_CLK_PREA_CLK_DIV8_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/8 Position  */
#define PWMC_CLK_PREA_CLK_DIV16               (PWMC_CLK_PREA_CLK_DIV16_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/16 Position  */
#define PWMC_CLK_PREA_CLK_DIV32               (PWMC_CLK_PREA_CLK_DIV32_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/32 Position  */
#define PWMC_CLK_PREA_CLK_DIV64               (PWMC_CLK_PREA_CLK_DIV64_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/64 Position  */
#define PWMC_CLK_PREA_CLK_DIV128              (PWMC_CLK_PREA_CLK_DIV128_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/128 Position  */
#define PWMC_CLK_PREA_CLK_DIV256              (PWMC_CLK_PREA_CLK_DIV256_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/256 Position  */
#define PWMC_CLK_PREA_CLK_DIV512              (PWMC_CLK_PREA_CLK_DIV512_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/512 Position  */
#define PWMC_CLK_PREA_CLK_DIV1024             (PWMC_CLK_PREA_CLK_DIV1024_Val << PWMC_CLK_PREA_Pos)  /**< (PWMC_CLK) Peripheral clock/1024 Position  */
#define PWMC_CLK_DIVB_Pos                     (16)                                           /**< (PWMC_CLK) CLKB Divide Factor Position */
#define PWMC_CLK_DIVB_Msk                     (0xFFU << PWMC_CLK_DIVB_Pos)                   /**< (PWMC_CLK) CLKB Divide Factor Mask */
#define PWMC_CLK_DIVB(value)                  (PWMC_CLK_DIVB_Msk & ((value) << PWMC_CLK_DIVB_Pos))
#define   PWMC_CLK_DIVB_CLKB_POFF_Val         (0x0U)                                         /**< (PWMC_CLK) CLKB clock is turned off  */
#define   PWMC_CLK_DIVB_PREB_Val              (0x1U)                                         /**< (PWMC_CLK) CLKB clock is clock selected by PREB  */
#define PWMC_CLK_DIVB_CLKB_POFF               (PWMC_CLK_DIVB_CLKB_POFF_Val << PWMC_CLK_DIVB_Pos)  /**< (PWMC_CLK) CLKB clock is turned off Position  */
#define PWMC_CLK_DIVB_PREB                    (PWMC_CLK_DIVB_PREB_Val << PWMC_CLK_DIVB_Pos)  /**< (PWMC_CLK) CLKB clock is clock selected by PREB Position  */
#define PWMC_CLK_PREB_Pos                     (24)                                           /**< (PWMC_CLK) CLKB Source Clock Selection Position */
#define PWMC_CLK_PREB_Msk                     (0xFU << PWMC_CLK_PREB_Pos)                    /**< (PWMC_CLK) CLKB Source Clock Selection Mask */
#define PWMC_CLK_PREB(value)                  (PWMC_CLK_PREB_Msk & ((value) << PWMC_CLK_PREB_Pos))
#define   PWMC_CLK_PREB_CLK_Val               (0x0U)                                         /**< (PWMC_CLK) Peripheral clock  */
#define   PWMC_CLK_PREB_CLK_DIV2_Val          (0x1U)                                         /**< (PWMC_CLK) Peripheral clock/2  */
#define   PWMC_CLK_PREB_CLK_DIV4_Val          (0x2U)                                         /**< (PWMC_CLK) Peripheral clock/4  */
#define   PWMC_CLK_PREB_CLK_DIV8_Val          (0x3U)                                         /**< (PWMC_CLK) Peripheral clock/8  */
#define   PWMC_CLK_PREB_CLK_DIV16_Val         (0x4U)                                         /**< (PWMC_CLK) Peripheral clock/16  */
#define   PWMC_CLK_PREB_CLK_DIV32_Val         (0x5U)                                         /**< (PWMC_CLK) Peripheral clock/32  */
#define   PWMC_CLK_PREB_CLK_DIV64_Val         (0x6U)                                         /**< (PWMC_CLK) Peripheral clock/64  */
#define   PWMC_CLK_PREB_CLK_DIV128_Val        (0x7U)                                         /**< (PWMC_CLK) Peripheral clock/128  */
#define   PWMC_CLK_PREB_CLK_DIV256_Val        (0x8U)                                         /**< (PWMC_CLK) Peripheral clock/256  */
#define   PWMC_CLK_PREB_CLK_DIV512_Val        (0x9U)                                         /**< (PWMC_CLK) Peripheral clock/512  */
#define   PWMC_CLK_PREB_CLK_DIV1024_Val       (0xAU)                                         /**< (PWMC_CLK) Peripheral clock/1024  */
#define PWMC_CLK_PREB_CLK                     (PWMC_CLK_PREB_CLK_Val << PWMC_CLK_PREB_Pos)   /**< (PWMC_CLK) Peripheral clock Position  */
#define PWMC_CLK_PREB_CLK_DIV2                (PWMC_CLK_PREB_CLK_DIV2_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/2 Position  */
#define PWMC_CLK_PREB_CLK_DIV4                (PWMC_CLK_PREB_CLK_DIV4_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/4 Position  */
#define PWMC_CLK_PREB_CLK_DIV8                (PWMC_CLK_PREB_CLK_DIV8_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/8 Position  */
#define PWMC_CLK_PREB_CLK_DIV16               (PWMC_CLK_PREB_CLK_DIV16_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/16 Position  */
#define PWMC_CLK_PREB_CLK_DIV32               (PWMC_CLK_PREB_CLK_DIV32_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/32 Position  */
#define PWMC_CLK_PREB_CLK_DIV64               (PWMC_CLK_PREB_CLK_DIV64_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/64 Position  */
#define PWMC_CLK_PREB_CLK_DIV128              (PWMC_CLK_PREB_CLK_DIV128_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/128 Position  */
#define PWMC_CLK_PREB_CLK_DIV256              (PWMC_CLK_PREB_CLK_DIV256_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/256 Position  */
#define PWMC_CLK_PREB_CLK_DIV512              (PWMC_CLK_PREB_CLK_DIV512_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/512 Position  */
#define PWMC_CLK_PREB_CLK_DIV1024             (PWMC_CLK_PREB_CLK_DIV1024_Val << PWMC_CLK_PREB_Pos)  /**< (PWMC_CLK) Peripheral clock/1024 Position  */
#define PWMC_CLK_Msk                          (0x0FFF0FFFUL)                                 /**< (PWMC_CLK) Register Mask  */

/* -------- PWMC_ENA : (PWMC Offset: 0x04) (/W 32) PWMC Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t CHID0:1;                   /**< bit:      0  Channel ID                                    */
    uint32_t CHID1:1;                   /**< bit:      1  Channel ID                                    */
    uint32_t CHID2:1;                   /**< bit:      2  Channel ID                                    */
    uint32_t CHID3:1;                   /**< bit:      3  Channel ID                                    */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  struct
  {
    uint32_t CHID:4;                    /**< bit:   0..3  Channel ID                                    */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_ENA_bits_t;

