zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
#define PWMC_ENA_CHID0_Pos                    (0)                                            /**< (PWMC_ENA) Channel ID Position */
#define PWMC_ENA_CHID0_Msk                    (0x1U << PWMC_ENA_CHID0_Pos)                   /**< (PWMC_ENA) Channel ID Mask */
#define PWMC_ENA_CHID1_Pos                    (1)                                            /**< (PWMC_ENA) Channel ID Position */
#define PWMC_ENA_CHID1_Msk                    (0x1U << PWMC_ENA_CHID1_Pos)                   /**< (PWMC_ENA) Channel ID Mask */
#define PWMC_ENA_CHID2_Pos                    (2)                                            /**< (PWMC_ENA) Channel ID Position */
#define PWMC_ENA_CHID2_Msk                    (0x1U << PWMC_ENA_CHID2_Pos)                   /**< (PWMC_ENA) Channel ID Mask */
#define PWMC_ENA_CHID3_Pos                    (3)                                            /**< (PWMC_ENA) Channel ID Position */
#define PWMC_ENA_CHID3_Msk                    (0x1U << PWMC_ENA_CHID3_Pos)                   /**< (PWMC_ENA) Channel ID Mask */
#define PWMC_ENA_Msk                          (0x0000000FUL)                                 /**< (PWMC_ENA) Register Mask  */
#define PWMC_ENA_CHID_Pos                     (0)                                            /**< (PWMC_ENA Position) Channel ID */
#define PWMC_ENA_CHID_Msk                     (0xFU << PWMC_ENA_CHID_Pos)                    /**< (PWMC_ENA Mask) CHID */
#define PWMC_ENA_CHID(value)                  (PWMC_ENA_CHID_Msk & ((value) << PWMC_ENA_CHID_Pos))

/* -------- PWMC_DIS : (PWMC Offset: 0x08) (/W 32) PWMC Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t CHID0:1;                   /**< bit:      0  Channel ID                                    */
    uint32_t CHID1:1;                   /**< bit:      1  Channel ID                                    */
    uint32_t CHID2:1;                   /**< bit:      2  Channel ID                                    */
    uint32_t CHID3:1;                   /**< bit:      3  Channel ID                                    */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  struct
  {
    uint32_t CHID:4;                    /**< bit:   0..3  Channel ID                                    */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_DIS_bits_t;

#define PWMC_DIS_CHID0_Pos                    (0)                                            /**< (PWMC_DIS) Channel ID Position */
#define PWMC_DIS_CHID0_Msk                    (0x1U << PWMC_DIS_CHID0_Pos)                   /**< (PWMC_DIS) Channel ID Mask */
#define PWMC_DIS_CHID1_Pos                    (1)                                            /**< (PWMC_DIS) Channel ID Position */
#define PWMC_DIS_CHID1_Msk                    (0x1U << PWMC_DIS_CHID1_Pos)                   /**< (PWMC_DIS) Channel ID Mask */
#define PWMC_DIS_CHID2_Pos                    (2)                                            /**< (PWMC_DIS) Channel ID Position */
#define PWMC_DIS_CHID2_Msk                    (0x1U << PWMC_DIS_CHID2_Pos)                   /**< (PWMC_DIS) Channel ID Mask */
#define PWMC_DIS_CHID3_Pos                    (3)                                            /**< (PWMC_DIS) Channel ID Position */
#define PWMC_DIS_CHID3_Msk                    (0x1U << PWMC_DIS_CHID3_Pos)                   /**< (PWMC_DIS) Channel ID Mask */
#define PWMC_DIS_Msk                          (0x0000000FUL)                                 /**< (PWMC_DIS) Register Mask  */
#define PWMC_DIS_CHID_Pos                     (0)                                            /**< (PWMC_DIS Position) Channel ID */
#define PWMC_DIS_CHID_Msk                     (0xFU << PWMC_DIS_CHID_Pos)                    /**< (PWMC_DIS Mask) CHID */
#define PWMC_DIS_CHID(value)                  (PWMC_DIS_CHID_Msk & ((value) << PWMC_DIS_CHID_Pos))

/* -------- PWMC_SR : (PWMC Offset: 0x0c) (R/ 32) PWMC Status Register -------- */

typedef union
{
  struct
  {
    uint32_t CHID0:1;                   /**< bit:      0  Channel ID                                    */
    uint32_t CHID1:1;                   /**< bit:      1  Channel ID                                    */
    uint32_t CHID2:1;                   /**< bit:      2  Channel ID                                    */
    uint32_t CHID3:1;                   /**< bit:      3  Channel ID                                    */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  struct
  {
    uint32_t CHID:4;                    /**< bit:   0..3  Channel ID                                    */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_SR_bits_t;

#define PWMC_SR_CHID0_Pos                     (0)                                            /**< (PWMC_SR) Channel ID Position */
#define PWMC_SR_CHID0_Msk                     (0x1U << PWMC_SR_CHID0_Pos)                    /**< (PWMC_SR) Channel ID Mask */
#define PWMC_SR_CHID1_Pos                     (1)                                            /**< (PWMC_SR) Channel ID Position */
#define PWMC_SR_CHID1_Msk                     (0x1U << PWMC_SR_CHID1_Pos)                    /**< (PWMC_SR) Channel ID Mask */
#define PWMC_SR_CHID2_Pos                     (2)                                            /**< (PWMC_SR) Channel ID Position */
#define PWMC_SR_CHID2_Msk                     (0x1U << PWMC_SR_CHID2_Pos)                    /**< (PWMC_SR) Channel ID Mask */
#define PWMC_SR_CHID3_Pos                     (3)                                            /**< (PWMC_SR) Channel ID Position */
#define PWMC_SR_CHID3_Msk                     (0x1U << PWMC_SR_CHID3_Pos)                    /**< (PWMC_SR) Channel ID Mask */
#define PWMC_SR_Msk                           (0x0000000FUL)                                 /**< (PWMC_SR) Register Mask  */
#define PWMC_SR_CHID_Pos                      (0)                                            /**< (PWMC_SR Position) Channel ID */
#define PWMC_SR_CHID_Msk                      (0xFU << PWMC_SR_CHID_Pos)                     /**< (PWMC_SR Mask) CHID */
#define PWMC_SR_CHID(value)                   (PWMC_SR_CHID_Msk & ((value) << PWMC_SR_CHID_Pos))

/* -------- PWMC_IER1 : (PWMC Offset: 0x10) (/W 32) PWMC Interrupt Enable Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t CHID0:1;                   /**< bit:      0  Counter Event on Channel 0 Interrupt Enable   */
    uint32_t CHID1:1;                   /**< bit:      1  Counter Event on Channel 1 Interrupt Enable   */
    uint32_t CHID2:1;                   /**< bit:      2  Counter Event on Channel 2 Interrupt Enable   */
    uint32_t CHID3:1;                   /**< bit:      3  Counter Event on Channel 3 Interrupt Enable   */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FCHID0:1;                  /**< bit:     16  Fault Protection Trigger on Channel 0 Interrupt Enable */
    uint32_t FCHID1:1;                  /**< bit:     17  Fault Protection Trigger on Channel 1 Interrupt Enable */
    uint32_t FCHID2:1;                  /**< bit:     18  Fault Protection Trigger on Channel 2 Interrupt Enable */
    uint32_t FCHID3:1;                  /**< bit:     19  Fault Protection Trigger on Channel 3 Interrupt Enable */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t CHID:4;                    /**< bit:   0..3  Counter Event on Channel x Interrupt Enable   */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FCHID:4;                   /**< bit: 16..19  Fault Protection Trigger on Channel 3 Interrupt Enable */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_IER1_bits_t;

#define PWMC_IER1_CHID0_Pos                   (0)                                            /**< (PWMC_IER1) Counter Event on Channel 0 Interrupt Enable Position */
#define PWMC_IER1_CHID0_Msk                   (0x1U << PWMC_IER1_CHID0_Pos)                  /**< (PWMC_IER1) Counter Event on Channel 0 Interrupt Enable Mask */
#define PWMC_IER1_CHID1_Pos                   (1)                                            /**< (PWMC_IER1) Counter Event on Channel 1 Interrupt Enable Position */
#define PWMC_IER1_CHID1_Msk                   (0x1U << PWMC_IER1_CHID1_Pos)                  /**< (PWMC_IER1) Counter Event on Channel 1 Interrupt Enable Mask */
#define PWMC_IER1_CHID2_Pos                   (2)                                            /**< (PWMC_IER1) Counter Event on Channel 2 Interrupt Enable Position */
#define PWMC_IER1_CHID2_Msk                   (0x1U << PWMC_IER1_CHID2_Pos)                  /**< (PWMC_IER1) Counter Event on Channel 2 Interrupt Enable Mask */
#define PWMC_IER1_CHID3_Pos                   (3)                                            /**< (PWMC_IER1) Counter Event on Channel 3 Interrupt Enable Position */
#define PWMC_IER1_CHID3_Msk                   (0x1U << PWMC_IER1_CHID3_Pos)                  /**< (PWMC_IER1) Counter Event on Channel 3 Interrupt Enable Mask */
#define PWMC_IER1_FCHID0_Pos                  (16)                                           /**< (PWMC_IER1) Fault Protection Trigger on Channel 0 Interrupt Enable Position */
#define PWMC_IER1_FCHID0_Msk                  (0x1U << PWMC_IER1_FCHID0_Pos)                 /**< (PWMC_IER1) Fault Protection Trigger on Channel 0 Interrupt Enable Mask */
#define PWMC_IER1_FCHID1_Pos                  (17)                                           /**< (PWMC_IER1) Fault Protection Trigger on Channel 1 Interrupt Enable Position */
#define PWMC_IER1_FCHID1_Msk                  (0x1U << PWMC_IER1_FCHID1_Pos)                 /**< (PWMC_IER1) Fault Protection Trigger on Channel 1 Interrupt Enable Mask */
#define PWMC_IER1_FCHID2_Pos                  (18)                                           /**< (PWMC_IER1) Fault Protection Trigger on Channel 2 Interrupt Enable Position */
#define PWMC_IER1_FCHID2_Msk                  (0x1U << PWMC_IER1_FCHID2_Pos)                 /**< (PWMC_IER1) Fault Protection Trigger on Channel 2 Interrupt Enable Mask */
#define PWMC_IER1_FCHID3_Pos                  (19)                                           /**< (PWMC_IER1) Fault Protection Trigger on Channel 3 Interrupt Enable Position */
#define PWMC_IER1_FCHID3_Msk                  (0x1U << PWMC_IER1_FCHID3_Pos)                 /**< (PWMC_IER1) Fault Protection Trigger on Channel 3 Interrupt Enable Mask */
#define PWMC_IER1_Msk                         (0x000F000FUL)                                 /**< (PWMC_IER1) Register Mask  */
#define PWMC_IER1_CHID_Pos                    (0)                                            /**< (PWMC_IER1 Position) Counter Event on Channel x Interrupt Enable */
#define PWMC_IER1_CHID_Msk                    (0xFU << PWMC_IER1_CHID_Pos)                   /**< (PWMC_IER1 Mask) CHID */
#define PWMC_IER1_CHID(value)                 (PWMC_IER1_CHID_Msk & ((value) << PWMC_IER1_CHID_Pos))
#define PWMC_IER1_FCHID_Pos                   (16)                                           /**< (PWMC_IER1 Position) Fault Protection Trigger on Channel 3 Interrupt Enable */
#define PWMC_IER1_FCHID_Msk                   (0xFU << PWMC_IER1_FCHID_Pos)                  /**< (PWMC_IER1 Mask) FCHID */
#define PWMC_IER1_FCHID(value)                (PWMC_IER1_FCHID_Msk & ((value) << PWMC_IER1_FCHID_Pos))

/* -------- PWMC_IDR1 : (PWMC Offset: 0x14) (/W 32) PWMC Interrupt Disable Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t CHID0:1;                   /**< bit:      0  Counter Event on Channel 0 Interrupt Disable  */
    uint32_t CHID1:1;                   /**< bit:      1  Counter Event on Channel 1 Interrupt Disable  */
    uint32_t CHID2:1;                   /**< bit:      2  Counter Event on Channel 2 Interrupt Disable  */
    uint32_t CHID3:1;                   /**< bit:      3  Counter Event on Channel 3 Interrupt Disable  */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FCHID0:1;                  /**< bit:     16  Fault Protection Trigger on Channel 0 Interrupt Disable */
    uint32_t FCHID1:1;                  /**< bit:     17  Fault Protection Trigger on Channel 1 Interrupt Disable */
    uint32_t FCHID2:1;                  /**< bit:     18  Fault Protection Trigger on Channel 2 Interrupt Disable */
    uint32_t FCHID3:1;                  /**< bit:     19  Fault Protection Trigger on Channel 3 Interrupt Disable */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t CHID:4;                    /**< bit:   0..3  Counter Event on Channel x Interrupt Disable  */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FCHID:4;                   /**< bit: 16..19  Fault Protection Trigger on Channel 3 Interrupt Disable */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_IDR1_bits_t;

