zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
#define PWMC_IDR1_CHID0_Pos                   (0)                                            /**< (PWMC_IDR1) Counter Event on Channel 0 Interrupt Disable Position */
#define PWMC_IDR1_CHID0_Msk                   (0x1U << PWMC_IDR1_CHID0_Pos)                  /**< (PWMC_IDR1) Counter Event on Channel 0 Interrupt Disable Mask */
#define PWMC_IDR1_CHID1_Pos                   (1)                                            /**< (PWMC_IDR1) Counter Event on Channel 1 Interrupt Disable Position */
#define PWMC_IDR1_CHID1_Msk                   (0x1U << PWMC_IDR1_CHID1_Pos)                  /**< (PWMC_IDR1) Counter Event on Channel 1 Interrupt Disable Mask */
#define PWMC_IDR1_CHID2_Pos                   (2)                                            /**< (PWMC_IDR1) Counter Event on Channel 2 Interrupt Disable Position */
#define PWMC_IDR1_CHID2_Msk                   (0x1U << PWMC_IDR1_CHID2_Pos)                  /**< (PWMC_IDR1) Counter Event on Channel 2 Interrupt Disable Mask */
#define PWMC_IDR1_CHID3_Pos                   (3)                                            /**< (PWMC_IDR1) Counter Event on Channel 3 Interrupt Disable Position */
#define PWMC_IDR1_CHID3_Msk                   (0x1U << PWMC_IDR1_CHID3_Pos)                  /**< (PWMC_IDR1) Counter Event on Channel 3 Interrupt Disable Mask */
#define PWMC_IDR1_FCHID0_Pos                  (16)                                           /**< (PWMC_IDR1) Fault Protection Trigger on Channel 0 Interrupt Disable Position */
#define PWMC_IDR1_FCHID0_Msk                  (0x1U << PWMC_IDR1_FCHID0_Pos)                 /**< (PWMC_IDR1) Fault Protection Trigger on Channel 0 Interrupt Disable Mask */
#define PWMC_IDR1_FCHID1_Pos                  (17)                                           /**< (PWMC_IDR1) Fault Protection Trigger on Channel 1 Interrupt Disable Position */
#define PWMC_IDR1_FCHID1_Msk                  (0x1U << PWMC_IDR1_FCHID1_Pos)                 /**< (PWMC_IDR1) Fault Protection Trigger on Channel 1 Interrupt Disable Mask */
#define PWMC_IDR1_FCHID2_Pos                  (18)                                           /**< (PWMC_IDR1) Fault Protection Trigger on Channel 2 Interrupt Disable Position */
#define PWMC_IDR1_FCHID2_Msk                  (0x1U << PWMC_IDR1_FCHID2_Pos)                 /**< (PWMC_IDR1) Fault Protection Trigger on Channel 2 Interrupt Disable Mask */
#define PWMC_IDR1_FCHID3_Pos                  (19)                                           /**< (PWMC_IDR1) Fault Protection Trigger on Channel 3 Interrupt Disable Position */
#define PWMC_IDR1_FCHID3_Msk                  (0x1U << PWMC_IDR1_FCHID3_Pos)                 /**< (PWMC_IDR1) Fault Protection Trigger on Channel 3 Interrupt Disable Mask */
#define PWMC_IDR1_Msk                         (0x000F000FUL)                                 /**< (PWMC_IDR1) Register Mask  */
#define PWMC_IDR1_CHID_Pos                    (0)                                            /**< (PWMC_IDR1 Position) Counter Event on Channel x Interrupt Disable */
#define PWMC_IDR1_CHID_Msk                    (0xFU << PWMC_IDR1_CHID_Pos)                   /**< (PWMC_IDR1 Mask) CHID */
#define PWMC_IDR1_CHID(value)                 (PWMC_IDR1_CHID_Msk & ((value) << PWMC_IDR1_CHID_Pos))
#define PWMC_IDR1_FCHID_Pos                   (16)                                           /**< (PWMC_IDR1 Position) Fault Protection Trigger on Channel 3 Interrupt Disable */
#define PWMC_IDR1_FCHID_Msk                   (0xFU << PWMC_IDR1_FCHID_Pos)                  /**< (PWMC_IDR1 Mask) FCHID */
#define PWMC_IDR1_FCHID(value)                (PWMC_IDR1_FCHID_Msk & ((value) << PWMC_IDR1_FCHID_Pos))

/* -------- PWMC_IMR1 : (PWMC Offset: 0x18) (R/ 32) PWMC Interrupt Mask Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t CHID0:1;                   /**< bit:      0  Counter Event on Channel 0 Interrupt Mask     */
    uint32_t CHID1:1;                   /**< bit:      1  Counter Event on Channel 1 Interrupt Mask     */
    uint32_t CHID2:1;                   /**< bit:      2  Counter Event on Channel 2 Interrupt Mask     */
    uint32_t CHID3:1;                   /**< bit:      3  Counter Event on Channel 3 Interrupt Mask     */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FCHID0:1;                  /**< bit:     16  Fault Protection Trigger on Channel 0 Interrupt Mask */
    uint32_t FCHID1:1;                  /**< bit:     17  Fault Protection Trigger on Channel 1 Interrupt Mask */
    uint32_t FCHID2:1;                  /**< bit:     18  Fault Protection Trigger on Channel 2 Interrupt Mask */
    uint32_t FCHID3:1;                  /**< bit:     19  Fault Protection Trigger on Channel 3 Interrupt Mask */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t CHID:4;                    /**< bit:   0..3  Counter Event on Channel x Interrupt Mask     */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FCHID:4;                   /**< bit: 16..19  Fault Protection Trigger on Channel 3 Interrupt Mask */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_IMR1_bits_t;

#define PWMC_IMR1_CHID0_Pos                   (0)                                            /**< (PWMC_IMR1) Counter Event on Channel 0 Interrupt Mask Position */
#define PWMC_IMR1_CHID0_Msk                   (0x1U << PWMC_IMR1_CHID0_Pos)                  /**< (PWMC_IMR1) Counter Event on Channel 0 Interrupt Mask Mask */
#define PWMC_IMR1_CHID1_Pos                   (1)                                            /**< (PWMC_IMR1) Counter Event on Channel 1 Interrupt Mask Position */
#define PWMC_IMR1_CHID1_Msk                   (0x1U << PWMC_IMR1_CHID1_Pos)                  /**< (PWMC_IMR1) Counter Event on Channel 1 Interrupt Mask Mask */
#define PWMC_IMR1_CHID2_Pos                   (2)                                            /**< (PWMC_IMR1) Counter Event on Channel 2 Interrupt Mask Position */
#define PWMC_IMR1_CHID2_Msk                   (0x1U << PWMC_IMR1_CHID2_Pos)                  /**< (PWMC_IMR1) Counter Event on Channel 2 Interrupt Mask Mask */
#define PWMC_IMR1_CHID3_Pos                   (3)                                            /**< (PWMC_IMR1) Counter Event on Channel 3 Interrupt Mask Position */
#define PWMC_IMR1_CHID3_Msk                   (0x1U << PWMC_IMR1_CHID3_Pos)                  /**< (PWMC_IMR1) Counter Event on Channel 3 Interrupt Mask Mask */
#define PWMC_IMR1_FCHID0_Pos                  (16)                                           /**< (PWMC_IMR1) Fault Protection Trigger on Channel 0 Interrupt Mask Position */
#define PWMC_IMR1_FCHID0_Msk                  (0x1U << PWMC_IMR1_FCHID0_Pos)                 /**< (PWMC_IMR1) Fault Protection Trigger on Channel 0 Interrupt Mask Mask */
#define PWMC_IMR1_FCHID1_Pos                  (17)                                           /**< (PWMC_IMR1) Fault Protection Trigger on Channel 1 Interrupt Mask Position */
#define PWMC_IMR1_FCHID1_Msk                  (0x1U << PWMC_IMR1_FCHID1_Pos)                 /**< (PWMC_IMR1) Fault Protection Trigger on Channel 1 Interrupt Mask Mask */
#define PWMC_IMR1_FCHID2_Pos                  (18)                                           /**< (PWMC_IMR1) Fault Protection Trigger on Channel 2 Interrupt Mask Position */
#define PWMC_IMR1_FCHID2_Msk                  (0x1U << PWMC_IMR1_FCHID2_Pos)                 /**< (PWMC_IMR1) Fault Protection Trigger on Channel 2 Interrupt Mask Mask */
#define PWMC_IMR1_FCHID3_Pos                  (19)                                           /**< (PWMC_IMR1) Fault Protection Trigger on Channel 3 Interrupt Mask Position */
#define PWMC_IMR1_FCHID3_Msk                  (0x1U << PWMC_IMR1_FCHID3_Pos)                 /**< (PWMC_IMR1) Fault Protection Trigger on Channel 3 Interrupt Mask Mask */
#define PWMC_IMR1_Msk                         (0x000F000FUL)                                 /**< (PWMC_IMR1) Register Mask  */
#define PWMC_IMR1_CHID_Pos                    (0)                                            /**< (PWMC_IMR1 Position) Counter Event on Channel x Interrupt Mask */
#define PWMC_IMR1_CHID_Msk                    (0xFU << PWMC_IMR1_CHID_Pos)                   /**< (PWMC_IMR1 Mask) CHID */
#define PWMC_IMR1_CHID(value)                 (PWMC_IMR1_CHID_Msk & ((value) << PWMC_IMR1_CHID_Pos))
#define PWMC_IMR1_FCHID_Pos                   (16)                                           /**< (PWMC_IMR1 Position) Fault Protection Trigger on Channel 3 Interrupt Mask */
#define PWMC_IMR1_FCHID_Msk                   (0xFU << PWMC_IMR1_FCHID_Pos)                  /**< (PWMC_IMR1 Mask) FCHID */
#define PWMC_IMR1_FCHID(value)                (PWMC_IMR1_FCHID_Msk & ((value) << PWMC_IMR1_FCHID_Pos))

