zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/* -------- PWMC_ISR1 : (PWMC Offset: 0x1c) (R/ 32) PWMC Interrupt Status Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t CHID0:1;                   /**< bit:      0  Counter Event on Channel 0                    */
    uint32_t CHID1:1;                   /**< bit:      1  Counter Event on Channel 1                    */
    uint32_t CHID2:1;                   /**< bit:      2  Counter Event on Channel 2                    */
    uint32_t CHID3:1;                   /**< bit:      3  Counter Event on Channel 3                    */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FCHID0:1;                  /**< bit:     16  Fault Protection Trigger on Channel 0         */
    uint32_t FCHID1:1;                  /**< bit:     17  Fault Protection Trigger on Channel 1         */
    uint32_t FCHID2:1;                  /**< bit:     18  Fault Protection Trigger on Channel 2         */
    uint32_t FCHID3:1;                  /**< bit:     19  Fault Protection Trigger on Channel 3         */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t CHID:4;                    /**< bit:   0..3  Counter Event on Channel x                    */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FCHID:4;                   /**< bit: 16..19  Fault Protection Trigger on Channel 3         */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_ISR1_bits_t;

#define PWMC_ISR1_CHID0_Pos                   (0)                                            /**< (PWMC_ISR1) Counter Event on Channel 0 Position */
#define PWMC_ISR1_CHID0_Msk                   (0x1U << PWMC_ISR1_CHID0_Pos)                  /**< (PWMC_ISR1) Counter Event on Channel 0 Mask */
#define PWMC_ISR1_CHID1_Pos                   (1)                                            /**< (PWMC_ISR1) Counter Event on Channel 1 Position */
#define PWMC_ISR1_CHID1_Msk                   (0x1U << PWMC_ISR1_CHID1_Pos)                  /**< (PWMC_ISR1) Counter Event on Channel 1 Mask */
#define PWMC_ISR1_CHID2_Pos                   (2)                                            /**< (PWMC_ISR1) Counter Event on Channel 2 Position */
#define PWMC_ISR1_CHID2_Msk                   (0x1U << PWMC_ISR1_CHID2_Pos)                  /**< (PWMC_ISR1) Counter Event on Channel 2 Mask */
#define PWMC_ISR1_CHID3_Pos                   (3)                                            /**< (PWMC_ISR1) Counter Event on Channel 3 Position */
#define PWMC_ISR1_CHID3_Msk                   (0x1U << PWMC_ISR1_CHID3_Pos)                  /**< (PWMC_ISR1) Counter Event on Channel 3 Mask */
#define PWMC_ISR1_FCHID0_Pos                  (16)                                           /**< (PWMC_ISR1) Fault Protection Trigger on Channel 0 Position */
#define PWMC_ISR1_FCHID0_Msk                  (0x1U << PWMC_ISR1_FCHID0_Pos)                 /**< (PWMC_ISR1) Fault Protection Trigger on Channel 0 Mask */
#define PWMC_ISR1_FCHID1_Pos                  (17)                                           /**< (PWMC_ISR1) Fault Protection Trigger on Channel 1 Position */
#define PWMC_ISR1_FCHID1_Msk                  (0x1U << PWMC_ISR1_FCHID1_Pos)                 /**< (PWMC_ISR1) Fault Protection Trigger on Channel 1 Mask */
#define PWMC_ISR1_FCHID2_Pos                  (18)                                           /**< (PWMC_ISR1) Fault Protection Trigger on Channel 2 Position */
#define PWMC_ISR1_FCHID2_Msk                  (0x1U << PWMC_ISR1_FCHID2_Pos)                 /**< (PWMC_ISR1) Fault Protection Trigger on Channel 2 Mask */
#define PWMC_ISR1_FCHID3_Pos                  (19)                                           /**< (PWMC_ISR1) Fault Protection Trigger on Channel 3 Position */
#define PWMC_ISR1_FCHID3_Msk                  (0x1U << PWMC_ISR1_FCHID3_Pos)                 /**< (PWMC_ISR1) Fault Protection Trigger on Channel 3 Mask */
#define PWMC_ISR1_Msk                         (0x000F000FUL)                                 /**< (PWMC_ISR1) Register Mask  */
#define PWMC_ISR1_CHID_Pos                    (0)                                            /**< (PWMC_ISR1 Position) Counter Event on Channel x */
#define PWMC_ISR1_CHID_Msk                    (0xFU << PWMC_ISR1_CHID_Pos)                   /**< (PWMC_ISR1 Mask) CHID */
#define PWMC_ISR1_CHID(value)                 (PWMC_ISR1_CHID_Msk & ((value) << PWMC_ISR1_CHID_Pos))
#define PWMC_ISR1_FCHID_Pos                   (16)                                           /**< (PWMC_ISR1 Position) Fault Protection Trigger on Channel 3 */
#define PWMC_ISR1_FCHID_Msk                   (0xFU << PWMC_ISR1_FCHID_Pos)                  /**< (PWMC_ISR1 Mask) FCHID */
#define PWMC_ISR1_FCHID(value)                (PWMC_ISR1_FCHID_Msk & ((value) << PWMC_ISR1_FCHID_Pos))

/* -------- PWMC_SCM : (PWMC Offset: 0x20) (R/W 32) PWMC Sync Channels Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t SYNC0:1;                   /**< bit:      0  Synchronous Channel 0                         */
    uint32_t SYNC1:1;                   /**< bit:      1  Synchronous Channel 1                         */
    uint32_t SYNC2:1;                   /**< bit:      2  Synchronous Channel 2                         */
    uint32_t SYNC3:1;                   /**< bit:      3  Synchronous Channel 3                         */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t UPDM:2;                    /**< bit: 16..17  Synchronous Channels Update Mode              */
    uint32_t :2;                        /**< bit: 18..19  Reserved                                      */
    uint32_t PTRM:1;                    /**< bit:     20  DMA Controller Transfer Request Mode          */
    uint32_t PTRCS:3;                   /**< bit: 21..23  DMA Controller Transfer Request Comparison Selection */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t SYNC:4;                    /**< bit:   0..3  Synchronous Channel x                         */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_SCM_bits_t;

#define PWMC_SCM_SYNC0_Pos                    (0)                                            /**< (PWMC_SCM) Synchronous Channel 0 Position */
#define PWMC_SCM_SYNC0_Msk                    (0x1U << PWMC_SCM_SYNC0_Pos)                   /**< (PWMC_SCM) Synchronous Channel 0 Mask */
#define PWMC_SCM_SYNC1_Pos                    (1)                                            /**< (PWMC_SCM) Synchronous Channel 1 Position */
#define PWMC_SCM_SYNC1_Msk                    (0x1U << PWMC_SCM_SYNC1_Pos)                   /**< (PWMC_SCM) Synchronous Channel 1 Mask */
#define PWMC_SCM_SYNC2_Pos                    (2)                                            /**< (PWMC_SCM) Synchronous Channel 2 Position */
#define PWMC_SCM_SYNC2_Msk                    (0x1U << PWMC_SCM_SYNC2_Pos)                   /**< (PWMC_SCM) Synchronous Channel 2 Mask */
#define PWMC_SCM_SYNC3_Pos                    (3)                                            /**< (PWMC_SCM) Synchronous Channel 3 Position */
#define PWMC_SCM_SYNC3_Msk                    (0x1U << PWMC_SCM_SYNC3_Pos)                   /**< (PWMC_SCM) Synchronous Channel 3 Mask */
#define PWMC_SCM_UPDM_Pos                     (16)                                           /**< (PWMC_SCM) Synchronous Channels Update Mode Position */
#define PWMC_SCM_UPDM_Msk                     (0x3U << PWMC_SCM_UPDM_Pos)                    /**< (PWMC_SCM) Synchronous Channels Update Mode Mask */
#define PWMC_SCM_UPDM(value)                  (PWMC_SCM_UPDM_Msk & ((value) << PWMC_SCM_UPDM_Pos))
#define PWMC_SCM_PTRM_Pos                     (20)                                           /**< (PWMC_SCM) DMA Controller Transfer Request Mode Position */
#define PWMC_SCM_PTRM_Msk                     (0x1U << PWMC_SCM_PTRM_Pos)                    /**< (PWMC_SCM) DMA Controller Transfer Request Mode Mask */
#define PWMC_SCM_PTRCS_Pos                    (21)                                           /**< (PWMC_SCM) DMA Controller Transfer Request Comparison Selection Position */
#define PWMC_SCM_PTRCS_Msk                    (0x7U << PWMC_SCM_PTRCS_Pos)                   /**< (PWMC_SCM) DMA Controller Transfer Request Comparison Selection Mask */
#define PWMC_SCM_PTRCS(value)                 (PWMC_SCM_PTRCS_Msk & ((value) << PWMC_SCM_PTRCS_Pos))
#define PWMC_SCM_Msk                          (0x00F3000FUL)                                 /**< (PWMC_SCM) Register Mask  */
#define PWMC_SCM_SYNC_Pos                     (0)                                            /**< (PWMC_SCM Position) Synchronous Channel x */
#define PWMC_SCM_SYNC_Msk                     (0xFU << PWMC_SCM_SYNC_Pos)                    /**< (PWMC_SCM Mask) SYNC */
#define PWMC_SCM_SYNC(value)                  (PWMC_SCM_SYNC_Msk & ((value) << PWMC_SCM_SYNC_Pos))

/* -------- PWMC_DMAR : (PWMC Offset: 0x24) (/W 32) PWMC DMA Register -------- */

typedef union
{
  struct
  {
    uint32_t DMADUTY:24;                /**< bit:  0..23  Duty-Cycle Holding Register for DMA Access    */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_DMAR_bits_t;

#define PWMC_DMAR_DMADUTY_Pos                 (0)                                            /**< (PWMC_DMAR) Duty-Cycle Holding Register for DMA Access Position */
#define PWMC_DMAR_DMADUTY_Msk                 (0xFFFFFFU << PWMC_DMAR_DMADUTY_Pos)           /**< (PWMC_DMAR) Duty-Cycle Holding Register for DMA Access Mask */
#define PWMC_DMAR_DMADUTY(value)              (PWMC_DMAR_DMADUTY_Msk & ((value) << PWMC_DMAR_DMADUTY_Pos))
#define PWMC_DMAR_Msk                         (0x00FFFFFFUL)                                 /**< (PWMC_DMAR) Register Mask  */

/* -------- PWMC_SCUC : (PWMC Offset: 0x28) (R/W 32) PWMC Sync Channels Update Control Register -------- */

typedef union
{
  struct
  {
    uint32_t UPDULOCK:1;                /**< bit:      0  Synchronous Channels Update Unlock            */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_SCUC_bits_t;

#define PWMC_SCUC_UPDULOCK_Pos                (0)                                            /**< (PWMC_SCUC) Synchronous Channels Update Unlock Position */
#define PWMC_SCUC_UPDULOCK_Msk                (0x1U << PWMC_SCUC_UPDULOCK_Pos)               /**< (PWMC_SCUC) Synchronous Channels Update Unlock Mask */
#define PWMC_SCUC_Msk                         (0x00000001UL)                                 /**< (PWMC_SCUC) Register Mask  */

