zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/* -------- PWMC_SCUP : (PWMC Offset: 0x2c) (R/W 32) PWMC Sync Channels Update Period Register -------- */

typedef union
{
  struct
  {
    uint32_t UPR:4;                     /**< bit:   0..3  Update Period                                 */
    uint32_t UPRCNT:4;                  /**< bit:   4..7  Update Period Counter                         */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_SCUP_bits_t;

#define PWMC_SCUP_UPR_Pos                     (0)                                            /**< (PWMC_SCUP) Update Period Position */
#define PWMC_SCUP_UPR_Msk                     (0xFU << PWMC_SCUP_UPR_Pos)                    /**< (PWMC_SCUP) Update Period Mask */
#define PWMC_SCUP_UPR(value)                  (PWMC_SCUP_UPR_Msk & ((value) << PWMC_SCUP_UPR_Pos))
#define PWMC_SCUP_UPRCNT_Pos                  (4)                                            /**< (PWMC_SCUP) Update Period Counter Position */
#define PWMC_SCUP_UPRCNT_Msk                  (0xFU << PWMC_SCUP_UPRCNT_Pos)                 /**< (PWMC_SCUP) Update Period Counter Mask */
#define PWMC_SCUP_UPRCNT(value)               (PWMC_SCUP_UPRCNT_Msk & ((value) << PWMC_SCUP_UPRCNT_Pos))
#define PWMC_SCUP_Msk                         (0x000000FFUL)                                 /**< (PWMC_SCUP) Register Mask  */

/* -------- PWMC_SCUPUPD : (PWMC Offset: 0x30) (/W 32) PWMC Sync Channels Update Period Update Register -------- */

typedef union
{
  struct
  {
    uint32_t UPRUPD:4;                  /**< bit:   0..3  Update Period Update                          */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_SCUPUPD_bits_t;

#define PWMC_SCUPUPD_UPRUPD_Pos               (0)                                            /**< (PWMC_SCUPUPD) Update Period Update Position */
#define PWMC_SCUPUPD_UPRUPD_Msk               (0xFU << PWMC_SCUPUPD_UPRUPD_Pos)              /**< (PWMC_SCUPUPD) Update Period Update Mask */
#define PWMC_SCUPUPD_UPRUPD(value)            (PWMC_SCUPUPD_UPRUPD_Msk & ((value) << PWMC_SCUPUPD_UPRUPD_Pos))
#define PWMC_SCUPUPD_Msk                      (0x0000000FUL)                                 /**< (PWMC_SCUPUPD) Register Mask  */

/* -------- PWMC_IER2 : (PWMC Offset: 0x34) (/W 32) PWMC Interrupt Enable Register 2 -------- */

typedef union
{
  struct
  {
    uint32_t WRDY:1;                    /**< bit:      0  Write Ready for Synchronous Channels Update Interrupt Enable */
    uint32_t :2;                        /**< bit:   1..2  Reserved                                      */
    uint32_t UNRE:1;                    /**< bit:      3  Synchronous Channels Update Underrun Error Interrupt Enable */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CMPM0:1;                   /**< bit:      8  Comparison 0 Match Interrupt Enable           */
    uint32_t CMPM1:1;                   /**< bit:      9  Comparison 1 Match Interrupt Enable           */
    uint32_t CMPM2:1;                   /**< bit:     10  Comparison 2 Match Interrupt Enable           */
    uint32_t CMPM3:1;                   /**< bit:     11  Comparison 3 Match Interrupt Enable           */
    uint32_t CMPM4:1;                   /**< bit:     12  Comparison 4 Match Interrupt Enable           */
    uint32_t CMPM5:1;                   /**< bit:     13  Comparison 5 Match Interrupt Enable           */
    uint32_t CMPM6:1;                   /**< bit:     14  Comparison 6 Match Interrupt Enable           */
    uint32_t CMPM7:1;                   /**< bit:     15  Comparison 7 Match Interrupt Enable           */
    uint32_t CMPU0:1;                   /**< bit:     16  Comparison 0 Update Interrupt Enable          */
    uint32_t CMPU1:1;                   /**< bit:     17  Comparison 1 Update Interrupt Enable          */
    uint32_t CMPU2:1;                   /**< bit:     18  Comparison 2 Update Interrupt Enable          */
    uint32_t CMPU3:1;                   /**< bit:     19  Comparison 3 Update Interrupt Enable          */
    uint32_t CMPU4:1;                   /**< bit:     20  Comparison 4 Update Interrupt Enable          */
    uint32_t CMPU5:1;                   /**< bit:     21  Comparison 5 Update Interrupt Enable          */
    uint32_t CMPU6:1;                   /**< bit:     22  Comparison 6 Update Interrupt Enable          */
    uint32_t CMPU7:1;                   /**< bit:     23  Comparison 7 Update Interrupt Enable          */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CMPM:8;                    /**< bit:  8..15  Comparison x Match Interrupt Enable           */
    uint32_t CMPU:8;                    /**< bit: 16..23  Comparison 7 Update Interrupt Enable          */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_IER2_bits_t;

#define PWMC_IER2_WRDY_Pos                    (0)                                            /**< (PWMC_IER2) Write Ready for Synchronous Channels Update Interrupt Enable Position */
#define PWMC_IER2_WRDY_Msk                    (0x1U << PWMC_IER2_WRDY_Pos)                   /**< (PWMC_IER2) Write Ready for Synchronous Channels Update Interrupt Enable Mask */
#define PWMC_IER2_UNRE_Pos                    (3)                                            /**< (PWMC_IER2) Synchronous Channels Update Underrun Error Interrupt Enable Position */
#define PWMC_IER2_UNRE_Msk                    (0x1U << PWMC_IER2_UNRE_Pos)                   /**< (PWMC_IER2) Synchronous Channels Update Underrun Error Interrupt Enable Mask */
#define PWMC_IER2_CMPM0_Pos                   (8)                                            /**< (PWMC_IER2) Comparison 0 Match Interrupt Enable Position */
#define PWMC_IER2_CMPM0_Msk                   (0x1U << PWMC_IER2_CMPM0_Pos)                  /**< (PWMC_IER2) Comparison 0 Match Interrupt Enable Mask */
#define PWMC_IER2_CMPM1_Pos                   (9)                                            /**< (PWMC_IER2) Comparison 1 Match Interrupt Enable Position */
#define PWMC_IER2_CMPM1_Msk                   (0x1U << PWMC_IER2_CMPM1_Pos)                  /**< (PWMC_IER2) Comparison 1 Match Interrupt Enable Mask */
#define PWMC_IER2_CMPM2_Pos                   (10)                                           /**< (PWMC_IER2) Comparison 2 Match Interrupt Enable Position */
#define PWMC_IER2_CMPM2_Msk                   (0x1U << PWMC_IER2_CMPM2_Pos)                  /**< (PWMC_IER2) Comparison 2 Match Interrupt Enable Mask */
#define PWMC_IER2_CMPM3_Pos                   (11)                                           /**< (PWMC_IER2) Comparison 3 Match Interrupt Enable Position */
#define PWMC_IER2_CMPM3_Msk                   (0x1U << PWMC_IER2_CMPM3_Pos)                  /**< (PWMC_IER2) Comparison 3 Match Interrupt Enable Mask */
#define PWMC_IER2_CMPM4_Pos                   (12)                                           /**< (PWMC_IER2) Comparison 4 Match Interrupt Enable Position */
#define PWMC_IER2_CMPM4_Msk                   (0x1U << PWMC_IER2_CMPM4_Pos)                  /**< (PWMC_IER2) Comparison 4 Match Interrupt Enable Mask */
#define PWMC_IER2_CMPM5_Pos                   (13)                                           /**< (PWMC_IER2) Comparison 5 Match Interrupt Enable Position */
#define PWMC_IER2_CMPM5_Msk                   (0x1U << PWMC_IER2_CMPM5_Pos)                  /**< (PWMC_IER2) Comparison 5 Match Interrupt Enable Mask */
#define PWMC_IER2_CMPM6_Pos                   (14)                                           /**< (PWMC_IER2) Comparison 6 Match Interrupt Enable Position */
#define PWMC_IER2_CMPM6_Msk                   (0x1U << PWMC_IER2_CMPM6_Pos)                  /**< (PWMC_IER2) Comparison 6 Match Interrupt Enable Mask */
#define PWMC_IER2_CMPM7_Pos                   (15)                                           /**< (PWMC_IER2) Comparison 7 Match Interrupt Enable Position */
#define PWMC_IER2_CMPM7_Msk                   (0x1U << PWMC_IER2_CMPM7_Pos)                  /**< (PWMC_IER2) Comparison 7 Match Interrupt Enable Mask */
#define PWMC_IER2_CMPU0_Pos                   (16)                                           /**< (PWMC_IER2) Comparison 0 Update Interrupt Enable Position */
#define PWMC_IER2_CMPU0_Msk                   (0x1U << PWMC_IER2_CMPU0_Pos)                  /**< (PWMC_IER2) Comparison 0 Update Interrupt Enable Mask */
#define PWMC_IER2_CMPU1_Pos                   (17)                                           /**< (PWMC_IER2) Comparison 1 Update Interrupt Enable Position */
#define PWMC_IER2_CMPU1_Msk                   (0x1U << PWMC_IER2_CMPU1_Pos)                  /**< (PWMC_IER2) Comparison 1 Update Interrupt Enable Mask */
#define PWMC_IER2_CMPU2_Pos                   (18)                                           /**< (PWMC_IER2) Comparison 2 Update Interrupt Enable Position */
#define PWMC_IER2_CMPU2_Msk                   (0x1U << PWMC_IER2_CMPU2_Pos)                  /**< (PWMC_IER2) Comparison 2 Update Interrupt Enable Mask */
#define PWMC_IER2_CMPU3_Pos                   (19)                                           /**< (PWMC_IER2) Comparison 3 Update Interrupt Enable Position */
#define PWMC_IER2_CMPU3_Msk                   (0x1U << PWMC_IER2_CMPU3_Pos)                  /**< (PWMC_IER2) Comparison 3 Update Interrupt Enable Mask */
#define PWMC_IER2_CMPU4_Pos                   (20)                                           /**< (PWMC_IER2) Comparison 4 Update Interrupt Enable Position */
#define PWMC_IER2_CMPU4_Msk                   (0x1U << PWMC_IER2_CMPU4_Pos)                  /**< (PWMC_IER2) Comparison 4 Update Interrupt Enable Mask */
#define PWMC_IER2_CMPU5_Pos                   (21)                                           /**< (PWMC_IER2) Comparison 5 Update Interrupt Enable Position */
#define PWMC_IER2_CMPU5_Msk                   (0x1U << PWMC_IER2_CMPU5_Pos)                  /**< (PWMC_IER2) Comparison 5 Update Interrupt Enable Mask */
#define PWMC_IER2_CMPU6_Pos                   (22)                                           /**< (PWMC_IER2) Comparison 6 Update Interrupt Enable Position */
#define PWMC_IER2_CMPU6_Msk                   (0x1U << PWMC_IER2_CMPU6_Pos)                  /**< (PWMC_IER2) Comparison 6 Update Interrupt Enable Mask */
#define PWMC_IER2_CMPU7_Pos                   (23)                                           /**< (PWMC_IER2) Comparison 7 Update Interrupt Enable Position */
#define PWMC_IER2_CMPU7_Msk                   (0x1U << PWMC_IER2_CMPU7_Pos)                  /**< (PWMC_IER2) Comparison 7 Update Interrupt Enable Mask */
#define PWMC_IER2_Msk                         (0x00FFFF09UL)                                 /**< (PWMC_IER2) Register Mask  */
#define PWMC_IER2_CMPM_Pos                    (8)                                            /**< (PWMC_IER2 Position) Comparison x Match Interrupt Enable */
#define PWMC_IER2_CMPM_Msk                    (0xFFU << PWMC_IER2_CMPM_Pos)                  /**< (PWMC_IER2 Mask) CMPM */
#define PWMC_IER2_CMPM(value)                 (PWMC_IER2_CMPM_Msk & ((value) << PWMC_IER2_CMPM_Pos))
#define PWMC_IER2_CMPU_Pos                    (16)                                           /**< (PWMC_IER2 Position) Comparison 7 Update Interrupt Enable */
#define PWMC_IER2_CMPU_Msk                    (0xFFU << PWMC_IER2_CMPU_Pos)                  /**< (PWMC_IER2 Mask) CMPU */
#define PWMC_IER2_CMPU(value)                 (PWMC_IER2_CMPU_Msk & ((value) << PWMC_IER2_CMPU_Pos))

/* -------- PWMC_IDR2 : (PWMC Offset: 0x38) (/W 32) PWMC Interrupt Disable Register 2 -------- */

typedef union
{
  struct
  {
    uint32_t WRDY:1;                    /**< bit:      0  Write Ready for Synchronous Channels Update Interrupt Disable */
    uint32_t :2;                        /**< bit:   1..2  Reserved                                      */
    uint32_t UNRE:1;                    /**< bit:      3  Synchronous Channels Update Underrun Error Interrupt Disable */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CMPM0:1;                   /**< bit:      8  Comparison 0 Match Interrupt Disable          */
    uint32_t CMPM1:1;                   /**< bit:      9  Comparison 1 Match Interrupt Disable          */
    uint32_t CMPM2:1;                   /**< bit:     10  Comparison 2 Match Interrupt Disable          */
    uint32_t CMPM3:1;                   /**< bit:     11  Comparison 3 Match Interrupt Disable          */
    uint32_t CMPM4:1;                   /**< bit:     12  Comparison 4 Match Interrupt Disable          */
    uint32_t CMPM5:1;                   /**< bit:     13  Comparison 5 Match Interrupt Disable          */
    uint32_t CMPM6:1;                   /**< bit:     14  Comparison 6 Match Interrupt Disable          */
    uint32_t CMPM7:1;                   /**< bit:     15  Comparison 7 Match Interrupt Disable          */
    uint32_t CMPU0:1;                   /**< bit:     16  Comparison 0 Update Interrupt Disable         */
    uint32_t CMPU1:1;                   /**< bit:     17  Comparison 1 Update Interrupt Disable         */
    uint32_t CMPU2:1;                   /**< bit:     18  Comparison 2 Update Interrupt Disable         */
    uint32_t CMPU3:1;                   /**< bit:     19  Comparison 3 Update Interrupt Disable         */
    uint32_t CMPU4:1;                   /**< bit:     20  Comparison 4 Update Interrupt Disable         */
    uint32_t CMPU5:1;                   /**< bit:     21  Comparison 5 Update Interrupt Disable         */
    uint32_t CMPU6:1;                   /**< bit:     22  Comparison 6 Update Interrupt Disable         */
    uint32_t CMPU7:1;                   /**< bit:     23  Comparison 7 Update Interrupt Disable         */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CMPM:8;                    /**< bit:  8..15  Comparison x Match Interrupt Disable          */
    uint32_t CMPU:8;                    /**< bit: 16..23  Comparison 7 Update Interrupt Disable         */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_IDR2_bits_t;

