zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
#define PWMC_IDR2_WRDY_Pos                    (0)                                            /**< (PWMC_IDR2) Write Ready for Synchronous Channels Update Interrupt Disable Position */
#define PWMC_IDR2_WRDY_Msk                    (0x1U << PWMC_IDR2_WRDY_Pos)                   /**< (PWMC_IDR2) Write Ready for Synchronous Channels Update Interrupt Disable Mask */
#define PWMC_IDR2_UNRE_Pos                    (3)                                            /**< (PWMC_IDR2) Synchronous Channels Update Underrun Error Interrupt Disable Position */
#define PWMC_IDR2_UNRE_Msk                    (0x1U << PWMC_IDR2_UNRE_Pos)                   /**< (PWMC_IDR2) Synchronous Channels Update Underrun Error Interrupt Disable Mask */
#define PWMC_IDR2_CMPM0_Pos                   (8)                                            /**< (PWMC_IDR2) Comparison 0 Match Interrupt Disable Position */
#define PWMC_IDR2_CMPM0_Msk                   (0x1U << PWMC_IDR2_CMPM0_Pos)                  /**< (PWMC_IDR2) Comparison 0 Match Interrupt Disable Mask */
#define PWMC_IDR2_CMPM1_Pos                   (9)                                            /**< (PWMC_IDR2) Comparison 1 Match Interrupt Disable Position */
#define PWMC_IDR2_CMPM1_Msk                   (0x1U << PWMC_IDR2_CMPM1_Pos)                  /**< (PWMC_IDR2) Comparison 1 Match Interrupt Disable Mask */
#define PWMC_IDR2_CMPM2_Pos                   (10)                                           /**< (PWMC_IDR2) Comparison 2 Match Interrupt Disable Position */
#define PWMC_IDR2_CMPM2_Msk                   (0x1U << PWMC_IDR2_CMPM2_Pos)                  /**< (PWMC_IDR2) Comparison 2 Match Interrupt Disable Mask */
#define PWMC_IDR2_CMPM3_Pos                   (11)                                           /**< (PWMC_IDR2) Comparison 3 Match Interrupt Disable Position */
#define PWMC_IDR2_CMPM3_Msk                   (0x1U << PWMC_IDR2_CMPM3_Pos)                  /**< (PWMC_IDR2) Comparison 3 Match Interrupt Disable Mask */
#define PWMC_IDR2_CMPM4_Pos                   (12)                                           /**< (PWMC_IDR2) Comparison 4 Match Interrupt Disable Position */
#define PWMC_IDR2_CMPM4_Msk                   (0x1U << PWMC_IDR2_CMPM4_Pos)                  /**< (PWMC_IDR2) Comparison 4 Match Interrupt Disable Mask */
#define PWMC_IDR2_CMPM5_Pos                   (13)                                           /**< (PWMC_IDR2) Comparison 5 Match Interrupt Disable Position */
#define PWMC_IDR2_CMPM5_Msk                   (0x1U << PWMC_IDR2_CMPM5_Pos)                  /**< (PWMC_IDR2) Comparison 5 Match Interrupt Disable Mask */
#define PWMC_IDR2_CMPM6_Pos                   (14)                                           /**< (PWMC_IDR2) Comparison 6 Match Interrupt Disable Position */
#define PWMC_IDR2_CMPM6_Msk                   (0x1U << PWMC_IDR2_CMPM6_Pos)                  /**< (PWMC_IDR2) Comparison 6 Match Interrupt Disable Mask */
#define PWMC_IDR2_CMPM7_Pos                   (15)                                           /**< (PWMC_IDR2) Comparison 7 Match Interrupt Disable Position */
#define PWMC_IDR2_CMPM7_Msk                   (0x1U << PWMC_IDR2_CMPM7_Pos)                  /**< (PWMC_IDR2) Comparison 7 Match Interrupt Disable Mask */
#define PWMC_IDR2_CMPU0_Pos                   (16)                                           /**< (PWMC_IDR2) Comparison 0 Update Interrupt Disable Position */
#define PWMC_IDR2_CMPU0_Msk                   (0x1U << PWMC_IDR2_CMPU0_Pos)                  /**< (PWMC_IDR2) Comparison 0 Update Interrupt Disable Mask */
#define PWMC_IDR2_CMPU1_Pos                   (17)                                           /**< (PWMC_IDR2) Comparison 1 Update Interrupt Disable Position */
#define PWMC_IDR2_CMPU1_Msk                   (0x1U << PWMC_IDR2_CMPU1_Pos)                  /**< (PWMC_IDR2) Comparison 1 Update Interrupt Disable Mask */
#define PWMC_IDR2_CMPU2_Pos                   (18)                                           /**< (PWMC_IDR2) Comparison 2 Update Interrupt Disable Position */
#define PWMC_IDR2_CMPU2_Msk                   (0x1U << PWMC_IDR2_CMPU2_Pos)                  /**< (PWMC_IDR2) Comparison 2 Update Interrupt Disable Mask */
#define PWMC_IDR2_CMPU3_Pos                   (19)                                           /**< (PWMC_IDR2) Comparison 3 Update Interrupt Disable Position */
#define PWMC_IDR2_CMPU3_Msk                   (0x1U << PWMC_IDR2_CMPU3_Pos)                  /**< (PWMC_IDR2) Comparison 3 Update Interrupt Disable Mask */
#define PWMC_IDR2_CMPU4_Pos                   (20)                                           /**< (PWMC_IDR2) Comparison 4 Update Interrupt Disable Position */
#define PWMC_IDR2_CMPU4_Msk                   (0x1U << PWMC_IDR2_CMPU4_Pos)                  /**< (PWMC_IDR2) Comparison 4 Update Interrupt Disable Mask */
#define PWMC_IDR2_CMPU5_Pos                   (21)                                           /**< (PWMC_IDR2) Comparison 5 Update Interrupt Disable Position */
#define PWMC_IDR2_CMPU5_Msk                   (0x1U << PWMC_IDR2_CMPU5_Pos)                  /**< (PWMC_IDR2) Comparison 5 Update Interrupt Disable Mask */
#define PWMC_IDR2_CMPU6_Pos                   (22)                                           /**< (PWMC_IDR2) Comparison 6 Update Interrupt Disable Position */
#define PWMC_IDR2_CMPU6_Msk                   (0x1U << PWMC_IDR2_CMPU6_Pos)                  /**< (PWMC_IDR2) Comparison 6 Update Interrupt Disable Mask */
#define PWMC_IDR2_CMPU7_Pos                   (23)                                           /**< (PWMC_IDR2) Comparison 7 Update Interrupt Disable Position */
#define PWMC_IDR2_CMPU7_Msk                   (0x1U << PWMC_IDR2_CMPU7_Pos)                  /**< (PWMC_IDR2) Comparison 7 Update Interrupt Disable Mask */
#define PWMC_IDR2_Msk                         (0x00FFFF09UL)                                 /**< (PWMC_IDR2) Register Mask  */
#define PWMC_IDR2_CMPM_Pos                    (8)                                            /**< (PWMC_IDR2 Position) Comparison x Match Interrupt Disable */
#define PWMC_IDR2_CMPM_Msk                    (0xFFU << PWMC_IDR2_CMPM_Pos)                  /**< (PWMC_IDR2 Mask) CMPM */
#define PWMC_IDR2_CMPM(value)                 (PWMC_IDR2_CMPM_Msk & ((value) << PWMC_IDR2_CMPM_Pos))
#define PWMC_IDR2_CMPU_Pos                    (16)                                           /**< (PWMC_IDR2 Position) Comparison 7 Update Interrupt Disable */
#define PWMC_IDR2_CMPU_Msk                    (0xFFU << PWMC_IDR2_CMPU_Pos)                  /**< (PWMC_IDR2 Mask) CMPU */
#define PWMC_IDR2_CMPU(value)                 (PWMC_IDR2_CMPU_Msk & ((value) << PWMC_IDR2_CMPU_Pos))

/* -------- PWMC_IMR2 : (PWMC Offset: 0x3c) (R/ 32) PWMC Interrupt Mask Register 2 -------- */

typedef union
{
  struct
  {
    uint32_t WRDY:1;                    /**< bit:      0  Write Ready for Synchronous Channels Update Interrupt Mask */
    uint32_t :2;                        /**< bit:   1..2  Reserved                                      */
    uint32_t UNRE:1;                    /**< bit:      3  Synchronous Channels Update Underrun Error Interrupt Mask */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CMPM0:1;                   /**< bit:      8  Comparison 0 Match Interrupt Mask             */
    uint32_t CMPM1:1;                   /**< bit:      9  Comparison 1 Match Interrupt Mask             */
    uint32_t CMPM2:1;                   /**< bit:     10  Comparison 2 Match Interrupt Mask             */
    uint32_t CMPM3:1;                   /**< bit:     11  Comparison 3 Match Interrupt Mask             */
    uint32_t CMPM4:1;                   /**< bit:     12  Comparison 4 Match Interrupt Mask             */
    uint32_t CMPM5:1;                   /**< bit:     13  Comparison 5 Match Interrupt Mask             */
    uint32_t CMPM6:1;                   /**< bit:     14  Comparison 6 Match Interrupt Mask             */
    uint32_t CMPM7:1;                   /**< bit:     15  Comparison 7 Match Interrupt Mask             */
    uint32_t CMPU0:1;                   /**< bit:     16  Comparison 0 Update Interrupt Mask            */
    uint32_t CMPU1:1;                   /**< bit:     17  Comparison 1 Update Interrupt Mask            */
    uint32_t CMPU2:1;                   /**< bit:     18  Comparison 2 Update Interrupt Mask            */
    uint32_t CMPU3:1;                   /**< bit:     19  Comparison 3 Update Interrupt Mask            */
    uint32_t CMPU4:1;                   /**< bit:     20  Comparison 4 Update Interrupt Mask            */
    uint32_t CMPU5:1;                   /**< bit:     21  Comparison 5 Update Interrupt Mask            */
    uint32_t CMPU6:1;                   /**< bit:     22  Comparison 6 Update Interrupt Mask            */
    uint32_t CMPU7:1;                   /**< bit:     23  Comparison 7 Update Interrupt Mask            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CMPM:8;                    /**< bit:  8..15  Comparison x Match Interrupt Mask             */
    uint32_t CMPU:8;                    /**< bit: 16..23  Comparison 7 Update Interrupt Mask            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_IMR2_bits_t;

#define PWMC_IMR2_WRDY_Pos                    (0)                                            /**< (PWMC_IMR2) Write Ready for Synchronous Channels Update Interrupt Mask Position */
#define PWMC_IMR2_WRDY_Msk                    (0x1U << PWMC_IMR2_WRDY_Pos)                   /**< (PWMC_IMR2) Write Ready for Synchronous Channels Update Interrupt Mask Mask */
#define PWMC_IMR2_UNRE_Pos                    (3)                                            /**< (PWMC_IMR2) Synchronous Channels Update Underrun Error Interrupt Mask Position */
#define PWMC_IMR2_UNRE_Msk                    (0x1U << PWMC_IMR2_UNRE_Pos)                   /**< (PWMC_IMR2) Synchronous Channels Update Underrun Error Interrupt Mask Mask */
#define PWMC_IMR2_CMPM0_Pos                   (8)                                            /**< (PWMC_IMR2) Comparison 0 Match Interrupt Mask Position */
#define PWMC_IMR2_CMPM0_Msk                   (0x1U << PWMC_IMR2_CMPM0_Pos)                  /**< (PWMC_IMR2) Comparison 0 Match Interrupt Mask Mask */
#define PWMC_IMR2_CMPM1_Pos                   (9)                                            /**< (PWMC_IMR2) Comparison 1 Match Interrupt Mask Position */
#define PWMC_IMR2_CMPM1_Msk                   (0x1U << PWMC_IMR2_CMPM1_Pos)                  /**< (PWMC_IMR2) Comparison 1 Match Interrupt Mask Mask */
#define PWMC_IMR2_CMPM2_Pos                   (10)                                           /**< (PWMC_IMR2) Comparison 2 Match Interrupt Mask Position */
#define PWMC_IMR2_CMPM2_Msk                   (0x1U << PWMC_IMR2_CMPM2_Pos)                  /**< (PWMC_IMR2) Comparison 2 Match Interrupt Mask Mask */
#define PWMC_IMR2_CMPM3_Pos                   (11)                                           /**< (PWMC_IMR2) Comparison 3 Match Interrupt Mask Position */
#define PWMC_IMR2_CMPM3_Msk                   (0x1U << PWMC_IMR2_CMPM3_Pos)                  /**< (PWMC_IMR2) Comparison 3 Match Interrupt Mask Mask */
#define PWMC_IMR2_CMPM4_Pos                   (12)                                           /**< (PWMC_IMR2) Comparison 4 Match Interrupt Mask Position */
#define PWMC_IMR2_CMPM4_Msk                   (0x1U << PWMC_IMR2_CMPM4_Pos)                  /**< (PWMC_IMR2) Comparison 4 Match Interrupt Mask Mask */
#define PWMC_IMR2_CMPM5_Pos                   (13)                                           /**< (PWMC_IMR2) Comparison 5 Match Interrupt Mask Position */
#define PWMC_IMR2_CMPM5_Msk                   (0x1U << PWMC_IMR2_CMPM5_Pos)                  /**< (PWMC_IMR2) Comparison 5 Match Interrupt Mask Mask */
#define PWMC_IMR2_CMPM6_Pos                   (14)                                           /**< (PWMC_IMR2) Comparison 6 Match Interrupt Mask Position */
#define PWMC_IMR2_CMPM6_Msk                   (0x1U << PWMC_IMR2_CMPM6_Pos)                  /**< (PWMC_IMR2) Comparison 6 Match Interrupt Mask Mask */
#define PWMC_IMR2_CMPM7_Pos                   (15)                                           /**< (PWMC_IMR2) Comparison 7 Match Interrupt Mask Position */
#define PWMC_IMR2_CMPM7_Msk                   (0x1U << PWMC_IMR2_CMPM7_Pos)                  /**< (PWMC_IMR2) Comparison 7 Match Interrupt Mask Mask */
#define PWMC_IMR2_CMPU0_Pos                   (16)                                           /**< (PWMC_IMR2) Comparison 0 Update Interrupt Mask Position */
#define PWMC_IMR2_CMPU0_Msk                   (0x1U << PWMC_IMR2_CMPU0_Pos)                  /**< (PWMC_IMR2) Comparison 0 Update Interrupt Mask Mask */
#define PWMC_IMR2_CMPU1_Pos                   (17)                                           /**< (PWMC_IMR2) Comparison 1 Update Interrupt Mask Position */
#define PWMC_IMR2_CMPU1_Msk                   (0x1U << PWMC_IMR2_CMPU1_Pos)                  /**< (PWMC_IMR2) Comparison 1 Update Interrupt Mask Mask */
#define PWMC_IMR2_CMPU2_Pos                   (18)                                           /**< (PWMC_IMR2) Comparison 2 Update Interrupt Mask Position */
#define PWMC_IMR2_CMPU2_Msk                   (0x1U << PWMC_IMR2_CMPU2_Pos)                  /**< (PWMC_IMR2) Comparison 2 Update Interrupt Mask Mask */
#define PWMC_IMR2_CMPU3_Pos                   (19)                                           /**< (PWMC_IMR2) Comparison 3 Update Interrupt Mask Position */
#define PWMC_IMR2_CMPU3_Msk                   (0x1U << PWMC_IMR2_CMPU3_Pos)                  /**< (PWMC_IMR2) Comparison 3 Update Interrupt Mask Mask */
#define PWMC_IMR2_CMPU4_Pos                   (20)                                           /**< (PWMC_IMR2) Comparison 4 Update Interrupt Mask Position */
#define PWMC_IMR2_CMPU4_Msk                   (0x1U << PWMC_IMR2_CMPU4_Pos)                  /**< (PWMC_IMR2) Comparison 4 Update Interrupt Mask Mask */
#define PWMC_IMR2_CMPU5_Pos                   (21)                                           /**< (PWMC_IMR2) Comparison 5 Update Interrupt Mask Position */
#define PWMC_IMR2_CMPU5_Msk                   (0x1U << PWMC_IMR2_CMPU5_Pos)                  /**< (PWMC_IMR2) Comparison 5 Update Interrupt Mask Mask */
#define PWMC_IMR2_CMPU6_Pos                   (22)                                           /**< (PWMC_IMR2) Comparison 6 Update Interrupt Mask Position */
#define PWMC_IMR2_CMPU6_Msk                   (0x1U << PWMC_IMR2_CMPU6_Pos)                  /**< (PWMC_IMR2) Comparison 6 Update Interrupt Mask Mask */
#define PWMC_IMR2_CMPU7_Pos                   (23)                                           /**< (PWMC_IMR2) Comparison 7 Update Interrupt Mask Position */
#define PWMC_IMR2_CMPU7_Msk                   (0x1U << PWMC_IMR2_CMPU7_Pos)                  /**< (PWMC_IMR2) Comparison 7 Update Interrupt Mask Mask */
#define PWMC_IMR2_Msk                         (0x00FFFF09UL)                                 /**< (PWMC_IMR2) Register Mask  */
#define PWMC_IMR2_CMPM_Pos                    (8)                                            /**< (PWMC_IMR2 Position) Comparison x Match Interrupt Mask */
#define PWMC_IMR2_CMPM_Msk                    (0xFFU << PWMC_IMR2_CMPM_Pos)                  /**< (PWMC_IMR2 Mask) CMPM */
#define PWMC_IMR2_CMPM(value)                 (PWMC_IMR2_CMPM_Msk & ((value) << PWMC_IMR2_CMPM_Pos))
#define PWMC_IMR2_CMPU_Pos                    (16)                                           /**< (PWMC_IMR2 Position) Comparison 7 Update Interrupt Mask */
#define PWMC_IMR2_CMPU_Msk                    (0xFFU << PWMC_IMR2_CMPU_Pos)                  /**< (PWMC_IMR2 Mask) CMPU */
#define PWMC_IMR2_CMPU(value)                 (PWMC_IMR2_CMPU_Msk & ((value) << PWMC_IMR2_CMPU_Pos))

