zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/* -------- PWMC_ISR2 : (PWMC Offset: 0x40) (R/ 32) PWMC Interrupt Status Register 2 -------- */

typedef union
{
  struct
  {
    uint32_t WRDY:1;                    /**< bit:      0  Write Ready for Synchronous Channels Update   */
    uint32_t :2;                        /**< bit:   1..2  Reserved                                      */
    uint32_t UNRE:1;                    /**< bit:      3  Synchronous Channels Update Underrun Error    */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t CMPM0:1;                   /**< bit:      8  Comparison 0 Match                            */
    uint32_t CMPM1:1;                   /**< bit:      9  Comparison 1 Match                            */
    uint32_t CMPM2:1;                   /**< bit:     10  Comparison 2 Match                            */
    uint32_t CMPM3:1;                   /**< bit:     11  Comparison 3 Match                            */
    uint32_t CMPM4:1;                   /**< bit:     12  Comparison 4 Match                            */
    uint32_t CMPM5:1;                   /**< bit:     13  Comparison 5 Match                            */
    uint32_t CMPM6:1;                   /**< bit:     14  Comparison 6 Match                            */
    uint32_t CMPM7:1;                   /**< bit:     15  Comparison 7 Match                            */
    uint32_t CMPU0:1;                   /**< bit:     16  Comparison 0 Update                           */
    uint32_t CMPU1:1;                   /**< bit:     17  Comparison 1 Update                           */
    uint32_t CMPU2:1;                   /**< bit:     18  Comparison 2 Update                           */
    uint32_t CMPU3:1;                   /**< bit:     19  Comparison 3 Update                           */
    uint32_t CMPU4:1;                   /**< bit:     20  Comparison 4 Update                           */
    uint32_t CMPU5:1;                   /**< bit:     21  Comparison 5 Update                           */
    uint32_t CMPU6:1;                   /**< bit:     22  Comparison 6 Update                           */
    uint32_t CMPU7:1;                   /**< bit:     23  Comparison 7 Update                           */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t CMPM:8;                    /**< bit:  8..15  Comparison x Match                            */
    uint32_t CMPU:8;                    /**< bit: 16..23  Comparison 7 Update                           */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_ISR2_bits_t;

#define PWMC_ISR2_WRDY_Pos                    (0)                                            /**< (PWMC_ISR2) Write Ready for Synchronous Channels Update Position */
#define PWMC_ISR2_WRDY_Msk                    (0x1U << PWMC_ISR2_WRDY_Pos)                   /**< (PWMC_ISR2) Write Ready for Synchronous Channels Update Mask */
#define PWMC_ISR2_UNRE_Pos                    (3)                                            /**< (PWMC_ISR2) Synchronous Channels Update Underrun Error Position */
#define PWMC_ISR2_UNRE_Msk                    (0x1U << PWMC_ISR2_UNRE_Pos)                   /**< (PWMC_ISR2) Synchronous Channels Update Underrun Error Mask */
#define PWMC_ISR2_CMPM0_Pos                   (8)                                            /**< (PWMC_ISR2) Comparison 0 Match Position */
#define PWMC_ISR2_CMPM0_Msk                   (0x1U << PWMC_ISR2_CMPM0_Pos)                  /**< (PWMC_ISR2) Comparison 0 Match Mask */
#define PWMC_ISR2_CMPM1_Pos                   (9)                                            /**< (PWMC_ISR2) Comparison 1 Match Position */
#define PWMC_ISR2_CMPM1_Msk                   (0x1U << PWMC_ISR2_CMPM1_Pos)                  /**< (PWMC_ISR2) Comparison 1 Match Mask */
#define PWMC_ISR2_CMPM2_Pos                   (10)                                           /**< (PWMC_ISR2) Comparison 2 Match Position */
#define PWMC_ISR2_CMPM2_Msk                   (0x1U << PWMC_ISR2_CMPM2_Pos)                  /**< (PWMC_ISR2) Comparison 2 Match Mask */
#define PWMC_ISR2_CMPM3_Pos                   (11)                                           /**< (PWMC_ISR2) Comparison 3 Match Position */
#define PWMC_ISR2_CMPM3_Msk                   (0x1U << PWMC_ISR2_CMPM3_Pos)                  /**< (PWMC_ISR2) Comparison 3 Match Mask */
#define PWMC_ISR2_CMPM4_Pos                   (12)                                           /**< (PWMC_ISR2) Comparison 4 Match Position */
#define PWMC_ISR2_CMPM4_Msk                   (0x1U << PWMC_ISR2_CMPM4_Pos)                  /**< (PWMC_ISR2) Comparison 4 Match Mask */
#define PWMC_ISR2_CMPM5_Pos                   (13)                                           /**< (PWMC_ISR2) Comparison 5 Match Position */
#define PWMC_ISR2_CMPM5_Msk                   (0x1U << PWMC_ISR2_CMPM5_Pos)                  /**< (PWMC_ISR2) Comparison 5 Match Mask */
#define PWMC_ISR2_CMPM6_Pos                   (14)                                           /**< (PWMC_ISR2) Comparison 6 Match Position */
#define PWMC_ISR2_CMPM6_Msk                   (0x1U << PWMC_ISR2_CMPM6_Pos)                  /**< (PWMC_ISR2) Comparison 6 Match Mask */
#define PWMC_ISR2_CMPM7_Pos                   (15)                                           /**< (PWMC_ISR2) Comparison 7 Match Position */
#define PWMC_ISR2_CMPM7_Msk                   (0x1U << PWMC_ISR2_CMPM7_Pos)                  /**< (PWMC_ISR2) Comparison 7 Match Mask */
#define PWMC_ISR2_CMPU0_Pos                   (16)                                           /**< (PWMC_ISR2) Comparison 0 Update Position */
#define PWMC_ISR2_CMPU0_Msk                   (0x1U << PWMC_ISR2_CMPU0_Pos)                  /**< (PWMC_ISR2) Comparison 0 Update Mask */
#define PWMC_ISR2_CMPU1_Pos                   (17)                                           /**< (PWMC_ISR2) Comparison 1 Update Position */
#define PWMC_ISR2_CMPU1_Msk                   (0x1U << PWMC_ISR2_CMPU1_Pos)                  /**< (PWMC_ISR2) Comparison 1 Update Mask */
#define PWMC_ISR2_CMPU2_Pos                   (18)                                           /**< (PWMC_ISR2) Comparison 2 Update Position */
#define PWMC_ISR2_CMPU2_Msk                   (0x1U << PWMC_ISR2_CMPU2_Pos)                  /**< (PWMC_ISR2) Comparison 2 Update Mask */
#define PWMC_ISR2_CMPU3_Pos                   (19)                                           /**< (PWMC_ISR2) Comparison 3 Update Position */
#define PWMC_ISR2_CMPU3_Msk                   (0x1U << PWMC_ISR2_CMPU3_Pos)                  /**< (PWMC_ISR2) Comparison 3 Update Mask */
#define PWMC_ISR2_CMPU4_Pos                   (20)                                           /**< (PWMC_ISR2) Comparison 4 Update Position */
#define PWMC_ISR2_CMPU4_Msk                   (0x1U << PWMC_ISR2_CMPU4_Pos)                  /**< (PWMC_ISR2) Comparison 4 Update Mask */
#define PWMC_ISR2_CMPU5_Pos                   (21)                                           /**< (PWMC_ISR2) Comparison 5 Update Position */
#define PWMC_ISR2_CMPU5_Msk                   (0x1U << PWMC_ISR2_CMPU5_Pos)                  /**< (PWMC_ISR2) Comparison 5 Update Mask */
#define PWMC_ISR2_CMPU6_Pos                   (22)                                           /**< (PWMC_ISR2) Comparison 6 Update Position */
#define PWMC_ISR2_CMPU6_Msk                   (0x1U << PWMC_ISR2_CMPU6_Pos)                  /**< (PWMC_ISR2) Comparison 6 Update Mask */
#define PWMC_ISR2_CMPU7_Pos                   (23)                                           /**< (PWMC_ISR2) Comparison 7 Update Position */
#define PWMC_ISR2_CMPU7_Msk                   (0x1U << PWMC_ISR2_CMPU7_Pos)                  /**< (PWMC_ISR2) Comparison 7 Update Mask */
#define PWMC_ISR2_Msk                         (0x00FFFF09UL)                                 /**< (PWMC_ISR2) Register Mask  */
#define PWMC_ISR2_CMPM_Pos                    (8)                                            /**< (PWMC_ISR2 Position) Comparison x Match */
#define PWMC_ISR2_CMPM_Msk                    (0xFFU << PWMC_ISR2_CMPM_Pos)                  /**< (PWMC_ISR2 Mask) CMPM */
#define PWMC_ISR2_CMPM(value)                 (PWMC_ISR2_CMPM_Msk & ((value) << PWMC_ISR2_CMPM_Pos))
#define PWMC_ISR2_CMPU_Pos                    (16)                                           /**< (PWMC_ISR2 Position) Comparison 7 Update */
#define PWMC_ISR2_CMPU_Msk                    (0xFFU << PWMC_ISR2_CMPU_Pos)                  /**< (PWMC_ISR2 Mask) CMPU */
#define PWMC_ISR2_CMPU(value)                 (PWMC_ISR2_CMPU_Msk & ((value) << PWMC_ISR2_CMPU_Pos))

