zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/* -------- PWMC_OOV : (PWMC Offset: 0x44) (R/W 32) PWMC Output Override Value Register -------- */

typedef union
{
  struct
  {
    uint32_t OOVH0:1;                   /**< bit:      0  Output Override Value for PWMH output of the channel 0 */
    uint32_t OOVH1:1;                   /**< bit:      1  Output Override Value for PWMH output of the channel 1 */
    uint32_t OOVH2:1;                   /**< bit:      2  Output Override Value for PWMH output of the channel 2 */
    uint32_t OOVH3:1;                   /**< bit:      3  Output Override Value for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OOVL0:1;                   /**< bit:     16  Output Override Value for PWML output of the channel 0 */
    uint32_t OOVL1:1;                   /**< bit:     17  Output Override Value for PWML output of the channel 1 */
    uint32_t OOVL2:1;                   /**< bit:     18  Output Override Value for PWML output of the channel 2 */
    uint32_t OOVL3:1;                   /**< bit:     19  Output Override Value for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t OOVH:4;                    /**< bit:   0..3  Output Override Value for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OOVL:4;                    /**< bit: 16..19  Output Override Value for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_OOV_bits_t;

#define PWMC_OOV_OOVH0_Pos                    (0)                                            /**< (PWMC_OOV) Output Override Value for PWMH output of the channel 0 Position */
#define PWMC_OOV_OOVH0_Msk                    (0x1U << PWMC_OOV_OOVH0_Pos)                   /**< (PWMC_OOV) Output Override Value for PWMH output of the channel 0 Mask */
#define PWMC_OOV_OOVH1_Pos                    (1)                                            /**< (PWMC_OOV) Output Override Value for PWMH output of the channel 1 Position */
#define PWMC_OOV_OOVH1_Msk                    (0x1U << PWMC_OOV_OOVH1_Pos)                   /**< (PWMC_OOV) Output Override Value for PWMH output of the channel 1 Mask */
#define PWMC_OOV_OOVH2_Pos                    (2)                                            /**< (PWMC_OOV) Output Override Value for PWMH output of the channel 2 Position */
#define PWMC_OOV_OOVH2_Msk                    (0x1U << PWMC_OOV_OOVH2_Pos)                   /**< (PWMC_OOV) Output Override Value for PWMH output of the channel 2 Mask */
#define PWMC_OOV_OOVH3_Pos                    (3)                                            /**< (PWMC_OOV) Output Override Value for PWMH output of the channel 3 Position */
#define PWMC_OOV_OOVH3_Msk                    (0x1U << PWMC_OOV_OOVH3_Pos)                   /**< (PWMC_OOV) Output Override Value for PWMH output of the channel 3 Mask */
#define PWMC_OOV_OOVL0_Pos                    (16)                                           /**< (PWMC_OOV) Output Override Value for PWML output of the channel 0 Position */
#define PWMC_OOV_OOVL0_Msk                    (0x1U << PWMC_OOV_OOVL0_Pos)                   /**< (PWMC_OOV) Output Override Value for PWML output of the channel 0 Mask */
#define PWMC_OOV_OOVL1_Pos                    (17)                                           /**< (PWMC_OOV) Output Override Value for PWML output of the channel 1 Position */
#define PWMC_OOV_OOVL1_Msk                    (0x1U << PWMC_OOV_OOVL1_Pos)                   /**< (PWMC_OOV) Output Override Value for PWML output of the channel 1 Mask */
#define PWMC_OOV_OOVL2_Pos                    (18)                                           /**< (PWMC_OOV) Output Override Value for PWML output of the channel 2 Position */
#define PWMC_OOV_OOVL2_Msk                    (0x1U << PWMC_OOV_OOVL2_Pos)                   /**< (PWMC_OOV) Output Override Value for PWML output of the channel 2 Mask */
#define PWMC_OOV_OOVL3_Pos                    (19)                                           /**< (PWMC_OOV) Output Override Value for PWML output of the channel 3 Position */
#define PWMC_OOV_OOVL3_Msk                    (0x1U << PWMC_OOV_OOVL3_Pos)                   /**< (PWMC_OOV) Output Override Value for PWML output of the channel 3 Mask */
#define PWMC_OOV_Msk                          (0x000F000FUL)                                 /**< (PWMC_OOV) Register Mask  */
#define PWMC_OOV_OOVH_Pos                     (0)                                            /**< (PWMC_OOV Position) Output Override Value for PWMH output of the channel x */
#define PWMC_OOV_OOVH_Msk                     (0xFU << PWMC_OOV_OOVH_Pos)                    /**< (PWMC_OOV Mask) OOVH */
#define PWMC_OOV_OOVH(value)                  (PWMC_OOV_OOVH_Msk & ((value) << PWMC_OOV_OOVH_Pos))
#define PWMC_OOV_OOVL_Pos                     (16)                                           /**< (PWMC_OOV Position) Output Override Value for PWML output of the channel 3 */
#define PWMC_OOV_OOVL_Msk                     (0xFU << PWMC_OOV_OOVL_Pos)                    /**< (PWMC_OOV Mask) OOVL */
#define PWMC_OOV_OOVL(value)                  (PWMC_OOV_OOVL_Msk & ((value) << PWMC_OOV_OOVL_Pos))

/* -------- PWMC_OS : (PWMC Offset: 0x48) (R/W 32) PWMC Output Selection Register -------- */

typedef union
{
  struct
  {
    uint32_t OSH0:1;                    /**< bit:      0  Output Selection for PWMH output of the channel 0 */
    uint32_t OSH1:1;                    /**< bit:      1  Output Selection for PWMH output of the channel 1 */
    uint32_t OSH2:1;                    /**< bit:      2  Output Selection for PWMH output of the channel 2 */
    uint32_t OSH3:1;                    /**< bit:      3  Output Selection for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSL0:1;                    /**< bit:     16  Output Selection for PWML output of the channel 0 */
    uint32_t OSL1:1;                    /**< bit:     17  Output Selection for PWML output of the channel 1 */
    uint32_t OSL2:1;                    /**< bit:     18  Output Selection for PWML output of the channel 2 */
    uint32_t OSL3:1;                    /**< bit:     19  Output Selection for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t OSH:4;                     /**< bit:   0..3  Output Selection for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSL:4;                     /**< bit: 16..19  Output Selection for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_OS_bits_t;

#define PWMC_OS_OSH0_Pos                      (0)                                            /**< (PWMC_OS) Output Selection for PWMH output of the channel 0 Position */
#define PWMC_OS_OSH0_Msk                      (0x1U << PWMC_OS_OSH0_Pos)                     /**< (PWMC_OS) Output Selection for PWMH output of the channel 0 Mask */
#define PWMC_OS_OSH1_Pos                      (1)                                            /**< (PWMC_OS) Output Selection for PWMH output of the channel 1 Position */
#define PWMC_OS_OSH1_Msk                      (0x1U << PWMC_OS_OSH1_Pos)                     /**< (PWMC_OS) Output Selection for PWMH output of the channel 1 Mask */
#define PWMC_OS_OSH2_Pos                      (2)                                            /**< (PWMC_OS) Output Selection for PWMH output of the channel 2 Position */
#define PWMC_OS_OSH2_Msk                      (0x1U << PWMC_OS_OSH2_Pos)                     /**< (PWMC_OS) Output Selection for PWMH output of the channel 2 Mask */
#define PWMC_OS_OSH3_Pos                      (3)                                            /**< (PWMC_OS) Output Selection for PWMH output of the channel 3 Position */
#define PWMC_OS_OSH3_Msk                      (0x1U << PWMC_OS_OSH3_Pos)                     /**< (PWMC_OS) Output Selection for PWMH output of the channel 3 Mask */
#define PWMC_OS_OSL0_Pos                      (16)                                           /**< (PWMC_OS) Output Selection for PWML output of the channel 0 Position */
#define PWMC_OS_OSL0_Msk                      (0x1U << PWMC_OS_OSL0_Pos)                     /**< (PWMC_OS) Output Selection for PWML output of the channel 0 Mask */
#define PWMC_OS_OSL1_Pos                      (17)                                           /**< (PWMC_OS) Output Selection for PWML output of the channel 1 Position */
#define PWMC_OS_OSL1_Msk                      (0x1U << PWMC_OS_OSL1_Pos)                     /**< (PWMC_OS) Output Selection for PWML output of the channel 1 Mask */
#define PWMC_OS_OSL2_Pos                      (18)                                           /**< (PWMC_OS) Output Selection for PWML output of the channel 2 Position */
#define PWMC_OS_OSL2_Msk                      (0x1U << PWMC_OS_OSL2_Pos)                     /**< (PWMC_OS) Output Selection for PWML output of the channel 2 Mask */
#define PWMC_OS_OSL3_Pos                      (19)                                           /**< (PWMC_OS) Output Selection for PWML output of the channel 3 Position */
#define PWMC_OS_OSL3_Msk                      (0x1U << PWMC_OS_OSL3_Pos)                     /**< (PWMC_OS) Output Selection for PWML output of the channel 3 Mask */
#define PWMC_OS_Msk                           (0x000F000FUL)                                 /**< (PWMC_OS) Register Mask  */
#define PWMC_OS_OSH_Pos                       (0)                                            /**< (PWMC_OS Position) Output Selection for PWMH output of the channel x */
#define PWMC_OS_OSH_Msk                       (0xFU << PWMC_OS_OSH_Pos)                      /**< (PWMC_OS Mask) OSH */
#define PWMC_OS_OSH(value)                    (PWMC_OS_OSH_Msk & ((value) << PWMC_OS_OSH_Pos))
#define PWMC_OS_OSL_Pos                       (16)                                           /**< (PWMC_OS Position) Output Selection for PWML output of the channel 3 */
#define PWMC_OS_OSL_Msk                       (0xFU << PWMC_OS_OSL_Pos)                      /**< (PWMC_OS Mask) OSL */
#define PWMC_OS_OSL(value)                    (PWMC_OS_OSL_Msk & ((value) << PWMC_OS_OSL_Pos))

