zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/* -------- PWMC_OSS : (PWMC Offset: 0x4c) (/W 32) PWMC Output Selection Set Register -------- */

typedef union
{
  struct
  {
    uint32_t OSSH0:1;                   /**< bit:      0  Output Selection Set for PWMH output of the channel 0 */
    uint32_t OSSH1:1;                   /**< bit:      1  Output Selection Set for PWMH output of the channel 1 */
    uint32_t OSSH2:1;                   /**< bit:      2  Output Selection Set for PWMH output of the channel 2 */
    uint32_t OSSH3:1;                   /**< bit:      3  Output Selection Set for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSSL0:1;                   /**< bit:     16  Output Selection Set for PWML output of the channel 0 */
    uint32_t OSSL1:1;                   /**< bit:     17  Output Selection Set for PWML output of the channel 1 */
    uint32_t OSSL2:1;                   /**< bit:     18  Output Selection Set for PWML output of the channel 2 */
    uint32_t OSSL3:1;                   /**< bit:     19  Output Selection Set for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t OSSH:4;                    /**< bit:   0..3  Output Selection Set for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSSL:4;                    /**< bit: 16..19  Output Selection Set for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_OSS_bits_t;

#define PWMC_OSS_OSSH0_Pos                    (0)                                            /**< (PWMC_OSS) Output Selection Set for PWMH output of the channel 0 Position */
#define PWMC_OSS_OSSH0_Msk                    (0x1U << PWMC_OSS_OSSH0_Pos)                   /**< (PWMC_OSS) Output Selection Set for PWMH output of the channel 0 Mask */
#define PWMC_OSS_OSSH1_Pos                    (1)                                            /**< (PWMC_OSS) Output Selection Set for PWMH output of the channel 1 Position */
#define PWMC_OSS_OSSH1_Msk                    (0x1U << PWMC_OSS_OSSH1_Pos)                   /**< (PWMC_OSS) Output Selection Set for PWMH output of the channel 1 Mask */
#define PWMC_OSS_OSSH2_Pos                    (2)                                            /**< (PWMC_OSS) Output Selection Set for PWMH output of the channel 2 Position */
#define PWMC_OSS_OSSH2_Msk                    (0x1U << PWMC_OSS_OSSH2_Pos)                   /**< (PWMC_OSS) Output Selection Set for PWMH output of the channel 2 Mask */
#define PWMC_OSS_OSSH3_Pos                    (3)                                            /**< (PWMC_OSS) Output Selection Set for PWMH output of the channel 3 Position */
#define PWMC_OSS_OSSH3_Msk                    (0x1U << PWMC_OSS_OSSH3_Pos)                   /**< (PWMC_OSS) Output Selection Set for PWMH output of the channel 3 Mask */
#define PWMC_OSS_OSSL0_Pos                    (16)                                           /**< (PWMC_OSS) Output Selection Set for PWML output of the channel 0 Position */
#define PWMC_OSS_OSSL0_Msk                    (0x1U << PWMC_OSS_OSSL0_Pos)                   /**< (PWMC_OSS) Output Selection Set for PWML output of the channel 0 Mask */
#define PWMC_OSS_OSSL1_Pos                    (17)                                           /**< (PWMC_OSS) Output Selection Set for PWML output of the channel 1 Position */
#define PWMC_OSS_OSSL1_Msk                    (0x1U << PWMC_OSS_OSSL1_Pos)                   /**< (PWMC_OSS) Output Selection Set for PWML output of the channel 1 Mask */
#define PWMC_OSS_OSSL2_Pos                    (18)                                           /**< (PWMC_OSS) Output Selection Set for PWML output of the channel 2 Position */
#define PWMC_OSS_OSSL2_Msk                    (0x1U << PWMC_OSS_OSSL2_Pos)                   /**< (PWMC_OSS) Output Selection Set for PWML output of the channel 2 Mask */
#define PWMC_OSS_OSSL3_Pos                    (19)                                           /**< (PWMC_OSS) Output Selection Set for PWML output of the channel 3 Position */
#define PWMC_OSS_OSSL3_Msk                    (0x1U << PWMC_OSS_OSSL3_Pos)                   /**< (PWMC_OSS) Output Selection Set for PWML output of the channel 3 Mask */
#define PWMC_OSS_Msk                          (0x000F000FUL)                                 /**< (PWMC_OSS) Register Mask  */
#define PWMC_OSS_OSSH_Pos                     (0)                                            /**< (PWMC_OSS Position) Output Selection Set for PWMH output of the channel x */
#define PWMC_OSS_OSSH_Msk                     (0xFU << PWMC_OSS_OSSH_Pos)                    /**< (PWMC_OSS Mask) OSSH */
#define PWMC_OSS_OSSH(value)                  (PWMC_OSS_OSSH_Msk & ((value) << PWMC_OSS_OSSH_Pos))
#define PWMC_OSS_OSSL_Pos                     (16)                                           /**< (PWMC_OSS Position) Output Selection Set for PWML output of the channel 3 */
#define PWMC_OSS_OSSL_Msk                     (0xFU << PWMC_OSS_OSSL_Pos)                    /**< (PWMC_OSS Mask) OSSL */
#define PWMC_OSS_OSSL(value)                  (PWMC_OSS_OSSL_Msk & ((value) << PWMC_OSS_OSSL_Pos))

/* -------- PWMC_OSC : (PWMC Offset: 0x50) (/W 32) PWMC Output Selection Clear Register -------- */

typedef union
{
  struct
  {
    uint32_t OSCH0:1;                   /**< bit:      0  Output Selection Clear for PWMH output of the channel 0 */
    uint32_t OSCH1:1;                   /**< bit:      1  Output Selection Clear for PWMH output of the channel 1 */
    uint32_t OSCH2:1;                   /**< bit:      2  Output Selection Clear for PWMH output of the channel 2 */
    uint32_t OSCH3:1;                   /**< bit:      3  Output Selection Clear for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSCL0:1;                   /**< bit:     16  Output Selection Clear for PWML output of the channel 0 */
    uint32_t OSCL1:1;                   /**< bit:     17  Output Selection Clear for PWML output of the channel 1 */
    uint32_t OSCL2:1;                   /**< bit:     18  Output Selection Clear for PWML output of the channel 2 */
    uint32_t OSCL3:1;                   /**< bit:     19  Output Selection Clear for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t OSCH:4;                    /**< bit:   0..3  Output Selection Clear for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSCL:4;                    /**< bit: 16..19  Output Selection Clear for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_OSC_bits_t;

#define PWMC_OSC_OSCH0_Pos                    (0)                                            /**< (PWMC_OSC) Output Selection Clear for PWMH output of the channel 0 Position */
#define PWMC_OSC_OSCH0_Msk                    (0x1U << PWMC_OSC_OSCH0_Pos)                   /**< (PWMC_OSC) Output Selection Clear for PWMH output of the channel 0 Mask */
#define PWMC_OSC_OSCH1_Pos                    (1)                                            /**< (PWMC_OSC) Output Selection Clear for PWMH output of the channel 1 Position */
#define PWMC_OSC_OSCH1_Msk                    (0x1U << PWMC_OSC_OSCH1_Pos)                   /**< (PWMC_OSC) Output Selection Clear for PWMH output of the channel 1 Mask */
#define PWMC_OSC_OSCH2_Pos                    (2)                                            /**< (PWMC_OSC) Output Selection Clear for PWMH output of the channel 2 Position */
#define PWMC_OSC_OSCH2_Msk                    (0x1U << PWMC_OSC_OSCH2_Pos)                   /**< (PWMC_OSC) Output Selection Clear for PWMH output of the channel 2 Mask */
#define PWMC_OSC_OSCH3_Pos                    (3)                                            /**< (PWMC_OSC) Output Selection Clear for PWMH output of the channel 3 Position */
#define PWMC_OSC_OSCH3_Msk                    (0x1U << PWMC_OSC_OSCH3_Pos)                   /**< (PWMC_OSC) Output Selection Clear for PWMH output of the channel 3 Mask */
#define PWMC_OSC_OSCL0_Pos                    (16)                                           /**< (PWMC_OSC) Output Selection Clear for PWML output of the channel 0 Position */
#define PWMC_OSC_OSCL0_Msk                    (0x1U << PWMC_OSC_OSCL0_Pos)                   /**< (PWMC_OSC) Output Selection Clear for PWML output of the channel 0 Mask */
#define PWMC_OSC_OSCL1_Pos                    (17)                                           /**< (PWMC_OSC) Output Selection Clear for PWML output of the channel 1 Position */
#define PWMC_OSC_OSCL1_Msk                    (0x1U << PWMC_OSC_OSCL1_Pos)                   /**< (PWMC_OSC) Output Selection Clear for PWML output of the channel 1 Mask */
#define PWMC_OSC_OSCL2_Pos                    (18)                                           /**< (PWMC_OSC) Output Selection Clear for PWML output of the channel 2 Position */
#define PWMC_OSC_OSCL2_Msk                    (0x1U << PWMC_OSC_OSCL2_Pos)                   /**< (PWMC_OSC) Output Selection Clear for PWML output of the channel 2 Mask */
#define PWMC_OSC_OSCL3_Pos                    (19)                                           /**< (PWMC_OSC) Output Selection Clear for PWML output of the channel 3 Position */
#define PWMC_OSC_OSCL3_Msk                    (0x1U << PWMC_OSC_OSCL3_Pos)                   /**< (PWMC_OSC) Output Selection Clear for PWML output of the channel 3 Mask */
#define PWMC_OSC_Msk                          (0x000F000FUL)                                 /**< (PWMC_OSC) Register Mask  */
#define PWMC_OSC_OSCH_Pos                     (0)                                            /**< (PWMC_OSC Position) Output Selection Clear for PWMH output of the channel x */
#define PWMC_OSC_OSCH_Msk                     (0xFU << PWMC_OSC_OSCH_Pos)                    /**< (PWMC_OSC Mask) OSCH */
#define PWMC_OSC_OSCH(value)                  (PWMC_OSC_OSCH_Msk & ((value) << PWMC_OSC_OSCH_Pos))
#define PWMC_OSC_OSCL_Pos                     (16)                                           /**< (PWMC_OSC Position) Output Selection Clear for PWML output of the channel 3 */
#define PWMC_OSC_OSCL_Msk                     (0xFU << PWMC_OSC_OSCL_Pos)                    /**< (PWMC_OSC Mask) OSCL */
#define PWMC_OSC_OSCL(value)                  (PWMC_OSC_OSCL_Msk & ((value) << PWMC_OSC_OSCL_Pos))

/* -------- PWMC_OSSUPD : (PWMC Offset: 0x54) (/W 32) PWMC Output Selection Set Update Register -------- */

typedef union
{
  struct
  {
    uint32_t OSSUPH0:1;                 /**< bit:      0  Output Selection Set for PWMH output of the channel 0 */
    uint32_t OSSUPH1:1;                 /**< bit:      1  Output Selection Set for PWMH output of the channel 1 */
    uint32_t OSSUPH2:1;                 /**< bit:      2  Output Selection Set for PWMH output of the channel 2 */
    uint32_t OSSUPH3:1;                 /**< bit:      3  Output Selection Set for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSSUPL0:1;                 /**< bit:     16  Output Selection Set for PWML output of the channel 0 */
    uint32_t OSSUPL1:1;                 /**< bit:     17  Output Selection Set for PWML output of the channel 1 */
    uint32_t OSSUPL2:1;                 /**< bit:     18  Output Selection Set for PWML output of the channel 2 */
    uint32_t OSSUPL3:1;                 /**< bit:     19  Output Selection Set for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t OSSUPH:4;                  /**< bit:   0..3  Output Selection Set for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSSUPL:4;                  /**< bit: 16..19  Output Selection Set for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_OSSUPD_bits_t;

#define PWMC_OSSUPD_OSSUPH0_Pos               (0)                                            /**< (PWMC_OSSUPD) Output Selection Set for PWMH output of the channel 0 Position */
#define PWMC_OSSUPD_OSSUPH0_Msk               (0x1U << PWMC_OSSUPD_OSSUPH0_Pos)              /**< (PWMC_OSSUPD) Output Selection Set for PWMH output of the channel 0 Mask */
#define PWMC_OSSUPD_OSSUPH1_Pos               (1)                                            /**< (PWMC_OSSUPD) Output Selection Set for PWMH output of the channel 1 Position */
#define PWMC_OSSUPD_OSSUPH1_Msk               (0x1U << PWMC_OSSUPD_OSSUPH1_Pos)              /**< (PWMC_OSSUPD) Output Selection Set for PWMH output of the channel 1 Mask */
#define PWMC_OSSUPD_OSSUPH2_Pos               (2)                                            /**< (PWMC_OSSUPD) Output Selection Set for PWMH output of the channel 2 Position */
#define PWMC_OSSUPD_OSSUPH2_Msk               (0x1U << PWMC_OSSUPD_OSSUPH2_Pos)              /**< (PWMC_OSSUPD) Output Selection Set for PWMH output of the channel 2 Mask */
#define PWMC_OSSUPD_OSSUPH3_Pos               (3)                                            /**< (PWMC_OSSUPD) Output Selection Set for PWMH output of the channel 3 Position */
#define PWMC_OSSUPD_OSSUPH3_Msk               (0x1U << PWMC_OSSUPD_OSSUPH3_Pos)              /**< (PWMC_OSSUPD) Output Selection Set for PWMH output of the channel 3 Mask */
#define PWMC_OSSUPD_OSSUPL0_Pos               (16)                                           /**< (PWMC_OSSUPD) Output Selection Set for PWML output of the channel 0 Position */
#define PWMC_OSSUPD_OSSUPL0_Msk               (0x1U << PWMC_OSSUPD_OSSUPL0_Pos)              /**< (PWMC_OSSUPD) Output Selection Set for PWML output of the channel 0 Mask */
#define PWMC_OSSUPD_OSSUPL1_Pos               (17)                                           /**< (PWMC_OSSUPD) Output Selection Set for PWML output of the channel 1 Position */
#define PWMC_OSSUPD_OSSUPL1_Msk               (0x1U << PWMC_OSSUPD_OSSUPL1_Pos)              /**< (PWMC_OSSUPD) Output Selection Set for PWML output of the channel 1 Mask */
#define PWMC_OSSUPD_OSSUPL2_Pos               (18)                                           /**< (PWMC_OSSUPD) Output Selection Set for PWML output of the channel 2 Position */
#define PWMC_OSSUPD_OSSUPL2_Msk               (0x1U << PWMC_OSSUPD_OSSUPL2_Pos)              /**< (PWMC_OSSUPD) Output Selection Set for PWML output of the channel 2 Mask */
#define PWMC_OSSUPD_OSSUPL3_Pos               (19)                                           /**< (PWMC_OSSUPD) Output Selection Set for PWML output of the channel 3 Position */
#define PWMC_OSSUPD_OSSUPL3_Msk               (0x1U << PWMC_OSSUPD_OSSUPL3_Pos)              /**< (PWMC_OSSUPD) Output Selection Set for PWML output of the channel 3 Mask */
#define PWMC_OSSUPD_Msk                       (0x000F000FUL)                                 /**< (PWMC_OSSUPD) Register Mask  */
#define PWMC_OSSUPD_OSSUPH_Pos                (0)                                            /**< (PWMC_OSSUPD Position) Output Selection Set for PWMH output of the channel x */
#define PWMC_OSSUPD_OSSUPH_Msk                (0xFU << PWMC_OSSUPD_OSSUPH_Pos)               /**< (PWMC_OSSUPD Mask) OSSUPH */
#define PWMC_OSSUPD_OSSUPH(value)             (PWMC_OSSUPD_OSSUPH_Msk & ((value) << PWMC_OSSUPD_OSSUPH_Pos))
#define PWMC_OSSUPD_OSSUPL_Pos                (16)                                           /**< (PWMC_OSSUPD Position) Output Selection Set for PWML output of the channel 3 */
#define PWMC_OSSUPD_OSSUPL_Msk                (0xFU << PWMC_OSSUPD_OSSUPL_Pos)               /**< (PWMC_OSSUPD Mask) OSSUPL */
#define PWMC_OSSUPD_OSSUPL(value)             (PWMC_OSSUPD_OSSUPL_Msk & ((value) << PWMC_OSSUPD_OSSUPL_Pos))

/* -------- PWMC_OSCUPD : (PWMC Offset: 0x58) (/W 32) PWMC Output Selection Clear Update Register -------- */

typedef union
{
  struct
  {
    uint32_t OSCUPH0:1;                 /**< bit:      0  Output Selection Clear for PWMH output of the channel 0 */
    uint32_t OSCUPH1:1;                 /**< bit:      1  Output Selection Clear for PWMH output of the channel 1 */
    uint32_t OSCUPH2:1;                 /**< bit:      2  Output Selection Clear for PWMH output of the channel 2 */
    uint32_t OSCUPH3:1;                 /**< bit:      3  Output Selection Clear for PWMH output of the channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSCUPL0:1;                 /**< bit:     16  Output Selection Clear for PWML output of the channel 0 */
    uint32_t OSCUPL1:1;                 /**< bit:     17  Output Selection Clear for PWML output of the channel 1 */
    uint32_t OSCUPL2:1;                 /**< bit:     18  Output Selection Clear for PWML output of the channel 2 */
    uint32_t OSCUPL3:1;                 /**< bit:     19  Output Selection Clear for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t OSCUPH:4;                  /**< bit:   0..3  Output Selection Clear for PWMH output of the channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t OSCUPL:4;                  /**< bit: 16..19  Output Selection Clear for PWML output of the channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_OSCUPD_bits_t;

#define PWMC_OSCUPD_OSCUPH0_Pos               (0)                                            /**< (PWMC_OSCUPD) Output Selection Clear for PWMH output of the channel 0 Position */
#define PWMC_OSCUPD_OSCUPH0_Msk               (0x1U << PWMC_OSCUPD_OSCUPH0_Pos)              /**< (PWMC_OSCUPD) Output Selection Clear for PWMH output of the channel 0 Mask */
#define PWMC_OSCUPD_OSCUPH1_Pos               (1)                                            /**< (PWMC_OSCUPD) Output Selection Clear for PWMH output of the channel 1 Position */
#define PWMC_OSCUPD_OSCUPH1_Msk               (0x1U << PWMC_OSCUPD_OSCUPH1_Pos)              /**< (PWMC_OSCUPD) Output Selection Clear for PWMH output of the channel 1 Mask */
#define PWMC_OSCUPD_OSCUPH2_Pos               (2)                                            /**< (PWMC_OSCUPD) Output Selection Clear for PWMH output of the channel 2 Position */
#define PWMC_OSCUPD_OSCUPH2_Msk               (0x1U << PWMC_OSCUPD_OSCUPH2_Pos)              /**< (PWMC_OSCUPD) Output Selection Clear for PWMH output of the channel 2 Mask */
#define PWMC_OSCUPD_OSCUPH3_Pos               (3)                                            /**< (PWMC_OSCUPD) Output Selection Clear for PWMH output of the channel 3 Position */
#define PWMC_OSCUPD_OSCUPH3_Msk               (0x1U << PWMC_OSCUPD_OSCUPH3_Pos)              /**< (PWMC_OSCUPD) Output Selection Clear for PWMH output of the channel 3 Mask */
#define PWMC_OSCUPD_OSCUPL0_Pos               (16)                                           /**< (PWMC_OSCUPD) Output Selection Clear for PWML output of the channel 0 Position */
#define PWMC_OSCUPD_OSCUPL0_Msk               (0x1U << PWMC_OSCUPD_OSCUPL0_Pos)              /**< (PWMC_OSCUPD) Output Selection Clear for PWML output of the channel 0 Mask */
#define PWMC_OSCUPD_OSCUPL1_Pos               (17)                                           /**< (PWMC_OSCUPD) Output Selection Clear for PWML output of the channel 1 Position */
#define PWMC_OSCUPD_OSCUPL1_Msk               (0x1U << PWMC_OSCUPD_OSCUPL1_Pos)              /**< (PWMC_OSCUPD) Output Selection Clear for PWML output of the channel 1 Mask */
#define PWMC_OSCUPD_OSCUPL2_Pos               (18)                                           /**< (PWMC_OSCUPD) Output Selection Clear for PWML output of the channel 2 Position */
#define PWMC_OSCUPD_OSCUPL2_Msk               (0x1U << PWMC_OSCUPD_OSCUPL2_Pos)              /**< (PWMC_OSCUPD) Output Selection Clear for PWML output of the channel 2 Mask */
#define PWMC_OSCUPD_OSCUPL3_Pos               (19)                                           /**< (PWMC_OSCUPD) Output Selection Clear for PWML output of the channel 3 Position */
#define PWMC_OSCUPD_OSCUPL3_Msk               (0x1U << PWMC_OSCUPD_OSCUPL3_Pos)              /**< (PWMC_OSCUPD) Output Selection Clear for PWML output of the channel 3 Mask */
#define PWMC_OSCUPD_Msk                       (0x000F000FUL)                                 /**< (PWMC_OSCUPD) Register Mask  */
#define PWMC_OSCUPD_OSCUPH_Pos                (0)                                            /**< (PWMC_OSCUPD Position) Output Selection Clear for PWMH output of the channel x */
#define PWMC_OSCUPD_OSCUPH_Msk                (0xFU << PWMC_OSCUPD_OSCUPH_Pos)               /**< (PWMC_OSCUPD Mask) OSCUPH */
#define PWMC_OSCUPD_OSCUPH(value)             (PWMC_OSCUPD_OSCUPH_Msk & ((value) << PWMC_OSCUPD_OSCUPH_Pos))
#define PWMC_OSCUPD_OSCUPL_Pos                (16)                                           /**< (PWMC_OSCUPD Position) Output Selection Clear for PWML output of the channel 3 */
#define PWMC_OSCUPD_OSCUPL_Msk                (0xFU << PWMC_OSCUPD_OSCUPL_Pos)               /**< (PWMC_OSCUPD Mask) OSCUPL */
#define PWMC_OSCUPD_OSCUPL(value)             (PWMC_OSCUPD_OSCUPL_Msk & ((value) << PWMC_OSCUPD_OSCUPL_Pos))

