zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/* -------- PWMC_FMR : (PWMC Offset: 0x5c) (R/W 32) PWMC Fault Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t FPOL:8;                    /**< bit:   0..7  Fault Polarity                                */
    uint32_t FMOD:8;                    /**< bit:  8..15  Fault Activation Mode                         */
    uint32_t FFIL:8;                    /**< bit: 16..23  Fault Filtering                               */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_FMR_bits_t;

#define PWMC_FMR_FPOL_Pos                     (0)                                            /**< (PWMC_FMR) Fault Polarity Position */
#define PWMC_FMR_FPOL_Msk                     (0xFFU << PWMC_FMR_FPOL_Pos)                   /**< (PWMC_FMR) Fault Polarity Mask */
#define PWMC_FMR_FPOL(value)                  (PWMC_FMR_FPOL_Msk & ((value) << PWMC_FMR_FPOL_Pos))
#define PWMC_FMR_FMOD_Pos                     (8)                                            /**< (PWMC_FMR) Fault Activation Mode Position */
#define PWMC_FMR_FMOD_Msk                     (0xFFU << PWMC_FMR_FMOD_Pos)                   /**< (PWMC_FMR) Fault Activation Mode Mask */
#define PWMC_FMR_FMOD(value)                  (PWMC_FMR_FMOD_Msk & ((value) << PWMC_FMR_FMOD_Pos))
#define PWMC_FMR_FFIL_Pos                     (16)                                           /**< (PWMC_FMR) Fault Filtering Position */
#define PWMC_FMR_FFIL_Msk                     (0xFFU << PWMC_FMR_FFIL_Pos)                   /**< (PWMC_FMR) Fault Filtering Mask */
#define PWMC_FMR_FFIL(value)                  (PWMC_FMR_FFIL_Msk & ((value) << PWMC_FMR_FFIL_Pos))
#define PWMC_FMR_Msk                          (0x00FFFFFFUL)                                 /**< (PWMC_FMR) Register Mask  */

/* -------- PWMC_FSR : (PWMC Offset: 0x60) (R/ 32) PWMC Fault Status Register -------- */

typedef union
{
  struct
  {
    uint32_t FIV:8;                     /**< bit:   0..7  Fault Input Value                             */
    uint32_t FS:8;                      /**< bit:  8..15  Fault Status                                  */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_FSR_bits_t;

#define PWMC_FSR_FIV_Pos                      (0)                                            /**< (PWMC_FSR) Fault Input Value Position */
#define PWMC_FSR_FIV_Msk                      (0xFFU << PWMC_FSR_FIV_Pos)                    /**< (PWMC_FSR) Fault Input Value Mask */
#define PWMC_FSR_FIV(value)                   (PWMC_FSR_FIV_Msk & ((value) << PWMC_FSR_FIV_Pos))
#define PWMC_FSR_FS_Pos                       (8)                                            /**< (PWMC_FSR) Fault Status Position */
#define PWMC_FSR_FS_Msk                       (0xFFU << PWMC_FSR_FS_Pos)                     /**< (PWMC_FSR) Fault Status Mask */
#define PWMC_FSR_FS(value)                    (PWMC_FSR_FS_Msk & ((value) << PWMC_FSR_FS_Pos))
#define PWMC_FSR_Msk                          (0x0000FFFFUL)                                 /**< (PWMC_FSR) Register Mask  */

/* -------- PWMC_FCR : (PWMC Offset: 0x64) (/W 32) PWMC Fault Clear Register -------- */

typedef union
{
  struct
  {
    uint32_t FCLR:8;                    /**< bit:   0..7  Fault Clear                                   */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_FCR_bits_t;

#define PWMC_FCR_FCLR_Pos                     (0)                                            /**< (PWMC_FCR) Fault Clear Position */
#define PWMC_FCR_FCLR_Msk                     (0xFFU << PWMC_FCR_FCLR_Pos)                   /**< (PWMC_FCR) Fault Clear Mask */
#define PWMC_FCR_FCLR(value)                  (PWMC_FCR_FCLR_Msk & ((value) << PWMC_FCR_FCLR_Pos))
#define PWMC_FCR_Msk                          (0x000000FFUL)                                 /**< (PWMC_FCR) Register Mask  */

/* -------- PWMC_FPV1 : (PWMC Offset: 0x68) (R/W 32) PWMC Fault Protection Value Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t FPVH0:1;                   /**< bit:      0  Fault Protection Value for PWMH output on channel 0 */
    uint32_t FPVH1:1;                   /**< bit:      1  Fault Protection Value for PWMH output on channel 1 */
    uint32_t FPVH2:1;                   /**< bit:      2  Fault Protection Value for PWMH output on channel 2 */
    uint32_t FPVH3:1;                   /**< bit:      3  Fault Protection Value for PWMH output on channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FPVL0:1;                   /**< bit:     16  Fault Protection Value for PWML output on channel 0 */
    uint32_t FPVL1:1;                   /**< bit:     17  Fault Protection Value for PWML output on channel 1 */
    uint32_t FPVL2:1;                   /**< bit:     18  Fault Protection Value for PWML output on channel 2 */
    uint32_t FPVL3:1;                   /**< bit:     19  Fault Protection Value for PWML output on channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t FPVH:4;                    /**< bit:   0..3  Fault Protection Value for PWMH output on channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FPVL:4;                    /**< bit: 16..19  Fault Protection Value for PWML output on channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_FPV1_bits_t;

#define PWMC_FPV1_FPVH0_Pos                   (0)                                            /**< (PWMC_FPV1) Fault Protection Value for PWMH output on channel 0 Position */
#define PWMC_FPV1_FPVH0_Msk                   (0x1U << PWMC_FPV1_FPVH0_Pos)                  /**< (PWMC_FPV1) Fault Protection Value for PWMH output on channel 0 Mask */
#define PWMC_FPV1_FPVH1_Pos                   (1)                                            /**< (PWMC_FPV1) Fault Protection Value for PWMH output on channel 1 Position */
#define PWMC_FPV1_FPVH1_Msk                   (0x1U << PWMC_FPV1_FPVH1_Pos)                  /**< (PWMC_FPV1) Fault Protection Value for PWMH output on channel 1 Mask */
#define PWMC_FPV1_FPVH2_Pos                   (2)                                            /**< (PWMC_FPV1) Fault Protection Value for PWMH output on channel 2 Position */
#define PWMC_FPV1_FPVH2_Msk                   (0x1U << PWMC_FPV1_FPVH2_Pos)                  /**< (PWMC_FPV1) Fault Protection Value for PWMH output on channel 2 Mask */
#define PWMC_FPV1_FPVH3_Pos                   (3)                                            /**< (PWMC_FPV1) Fault Protection Value for PWMH output on channel 3 Position */
#define PWMC_FPV1_FPVH3_Msk                   (0x1U << PWMC_FPV1_FPVH3_Pos)                  /**< (PWMC_FPV1) Fault Protection Value for PWMH output on channel 3 Mask */
#define PWMC_FPV1_FPVL0_Pos                   (16)                                           /**< (PWMC_FPV1) Fault Protection Value for PWML output on channel 0 Position */
#define PWMC_FPV1_FPVL0_Msk                   (0x1U << PWMC_FPV1_FPVL0_Pos)                  /**< (PWMC_FPV1) Fault Protection Value for PWML output on channel 0 Mask */
#define PWMC_FPV1_FPVL1_Pos                   (17)                                           /**< (PWMC_FPV1) Fault Protection Value for PWML output on channel 1 Position */
#define PWMC_FPV1_FPVL1_Msk                   (0x1U << PWMC_FPV1_FPVL1_Pos)                  /**< (PWMC_FPV1) Fault Protection Value for PWML output on channel 1 Mask */
#define PWMC_FPV1_FPVL2_Pos                   (18)                                           /**< (PWMC_FPV1) Fault Protection Value for PWML output on channel 2 Position */
#define PWMC_FPV1_FPVL2_Msk                   (0x1U << PWMC_FPV1_FPVL2_Pos)                  /**< (PWMC_FPV1) Fault Protection Value for PWML output on channel 2 Mask */
#define PWMC_FPV1_FPVL3_Pos                   (19)                                           /**< (PWMC_FPV1) Fault Protection Value for PWML output on channel 3 Position */
#define PWMC_FPV1_FPVL3_Msk                   (0x1U << PWMC_FPV1_FPVL3_Pos)                  /**< (PWMC_FPV1) Fault Protection Value for PWML output on channel 3 Mask */
#define PWMC_FPV1_Msk                         (0x000F000FUL)                                 /**< (PWMC_FPV1) Register Mask  */
#define PWMC_FPV1_FPVH_Pos                    (0)                                            /**< (PWMC_FPV1 Position) Fault Protection Value for PWMH output on channel x */
#define PWMC_FPV1_FPVH_Msk                    (0xFU << PWMC_FPV1_FPVH_Pos)                   /**< (PWMC_FPV1 Mask) FPVH */
#define PWMC_FPV1_FPVH(value)                 (PWMC_FPV1_FPVH_Msk & ((value) << PWMC_FPV1_FPVH_Pos))
#define PWMC_FPV1_FPVL_Pos                    (16)                                           /**< (PWMC_FPV1 Position) Fault Protection Value for PWML output on channel 3 */
#define PWMC_FPV1_FPVL_Msk                    (0xFU << PWMC_FPV1_FPVL_Pos)                   /**< (PWMC_FPV1 Mask) FPVL */
#define PWMC_FPV1_FPVL(value)                 (PWMC_FPV1_FPVL_Msk & ((value) << PWMC_FPV1_FPVL_Pos))

/* -------- PWMC_FPE : (PWMC Offset: 0x6c) (R/W 32) PWMC Fault Protection Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t FPE0:8;                    /**< bit:   0..7  Fault Protection Enable for channel 0         */
    uint32_t FPE1:8;                    /**< bit:  8..15  Fault Protection Enable for channel 1         */
    uint32_t FPE2:8;                    /**< bit: 16..23  Fault Protection Enable for channel 2         */
    uint32_t FPE3:8;                    /**< bit: 24..31  Fault Protection Enable for channel 3         */
  };
  uint32_t w;
} __PWMC_FPE_bits_t;

#define PWMC_FPE_FPE0_Pos                     (0)                                            /**< (PWMC_FPE) Fault Protection Enable for channel 0 Position */
#define PWMC_FPE_FPE0_Msk                     (0xFFU << PWMC_FPE_FPE0_Pos)                   /**< (PWMC_FPE) Fault Protection Enable for channel 0 Mask */
#define PWMC_FPE_FPE0(value)                  (PWMC_FPE_FPE0_Msk & ((value) << PWMC_FPE_FPE0_Pos))
#define PWMC_FPE_FPE1_Pos                     (8)                                            /**< (PWMC_FPE) Fault Protection Enable for channel 1 Position */
#define PWMC_FPE_FPE1_Msk                     (0xFFU << PWMC_FPE_FPE1_Pos)                   /**< (PWMC_FPE) Fault Protection Enable for channel 1 Mask */
#define PWMC_FPE_FPE1(value)                  (PWMC_FPE_FPE1_Msk & ((value) << PWMC_FPE_FPE1_Pos))
#define PWMC_FPE_FPE2_Pos                     (16)                                           /**< (PWMC_FPE) Fault Protection Enable for channel 2 Position */
#define PWMC_FPE_FPE2_Msk                     (0xFFU << PWMC_FPE_FPE2_Pos)                   /**< (PWMC_FPE) Fault Protection Enable for channel 2 Mask */
#define PWMC_FPE_FPE2(value)                  (PWMC_FPE_FPE2_Msk & ((value) << PWMC_FPE_FPE2_Pos))
#define PWMC_FPE_FPE3_Pos                     (24)                                           /**< (PWMC_FPE) Fault Protection Enable for channel 3 Position */
#define PWMC_FPE_FPE3_Msk                     (0xFFU << PWMC_FPE_FPE3_Pos)                   /**< (PWMC_FPE) Fault Protection Enable for channel 3 Mask */
#define PWMC_FPE_FPE3(value)                  (PWMC_FPE_FPE3_Msk & ((value) << PWMC_FPE_FPE3_Pos))
#define PWMC_FPE_Msk                          (0xFFFFFFFFUL)                                 /**< (PWMC_FPE) Register Mask  */

/* -------- PWMC_ELMR : (PWMC Offset: 0x7c) (R/W 32) PWMC Event Line 0 Mode Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t CSEL0:1;                   /**< bit:      0  Comparison 0 Selection                        */
    uint32_t CSEL1:1;                   /**< bit:      1  Comparison 1 Selection                        */
    uint32_t CSEL2:1;                   /**< bit:      2  Comparison 2 Selection                        */
    uint32_t CSEL3:1;                   /**< bit:      3  Comparison 3 Selection                        */
    uint32_t CSEL4:1;                   /**< bit:      4  Comparison 4 Selection                        */
    uint32_t CSEL5:1;                   /**< bit:      5  Comparison 5 Selection                        */
    uint32_t CSEL6:1;                   /**< bit:      6  Comparison 6 Selection                        */
    uint32_t CSEL7:1;                   /**< bit:      7  Comparison 7 Selection                        */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  {
    uint32_t CSEL:8;                    /**< bit:   0..7  Comparison 7 Selection                        */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_ELMR_bits_t;

#define PWMC_ELMR_CSEL0_Pos                   (0)                                            /**< (PWMC_ELMR) Comparison 0 Selection Position */
#define PWMC_ELMR_CSEL0_Msk                   (0x1U << PWMC_ELMR_CSEL0_Pos)                  /**< (PWMC_ELMR) Comparison 0 Selection Mask */
#define PWMC_ELMR_CSEL1_Pos                   (1)                                            /**< (PWMC_ELMR) Comparison 1 Selection Position */
#define PWMC_ELMR_CSEL1_Msk                   (0x1U << PWMC_ELMR_CSEL1_Pos)                  /**< (PWMC_ELMR) Comparison 1 Selection Mask */
#define PWMC_ELMR_CSEL2_Pos                   (2)                                            /**< (PWMC_ELMR) Comparison 2 Selection Position */
#define PWMC_ELMR_CSEL2_Msk                   (0x1U << PWMC_ELMR_CSEL2_Pos)                  /**< (PWMC_ELMR) Comparison 2 Selection Mask */
#define PWMC_ELMR_CSEL3_Pos                   (3)                                            /**< (PWMC_ELMR) Comparison 3 Selection Position */
#define PWMC_ELMR_CSEL3_Msk                   (0x1U << PWMC_ELMR_CSEL3_Pos)                  /**< (PWMC_ELMR) Comparison 3 Selection Mask */
#define PWMC_ELMR_CSEL4_Pos                   (4)                                            /**< (PWMC_ELMR) Comparison 4 Selection Position */
#define PWMC_ELMR_CSEL4_Msk                   (0x1U << PWMC_ELMR_CSEL4_Pos)                  /**< (PWMC_ELMR) Comparison 4 Selection Mask */
#define PWMC_ELMR_CSEL5_Pos                   (5)                                            /**< (PWMC_ELMR) Comparison 5 Selection Position */
#define PWMC_ELMR_CSEL5_Msk                   (0x1U << PWMC_ELMR_CSEL5_Pos)                  /**< (PWMC_ELMR) Comparison 5 Selection Mask */
#define PWMC_ELMR_CSEL6_Pos                   (6)                                            /**< (PWMC_ELMR) Comparison 6 Selection Position */
#define PWMC_ELMR_CSEL6_Msk                   (0x1U << PWMC_ELMR_CSEL6_Pos)                  /**< (PWMC_ELMR) Comparison 6 Selection Mask */
#define PWMC_ELMR_CSEL7_Pos                   (7)                                            /**< (PWMC_ELMR) Comparison 7 Selection Position */
#define PWMC_ELMR_CSEL7_Msk                   (0x1U << PWMC_ELMR_CSEL7_Pos)                  /**< (PWMC_ELMR) Comparison 7 Selection Mask */
#define PWMC_ELMR_Msk                         (0x000000FFUL)                                 /**< (PWMC_ELMR) Register Mask  */
#define PWMC_ELMR_CSEL_Pos                    (0)                                            /**< (PWMC_ELMR Position) Comparison 7 Selection */
#define PWMC_ELMR_CSEL_Msk                    (0xFFU << PWMC_ELMR_CSEL_Pos)                  /**< (PWMC_ELMR Mask) CSEL */
#define PWMC_ELMR_CSEL(value)                 (PWMC_ELMR_CSEL_Msk & ((value) << PWMC_ELMR_CSEL_Pos))

/* -------- PWMC_SSPR : (PWMC Offset: 0xa0) (R/W 32) PWMC Spread Spectrum Register -------- */

typedef union
{
  struct
  {
    uint32_t SPRD:24;                   /**< bit:  0..23  Spread Spectrum Limit Value                   */
    uint32_t SPRDM:1;                   /**< bit:     24  Spread Spectrum Counter Mode                  */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_SSPR_bits_t;

#define PWMC_SSPR_SPRD_Pos                    (0)                                            /**< (PWMC_SSPR) Spread Spectrum Limit Value Position */
#define PWMC_SSPR_SPRD_Msk                    (0xFFFFFFU << PWMC_SSPR_SPRD_Pos)              /**< (PWMC_SSPR) Spread Spectrum Limit Value Mask */
#define PWMC_SSPR_SPRD(value)                 (PWMC_SSPR_SPRD_Msk & ((value) << PWMC_SSPR_SPRD_Pos))
#define PWMC_SSPR_SPRDM_Pos                   (24)                                           /**< (PWMC_SSPR) Spread Spectrum Counter Mode Position */
#define PWMC_SSPR_SPRDM_Msk                   (0x1U << PWMC_SSPR_SPRDM_Pos)                  /**< (PWMC_SSPR) Spread Spectrum Counter Mode Mask */
#define PWMC_SSPR_Msk                         (0x01FFFFFFUL)                                 /**< (PWMC_SSPR) Register Mask  */

