zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/* -------- PWMC_SSPUP : (PWMC Offset: 0xa4) (/W 32) PWMC Spread Spectrum Update Register -------- */

typedef union
{
  struct
  {
    uint32_t SPRDUP:24;                 /**< bit:  0..23  Spread Spectrum Limit Value Update            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_SSPUP_bits_t;

#define PWMC_SSPUP_SPRDUP_Pos                 (0)                                            /**< (PWMC_SSPUP) Spread Spectrum Limit Value Update Position */
#define PWMC_SSPUP_SPRDUP_Msk                 (0xFFFFFFU << PWMC_SSPUP_SPRDUP_Pos)           /**< (PWMC_SSPUP) Spread Spectrum Limit Value Update Mask */
#define PWMC_SSPUP_SPRDUP(value)              (PWMC_SSPUP_SPRDUP_Msk & ((value) << PWMC_SSPUP_SPRDUP_Pos))
#define PWMC_SSPUP_Msk                        (0x00FFFFFFUL)                                 /**< (PWMC_SSPUP) Register Mask  */

/* -------- PWMC_SMMR : (PWMC Offset: 0xb0) (R/W 32) PWMC Stepper Motor Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t GCEN0:1;                   /**< bit:      0  Gray Count ENable                             */
    uint32_t GCEN1:1;                   /**< bit:      1  Gray Count ENable                             */
    uint32_t :14;                       /**< bit:  2..15  Reserved                                      */
    uint32_t DOWN0:1;                   /**< bit:     16  DOWN Count                                    */
    uint32_t DOWN1:1;                   /**< bit:     17  DOWN Count                                    */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  struct
  {
    uint32_t GCEN:2;                    /**< bit:   0..1  Gray Count ENable                             */
    uint32_t :14;                       /**< bit:  2..15  Reserved                                      */
    uint32_t DOWN:2;                    /**< bit: 16..17  DOWN Count                                    */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_SMMR_bits_t;

#define PWMC_SMMR_GCEN0_Pos                   (0)                                            /**< (PWMC_SMMR) Gray Count ENable Position */
#define PWMC_SMMR_GCEN0_Msk                   (0x1U << PWMC_SMMR_GCEN0_Pos)                  /**< (PWMC_SMMR) Gray Count ENable Mask */
#define PWMC_SMMR_GCEN1_Pos                   (1)                                            /**< (PWMC_SMMR) Gray Count ENable Position */
#define PWMC_SMMR_GCEN1_Msk                   (0x1U << PWMC_SMMR_GCEN1_Pos)                  /**< (PWMC_SMMR) Gray Count ENable Mask */
#define PWMC_SMMR_DOWN0_Pos                   (16)                                           /**< (PWMC_SMMR) DOWN Count Position */
#define PWMC_SMMR_DOWN0_Msk                   (0x1U << PWMC_SMMR_DOWN0_Pos)                  /**< (PWMC_SMMR) DOWN Count Mask */
#define PWMC_SMMR_DOWN1_Pos                   (17)                                           /**< (PWMC_SMMR) DOWN Count Position */
#define PWMC_SMMR_DOWN1_Msk                   (0x1U << PWMC_SMMR_DOWN1_Pos)                  /**< (PWMC_SMMR) DOWN Count Mask */
#define PWMC_SMMR_Msk                         (0x00030003UL)                                 /**< (PWMC_SMMR) Register Mask  */
#define PWMC_SMMR_GCEN_Pos                    (0)                                            /**< (PWMC_SMMR Position) Gray Count ENable */
#define PWMC_SMMR_GCEN_Msk                    (0x3U << PWMC_SMMR_GCEN_Pos)                   /**< (PWMC_SMMR Mask) GCEN */
#define PWMC_SMMR_GCEN(value)                 (PWMC_SMMR_GCEN_Msk & ((value) << PWMC_SMMR_GCEN_Pos))
#define PWMC_SMMR_DOWN_Pos                    (16)                                           /**< (PWMC_SMMR Position) DOWN Count */
#define PWMC_SMMR_DOWN_Msk                    (0x3U << PWMC_SMMR_DOWN_Pos)                   /**< (PWMC_SMMR Mask) DOWN */
#define PWMC_SMMR_DOWN(value)                 (PWMC_SMMR_DOWN_Msk & ((value) << PWMC_SMMR_DOWN_Pos))

/* -------- PWMC_FPV2 : (PWMC Offset: 0xc0) (R/W 32) PWMC Fault Protection Value 2 Register -------- */

typedef union
{
  struct
  {
    uint32_t FPZH0:1;                   /**< bit:      0  Fault Protection to Hi-Z for PWMH output on channel 0 */
    uint32_t FPZH1:1;                   /**< bit:      1  Fault Protection to Hi-Z for PWMH output on channel 1 */
    uint32_t FPZH2:1;                   /**< bit:      2  Fault Protection to Hi-Z for PWMH output on channel 2 */
    uint32_t FPZH3:1;                   /**< bit:      3  Fault Protection to Hi-Z for PWMH output on channel 3 */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FPZL0:1;                   /**< bit:     16  Fault Protection to Hi-Z for PWML output on channel 0 */
    uint32_t FPZL1:1;                   /**< bit:     17  Fault Protection to Hi-Z for PWML output on channel 1 */
    uint32_t FPZL2:1;                   /**< bit:     18  Fault Protection to Hi-Z for PWML output on channel 2 */
    uint32_t FPZL3:1;                   /**< bit:     19  Fault Protection to Hi-Z for PWML output on channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  struct
  {
    uint32_t FPZH:4;                    /**< bit:   0..3  Fault Protection to Hi-Z for PWMH output on channel x */
    uint32_t :12;                       /**< bit:  4..15  Reserved                                      */
    uint32_t FPZL:4;                    /**< bit: 16..19  Fault Protection to Hi-Z for PWML output on channel 3 */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_FPV2_bits_t;

#define PWMC_FPV2_FPZH0_Pos                   (0)                                            /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWMH output on channel 0 Position */
#define PWMC_FPV2_FPZH0_Msk                   (0x1U << PWMC_FPV2_FPZH0_Pos)                  /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWMH output on channel 0 Mask */
#define PWMC_FPV2_FPZH1_Pos                   (1)                                            /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWMH output on channel 1 Position */
#define PWMC_FPV2_FPZH1_Msk                   (0x1U << PWMC_FPV2_FPZH1_Pos)                  /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWMH output on channel 1 Mask */
#define PWMC_FPV2_FPZH2_Pos                   (2)                                            /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWMH output on channel 2 Position */
#define PWMC_FPV2_FPZH2_Msk                   (0x1U << PWMC_FPV2_FPZH2_Pos)                  /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWMH output on channel 2 Mask */
#define PWMC_FPV2_FPZH3_Pos                   (3)                                            /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWMH output on channel 3 Position */
#define PWMC_FPV2_FPZH3_Msk                   (0x1U << PWMC_FPV2_FPZH3_Pos)                  /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWMH output on channel 3 Mask */
#define PWMC_FPV2_FPZL0_Pos                   (16)                                           /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWML output on channel 0 Position */
#define PWMC_FPV2_FPZL0_Msk                   (0x1U << PWMC_FPV2_FPZL0_Pos)                  /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWML output on channel 0 Mask */
#define PWMC_FPV2_FPZL1_Pos                   (17)                                           /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWML output on channel 1 Position */
#define PWMC_FPV2_FPZL1_Msk                   (0x1U << PWMC_FPV2_FPZL1_Pos)                  /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWML output on channel 1 Mask */
#define PWMC_FPV2_FPZL2_Pos                   (18)                                           /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWML output on channel 2 Position */
#define PWMC_FPV2_FPZL2_Msk                   (0x1U << PWMC_FPV2_FPZL2_Pos)                  /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWML output on channel 2 Mask */
#define PWMC_FPV2_FPZL3_Pos                   (19)                                           /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWML output on channel 3 Position */
#define PWMC_FPV2_FPZL3_Msk                   (0x1U << PWMC_FPV2_FPZL3_Pos)                  /**< (PWMC_FPV2) Fault Protection to Hi-Z for PWML output on channel 3 Mask */
#define PWMC_FPV2_Msk                         (0x000F000FUL)                                 /**< (PWMC_FPV2) Register Mask  */
#define PWMC_FPV2_FPZH_Pos                    (0)                                            /**< (PWMC_FPV2 Position) Fault Protection to Hi-Z for PWMH output on channel x */
#define PWMC_FPV2_FPZH_Msk                    (0xFU << PWMC_FPV2_FPZH_Pos)                   /**< (PWMC_FPV2 Mask) FPZH */
#define PWMC_FPV2_FPZH(value)                 (PWMC_FPV2_FPZH_Msk & ((value) << PWMC_FPV2_FPZH_Pos))
#define PWMC_FPV2_FPZL_Pos                    (16)                                           /**< (PWMC_FPV2 Position) Fault Protection to Hi-Z for PWML output on channel 3 */
#define PWMC_FPV2_FPZL_Msk                    (0xFU << PWMC_FPV2_FPZL_Pos)                   /**< (PWMC_FPV2 Mask) FPZL */
#define PWMC_FPV2_FPZL(value)                 (PWMC_FPV2_FPZL_Msk & ((value) << PWMC_FPV2_FPZL_Pos))

/* -------- PWMC_WPCR : (PWMC Offset: 0xe4) (/W 32) PWMC Write Protection Control Register -------- */

typedef union
{
  struct
  {
    uint32_t WPCMD:2;                   /**< bit:   0..1  Write Protection Command                      */
    uint32_t WPRG0:1;                   /**< bit:      2  Write Protection Register Group 0             */
    uint32_t WPRG1:1;                   /**< bit:      3  Write Protection Register Group 1             */
    uint32_t WPRG2:1;                   /**< bit:      4  Write Protection Register Group 2             */
    uint32_t WPRG3:1;                   /**< bit:      5  Write Protection Register Group 3             */
    uint32_t WPRG4:1;                   /**< bit:      6  Write Protection Register Group 4             */
    uint32_t WPRG5:1;                   /**< bit:      7  Write Protection Register Group 5             */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t WPRG:6;                    /**< bit:   2..7  Write Protection Register Group x             */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_WPCR_bits_t;

#define PWMC_WPCR_WPCMD_Pos                   (0)                                            /**< (PWMC_WPCR) Write Protection Command Position */
#define PWMC_WPCR_WPCMD_Msk                   (0x3U << PWMC_WPCR_WPCMD_Pos)                  /**< (PWMC_WPCR) Write Protection Command Mask */
#define PWMC_WPCR_WPCMD(value)                (PWMC_WPCR_WPCMD_Msk & ((value) << PWMC_WPCR_WPCMD_Pos))
#define   PWMC_WPCR_WPCMD_DISABLE_SW_PROT_Val (0x0U)                                         /**< (PWMC_WPCR) Disables the software write protection of the register groups of which the bit WPRGx is at '1'.  */
#define   PWMC_WPCR_WPCMD_ENABLE_SW_PROT_Val  (0x1U)                                         /**< (PWMC_WPCR) Enables the software write protection of the register groups of which the bit WPRGx is at '1'.  */
#define   PWMC_WPCR_WPCMD_ENABLE_HW_PROT_Val  (0x2U)                                         /**< (PWMC_WPCR) Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PORT lines associated with the PWM can not be configured through the PORT interface.  */
#define PWMC_WPCR_WPCMD_DISABLE_SW_PROT       (PWMC_WPCR_WPCMD_DISABLE_SW_PROT_Val << PWMC_WPCR_WPCMD_Pos)  /**< (PWMC_WPCR) Disables the software write protection of the register groups of which the bit WPRGx is at '1'. Position  */
#define PWMC_WPCR_WPCMD_ENABLE_SW_PROT        (PWMC_WPCR_WPCMD_ENABLE_SW_PROT_Val << PWMC_WPCR_WPCMD_Pos)  /**< (PWMC_WPCR) Enables the software write protection of the register groups of which the bit WPRGx is at '1'. Position  */
#define PWMC_WPCR_WPCMD_ENABLE_HW_PROT        (PWMC_WPCR_WPCMD_ENABLE_HW_PROT_Val << PWMC_WPCR_WPCMD_Pos)  /**< (PWMC_WPCR) Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PORT lines associated with the PWM can not be configured through the PORT interface. Position  */
#define PWMC_WPCR_WPRG0_Pos                   (2)                                            /**< (PWMC_WPCR) Write Protection Register Group 0 Position */
#define PWMC_WPCR_WPRG0_Msk                   (0x1U << PWMC_WPCR_WPRG0_Pos)                  /**< (PWMC_WPCR) Write Protection Register Group 0 Mask */
#define PWMC_WPCR_WPRG1_Pos                   (3)                                            /**< (PWMC_WPCR) Write Protection Register Group 1 Position */
#define PWMC_WPCR_WPRG1_Msk                   (0x1U << PWMC_WPCR_WPRG1_Pos)                  /**< (PWMC_WPCR) Write Protection Register Group 1 Mask */
#define PWMC_WPCR_WPRG2_Pos                   (4)                                            /**< (PWMC_WPCR) Write Protection Register Group 2 Position */
#define PWMC_WPCR_WPRG2_Msk                   (0x1U << PWMC_WPCR_WPRG2_Pos)                  /**< (PWMC_WPCR) Write Protection Register Group 2 Mask */
#define PWMC_WPCR_WPRG3_Pos                   (5)                                            /**< (PWMC_WPCR) Write Protection Register Group 3 Position */
#define PWMC_WPCR_WPRG3_Msk                   (0x1U << PWMC_WPCR_WPRG3_Pos)                  /**< (PWMC_WPCR) Write Protection Register Group 3 Mask */
#define PWMC_WPCR_WPRG4_Pos                   (6)                                            /**< (PWMC_WPCR) Write Protection Register Group 4 Position */
#define PWMC_WPCR_WPRG4_Msk                   (0x1U << PWMC_WPCR_WPRG4_Pos)                  /**< (PWMC_WPCR) Write Protection Register Group 4 Mask */
#define PWMC_WPCR_WPRG5_Pos                   (7)                                            /**< (PWMC_WPCR) Write Protection Register Group 5 Position */
#define PWMC_WPCR_WPRG5_Msk                   (0x1U << PWMC_WPCR_WPRG5_Pos)                  /**< (PWMC_WPCR) Write Protection Register Group 5 Mask */
#define PWMC_WPCR_WPKEY_Pos                   (8)                                            /**< (PWMC_WPCR) Write Protection Key Position */
#define PWMC_WPCR_WPKEY_Msk                   (0xFFFFFFU << PWMC_WPCR_WPKEY_Pos)             /**< (PWMC_WPCR) Write Protection Key Mask */
#define PWMC_WPCR_WPKEY(value)                (PWMC_WPCR_WPKEY_Msk & ((value) << PWMC_WPCR_WPKEY_Pos))
#define   PWMC_WPCR_WPKEY_PASSWD_Val          (0x50574DU)                                    /**< (PWMC_WPCR) Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0  */
#define PWMC_WPCR_WPKEY_PASSWD                (PWMC_WPCR_WPKEY_PASSWD_Val << PWMC_WPCR_WPKEY_Pos)  /**< (PWMC_WPCR) Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0 Position  */
#define PWMC_WPCR_Msk                         (0xFFFFFFFFUL)                                 /**< (PWMC_WPCR) Register Mask  */
#define PWMC_WPCR_WPRG_Pos                    (2)                                            /**< (PWMC_WPCR Position) Write Protection Register Group x */
#define PWMC_WPCR_WPRG_Msk                    (0x3FU << PWMC_WPCR_WPRG_Pos)                  /**< (PWMC_WPCR Mask) WPRG */
#define PWMC_WPCR_WPRG(value)                 (PWMC_WPCR_WPRG_Msk & ((value) << PWMC_WPCR_WPRG_Pos))

/* -------- PWMC_PWM_WPSR : (PWMC Offset: 0xe8) (R/ 32) PWMC Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPSWS0:1;                  /**< bit:      0  Write Protect SW Status                       */
    uint32_t WPSWS1:1;                  /**< bit:      1  Write Protect SW Status                       */
    uint32_t WPSWS2:1;                  /**< bit:      2  Write Protect SW Status                       */
    uint32_t WPSWS3:1;                  /**< bit:      3  Write Protect SW Status                       */
    uint32_t WPSWS4:1;                  /**< bit:      4  Write Protect SW Status                       */
    uint32_t WPSWS5:1;                  /**< bit:      5  Write Protect SW Status                       */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t WPVS:1;                    /**< bit:      7  Write Protect Violation Status                */
    uint32_t WPHWS0:1;                  /**< bit:      8  Write Protect HW Status                       */
    uint32_t WPHWS1:1;                  /**< bit:      9  Write Protect HW Status                       */
    uint32_t WPHWS2:1;                  /**< bit:     10  Write Protect HW Status                       */
    uint32_t WPHWS3:1;                  /**< bit:     11  Write Protect HW Status                       */
    uint32_t WPHWS4:1;                  /**< bit:     12  Write Protect HW Status                       */
    uint32_t WPHWS5:1;                  /**< bit:     13  Write Protect HW Status                       */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit: 16..31  Write Protect Violation Source                */
  };
  struct
  {
    uint32_t WPSWS:6;                   /**< bit:   0..5  Write Protect SW Status                       */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t WPHWS:6;                   /**< bit:  8..13  Write Protect HW Status                       */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_PWM_WPSR_bits_t;

