zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
#define PWMC_PWM_WPSR_WPSWS0_Pos              (0)                                            /**< (PWMC_PWM_WPSR) Write Protect SW Status Position */
#define PWMC_PWM_WPSR_WPSWS0_Msk              (0x1U << PWMC_PWM_WPSR_WPSWS0_Pos)             /**< (PWMC_PWM_WPSR) Write Protect SW Status Mask */
#define PWMC_PWM_WPSR_WPSWS1_Pos              (1)                                            /**< (PWMC_PWM_WPSR) Write Protect SW Status Position */
#define PWMC_PWM_WPSR_WPSWS1_Msk              (0x1U << PWMC_PWM_WPSR_WPSWS1_Pos)             /**< (PWMC_PWM_WPSR) Write Protect SW Status Mask */
#define PWMC_PWM_WPSR_WPSWS2_Pos              (2)                                            /**< (PWMC_PWM_WPSR) Write Protect SW Status Position */
#define PWMC_PWM_WPSR_WPSWS2_Msk              (0x1U << PWMC_PWM_WPSR_WPSWS2_Pos)             /**< (PWMC_PWM_WPSR) Write Protect SW Status Mask */
#define PWMC_PWM_WPSR_WPSWS3_Pos              (3)                                            /**< (PWMC_PWM_WPSR) Write Protect SW Status Position */
#define PWMC_PWM_WPSR_WPSWS3_Msk              (0x1U << PWMC_PWM_WPSR_WPSWS3_Pos)             /**< (PWMC_PWM_WPSR) Write Protect SW Status Mask */
#define PWMC_PWM_WPSR_WPSWS4_Pos              (4)                                            /**< (PWMC_PWM_WPSR) Write Protect SW Status Position */
#define PWMC_PWM_WPSR_WPSWS4_Msk              (0x1U << PWMC_PWM_WPSR_WPSWS4_Pos)             /**< (PWMC_PWM_WPSR) Write Protect SW Status Mask */
#define PWMC_PWM_WPSR_WPSWS5_Pos              (5)                                            /**< (PWMC_PWM_WPSR) Write Protect SW Status Position */
#define PWMC_PWM_WPSR_WPSWS5_Msk              (0x1U << PWMC_PWM_WPSR_WPSWS5_Pos)             /**< (PWMC_PWM_WPSR) Write Protect SW Status Mask */
#define PWMC_PWM_WPSR_WPVS_Pos                (7)                                            /**< (PWMC_PWM_WPSR) Write Protect Violation Status Position */
#define PWMC_PWM_WPSR_WPVS_Msk                (0x1U << PWMC_PWM_WPSR_WPVS_Pos)               /**< (PWMC_PWM_WPSR) Write Protect Violation Status Mask */
#define PWMC_PWM_WPSR_WPHWS0_Pos              (8)                                            /**< (PWMC_PWM_WPSR) Write Protect HW Status Position */
#define PWMC_PWM_WPSR_WPHWS0_Msk              (0x1U << PWMC_PWM_WPSR_WPHWS0_Pos)             /**< (PWMC_PWM_WPSR) Write Protect HW Status Mask */
#define PWMC_PWM_WPSR_WPHWS1_Pos              (9)                                            /**< (PWMC_PWM_WPSR) Write Protect HW Status Position */
#define PWMC_PWM_WPSR_WPHWS1_Msk              (0x1U << PWMC_PWM_WPSR_WPHWS1_Pos)             /**< (PWMC_PWM_WPSR) Write Protect HW Status Mask */
#define PWMC_PWM_WPSR_WPHWS2_Pos              (10)                                           /**< (PWMC_PWM_WPSR) Write Protect HW Status Position */
#define PWMC_PWM_WPSR_WPHWS2_Msk              (0x1U << PWMC_PWM_WPSR_WPHWS2_Pos)             /**< (PWMC_PWM_WPSR) Write Protect HW Status Mask */
#define PWMC_PWM_WPSR_WPHWS3_Pos              (11)                                           /**< (PWMC_PWM_WPSR) Write Protect HW Status Position */
#define PWMC_PWM_WPSR_WPHWS3_Msk              (0x1U << PWMC_PWM_WPSR_WPHWS3_Pos)             /**< (PWMC_PWM_WPSR) Write Protect HW Status Mask */
#define PWMC_PWM_WPSR_WPHWS4_Pos              (12)                                           /**< (PWMC_PWM_WPSR) Write Protect HW Status Position */
#define PWMC_PWM_WPSR_WPHWS4_Msk              (0x1U << PWMC_PWM_WPSR_WPHWS4_Pos)             /**< (PWMC_PWM_WPSR) Write Protect HW Status Mask */
#define PWMC_PWM_WPSR_WPHWS5_Pos              (13)                                           /**< (PWMC_PWM_WPSR) Write Protect HW Status Position */
#define PWMC_PWM_WPSR_WPHWS5_Msk              (0x1U << PWMC_PWM_WPSR_WPHWS5_Pos)             /**< (PWMC_PWM_WPSR) Write Protect HW Status Mask */
#define PWMC_PWM_WPSR_WPVSRC_Pos              (16)                                           /**< (PWMC_PWM_WPSR) Write Protect Violation Source Position */
#define PWMC_PWM_WPSR_WPVSRC_Msk              (0xFFFFU << PWMC_PWM_WPSR_WPVSRC_Pos)          /**< (PWMC_PWM_WPSR) Write Protect Violation Source Mask */
#define PWMC_PWM_WPSR_WPVSRC(value)           (PWMC_PWM_WPSR_WPVSRC_Msk & ((value) << PWMC_PWM_WPSR_WPVSRC_Pos))
#define PWMC_PWM_WPSR_Msk                     (0xFFFF3FBFUL)                                 /**< (PWMC_PWM_WPSR) Register Mask  */
#define PWMC_PWM_WPSR_WPSWS_Pos               (0)                                            /**< (PWMC_PWM_WPSR Position) Write Protect SW Status */
#define PWMC_PWM_WPSR_WPSWS_Msk               (0x3FU << PWMC_PWM_WPSR_WPSWS_Pos)             /**< (PWMC_PWM_WPSR Mask) WPSWS */
#define PWMC_PWM_WPSR_WPSWS(value)            (PWMC_PWM_WPSR_WPSWS_Msk & ((value) << PWMC_PWM_WPSR_WPSWS_Pos))
#define PWMC_PWM_WPSR_WPHWS_Pos               (8)                                            /**< (PWMC_PWM_WPSR Position) Write Protect HW Status */
#define PWMC_PWM_WPSR_WPHWS_Msk               (0x3FU << PWMC_PWM_WPSR_WPHWS_Pos)             /**< (PWMC_PWM_WPSR Mask) WPHWS */
#define PWMC_PWM_WPSR_WPHWS(value)            (PWMC_PWM_WPSR_WPHWS_Msk & ((value) << PWMC_PWM_WPSR_WPHWS_Pos))

/* -------- PWMC_CMUPD0 : (PWMC Offset: 0x400) (/W 32) PWMC Channel Mode Update Register (ch_num = 0) -------- */

typedef union
{
  struct
  {
    uint32_t :9;                        /**< bit:   0..8  Reserved                                      */
    uint32_t CPOLUP:1;                  /**< bit:      9  Channel Polarity Update                       */
    uint32_t :3;                        /**< bit: 10..12  Reserved                                      */
    uint32_t CPOLINVUP:1;               /**< bit:     13  Channel Polarity Inversion Update             */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CMUPD0_bits_t;

#define PWMC_CMUPD0_CPOLUP_Pos                (9)                                            /**< (PWMC_CMUPD0) Channel Polarity Update Position */
#define PWMC_CMUPD0_CPOLUP_Msk                (0x1U << PWMC_CMUPD0_CPOLUP_Pos)               /**< (PWMC_CMUPD0) Channel Polarity Update Mask */
#define PWMC_CMUPD0_CPOLINVUP_Pos             (13)                                           /**< (PWMC_CMUPD0) Channel Polarity Inversion Update Position */
#define PWMC_CMUPD0_CPOLINVUP_Msk             (0x1U << PWMC_CMUPD0_CPOLINVUP_Pos)            /**< (PWMC_CMUPD0) Channel Polarity Inversion Update Mask */
#define PWMC_CMUPD0_Msk                       (0x00002200UL)                                 /**< (PWMC_CMUPD0) Register Mask  */

