zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
/* -------- PWMC_CMUPD1 : (PWMC Offset: 0x420) (/W 32) PWMC Channel Mode Update Register (ch_num = 1) -------- */

typedef union
{
  struct
  {
    uint32_t :9;                        /**< bit:   0..8  Reserved                                      */
    uint32_t CPOLUP:1;                  /**< bit:      9  Channel Polarity Update                       */
    uint32_t :3;                        /**< bit: 10..12  Reserved                                      */
    uint32_t CPOLINVUP:1;               /**< bit:     13  Channel Polarity Inversion Update             */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CMUPD1_bits_t;

#define PWMC_CMUPD1_CPOLUP_Pos                (9)                                            /**< (PWMC_CMUPD1) Channel Polarity Update Position */
#define PWMC_CMUPD1_CPOLUP_Msk                (0x1U << PWMC_CMUPD1_CPOLUP_Pos)               /**< (PWMC_CMUPD1) Channel Polarity Update Mask */
#define PWMC_CMUPD1_CPOLINVUP_Pos             (13)                                           /**< (PWMC_CMUPD1) Channel Polarity Inversion Update Position */
#define PWMC_CMUPD1_CPOLINVUP_Msk             (0x1U << PWMC_CMUPD1_CPOLINVUP_Pos)            /**< (PWMC_CMUPD1) Channel Polarity Inversion Update Mask */
#define PWMC_CMUPD1_Msk                       (0x00002200UL)                                 /**< (PWMC_CMUPD1) Register Mask  */

/* -------- PWMC_ETRG1 : (PWMC Offset: 0x42c) (R/W 32) PWMC External Trigger Register (trg_num = 1) -------- */

typedef union
{
  struct
  {
    uint32_t MAXCNT:24;                 /**< bit:  0..23  Maximum Counter value                         */
    uint32_t TRGMODE:2;                 /**< bit: 24..25  External Trigger Mode                         */
    uint32_t :2;                        /**< bit: 26..27  Reserved                                      */
    uint32_t TRGEDGE:1;                 /**< bit:     28  Edge Selection                                */
    uint32_t TRGFILT:1;                 /**< bit:     29  Filtered input                                */
    uint32_t TRGSRC:1;                  /**< bit:     30  Trigger Source                                */
    uint32_t RFEN:1;                    /**< bit:     31  Recoverable Fault Enable                      */
  };
  uint32_t w;
} __PWMC_ETRG1_bits_t;

#define PWMC_ETRG1_MAXCNT_Pos                 (0)                                            /**< (PWMC_ETRG1) Maximum Counter value Position */
#define PWMC_ETRG1_MAXCNT_Msk                 (0xFFFFFFU << PWMC_ETRG1_MAXCNT_Pos)           /**< (PWMC_ETRG1) Maximum Counter value Mask */
#define PWMC_ETRG1_MAXCNT(value)              (PWMC_ETRG1_MAXCNT_Msk & ((value) << PWMC_ETRG1_MAXCNT_Pos))
#define PWMC_ETRG1_TRGMODE_Pos                (24)                                           /**< (PWMC_ETRG1) External Trigger Mode Position */
#define PWMC_ETRG1_TRGMODE_Msk                (0x3U << PWMC_ETRG1_TRGMODE_Pos)               /**< (PWMC_ETRG1) External Trigger Mode Mask */
#define PWMC_ETRG1_TRGMODE(value)             (PWMC_ETRG1_TRGMODE_Msk & ((value) << PWMC_ETRG1_TRGMODE_Pos))
#define   PWMC_ETRG1_TRGMODE_OFF_Val          (0x0U)                                         /**< (PWMC_ETRG1) External trigger is not enabled.  */
#define   PWMC_ETRG1_TRGMODE_MODE1_Val        (0x1U)                                         /**< (PWMC_ETRG1) External PWM Reset Mode  */
#define   PWMC_ETRG1_TRGMODE_MODE2_Val        (0x2U)                                         /**< (PWMC_ETRG1) External PWM Start Mode  */
#define   PWMC_ETRG1_TRGMODE_MODE3_Val        (0x3U)                                         /**< (PWMC_ETRG1) Cycle-by-cycle Duty Mode  */
#define PWMC_ETRG1_TRGMODE_OFF                (PWMC_ETRG1_TRGMODE_OFF_Val << PWMC_ETRG1_TRGMODE_Pos)  /**< (PWMC_ETRG1) External trigger is not enabled. Position  */
#define PWMC_ETRG1_TRGMODE_MODE1              (PWMC_ETRG1_TRGMODE_MODE1_Val << PWMC_ETRG1_TRGMODE_Pos)  /**< (PWMC_ETRG1) External PWM Reset Mode Position  */
#define PWMC_ETRG1_TRGMODE_MODE2              (PWMC_ETRG1_TRGMODE_MODE2_Val << PWMC_ETRG1_TRGMODE_Pos)  /**< (PWMC_ETRG1) External PWM Start Mode Position  */
#define PWMC_ETRG1_TRGMODE_MODE3              (PWMC_ETRG1_TRGMODE_MODE3_Val << PWMC_ETRG1_TRGMODE_Pos)  /**< (PWMC_ETRG1) Cycle-by-cycle Duty Mode Position  */
#define PWMC_ETRG1_TRGEDGE_Pos                (28)                                           /**< (PWMC_ETRG1) Edge Selection Position */
#define PWMC_ETRG1_TRGEDGE_Msk                (0x1U << PWMC_ETRG1_TRGEDGE_Pos)               /**< (PWMC_ETRG1) Edge Selection Mask */
#define   PWMC_ETRG1_TRGEDGE_FALLING_ZERO_Val (0x0U)                                         /**< (PWMC_ETRG1) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0  */
#define   PWMC_ETRG1_TRGEDGE_RISING_ONE_Val   (0x1U)                                         /**< (PWMC_ETRG1) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1  */
#define PWMC_ETRG1_TRGEDGE_FALLING_ZERO       (PWMC_ETRG1_TRGEDGE_FALLING_ZERO_Val << PWMC_ETRG1_TRGEDGE_Pos)  /**< (PWMC_ETRG1) TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0 Position  */
#define PWMC_ETRG1_TRGEDGE_RISING_ONE         (PWMC_ETRG1_TRGEDGE_RISING_ONE_Val << PWMC_ETRG1_TRGEDGE_Pos)  /**< (PWMC_ETRG1) TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1 Position  */
#define PWMC_ETRG1_TRGFILT_Pos                (29)                                           /**< (PWMC_ETRG1) Filtered input Position */
#define PWMC_ETRG1_TRGFILT_Msk                (0x1U << PWMC_ETRG1_TRGFILT_Pos)               /**< (PWMC_ETRG1) Filtered input Mask */
#define PWMC_ETRG1_TRGSRC_Pos                 (30)                                           /**< (PWMC_ETRG1) Trigger Source Position */
#define PWMC_ETRG1_TRGSRC_Msk                 (0x1U << PWMC_ETRG1_TRGSRC_Pos)                /**< (PWMC_ETRG1) Trigger Source Mask */
#define PWMC_ETRG1_RFEN_Pos                   (31)                                           /**< (PWMC_ETRG1) Recoverable Fault Enable Position */
#define PWMC_ETRG1_RFEN_Msk                   (0x1U << PWMC_ETRG1_RFEN_Pos)                  /**< (PWMC_ETRG1) Recoverable Fault Enable Mask */
#define PWMC_ETRG1_Msk                        (0xF3FFFFFFUL)                                 /**< (PWMC_ETRG1) Register Mask  */

/* -------- PWMC_LEBR1 : (PWMC Offset: 0x430) (R/W 32) PWMC Leading-Edge Blanking Register (trg_num = 1) -------- */

typedef union
{
  struct
  {
    uint32_t LEBDELAY:7;                /**< bit:   0..6  Leading-Edge Blanking Delay for TRGINx        */
    uint32_t :9;                        /**< bit:  7..15  Reserved                                      */
    uint32_t PWMLFEN:1;                 /**< bit:     16  PWML Falling Edge Enable                      */
    uint32_t PWMLREN:1;                 /**< bit:     17  PWML Rising Edge Enable                       */
    uint32_t PWMHFEN:1;                 /**< bit:     18  PWMH Falling Edge Enable                      */
    uint32_t PWMHREN:1;                 /**< bit:     19  PWMH Rising Edge Enable                       */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_LEBR1_bits_t;

