zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pwmc.h
#define PWMC_LEBR2_LEBDELAY_Pos               (0)                                            /**< (PWMC_LEBR2) Leading-Edge Blanking Delay for TRGINx Position */
#define PWMC_LEBR2_LEBDELAY_Msk               (0x7FU << PWMC_LEBR2_LEBDELAY_Pos)             /**< (PWMC_LEBR2) Leading-Edge Blanking Delay for TRGINx Mask */
#define PWMC_LEBR2_LEBDELAY(value)            (PWMC_LEBR2_LEBDELAY_Msk & ((value) << PWMC_LEBR2_LEBDELAY_Pos))
#define PWMC_LEBR2_PWMLFEN_Pos                (16)                                           /**< (PWMC_LEBR2) PWML Falling Edge Enable Position */
#define PWMC_LEBR2_PWMLFEN_Msk                (0x1U << PWMC_LEBR2_PWMLFEN_Pos)               /**< (PWMC_LEBR2) PWML Falling Edge Enable Mask */
#define PWMC_LEBR2_PWMLREN_Pos                (17)                                           /**< (PWMC_LEBR2) PWML Rising Edge Enable Position */
#define PWMC_LEBR2_PWMLREN_Msk                (0x1U << PWMC_LEBR2_PWMLREN_Pos)               /**< (PWMC_LEBR2) PWML Rising Edge Enable Mask */
#define PWMC_LEBR2_PWMHFEN_Pos                (18)                                           /**< (PWMC_LEBR2) PWMH Falling Edge Enable Position */
#define PWMC_LEBR2_PWMHFEN_Msk                (0x1U << PWMC_LEBR2_PWMHFEN_Pos)               /**< (PWMC_LEBR2) PWMH Falling Edge Enable Mask */
#define PWMC_LEBR2_PWMHREN_Pos                (19)                                           /**< (PWMC_LEBR2) PWMH Rising Edge Enable Position */
#define PWMC_LEBR2_PWMHREN_Msk                (0x1U << PWMC_LEBR2_PWMHREN_Pos)               /**< (PWMC_LEBR2) PWMH Rising Edge Enable Mask */
#define PWMC_LEBR2_Msk                        (0x000F007FUL)                                 /**< (PWMC_LEBR2) Register Mask  */

/* -------- PWMC_CMUPD3 : (PWMC Offset: 0x460) (/W 32) PWMC Channel Mode Update Register (ch_num = 3) -------- */

typedef union
{
  struct
  {
    uint32_t :9;                        /**< bit:   0..8  Reserved                                      */
    uint32_t CPOLUP:1;                  /**< bit:      9  Channel Polarity Update                       */
    uint32_t :3;                        /**< bit: 10..12  Reserved                                      */
    uint32_t CPOLINVUP:1;               /**< bit:     13  Channel Polarity Inversion Update             */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __PWMC_CMUPD3_bits_t;

#define PWMC_CMUPD3_CPOLUP_Pos                (9)                                            /**< (PWMC_CMUPD3) Channel Polarity Update Position */
#define PWMC_CMUPD3_CPOLUP_Msk                (0x1U << PWMC_CMUPD3_CPOLUP_Pos)               /**< (PWMC_CMUPD3) Channel Polarity Update Mask */
#define PWMC_CMUPD3_CPOLINVUP_Pos             (13)                                           /**< (PWMC_CMUPD3) Channel Polarity Inversion Update Position */
#define PWMC_CMUPD3_CPOLINVUP_Msk             (0x1U << PWMC_CMUPD3_CPOLINVUP_Pos)            /**< (PWMC_CMUPD3) Channel Polarity Inversion Update Mask */
#define PWMC_CMUPD3_Msk                       (0x00002200UL)                                 /**< (PWMC_CMUPD3) Register Mask  */

/** \brief PWMC_CH_NUM register offsets definitions */
#define PWMC_CMR_OFFSET              (0x00)         /**< (PWMC_CMR) PWMC Channel Mode Register (ch_num = 0) Offset */
#define PWMC_CDTY_OFFSET             (0x04)         /**< (PWMC_CDTY) PWMC Channel Duty Cycle Register (ch_num = 0) Offset */
#define PWMC_CDTYUPD_OFFSET          (0x08)         /**< (PWMC_CDTYUPD) PWMC Channel Duty Cycle Update Register (ch_num = 0) Offset */
#define PWMC_CPRD_OFFSET             (0x0C)         /**< (PWMC_CPRD) PWMC Channel Period Register (ch_num = 0) Offset */
#define PWMC_CPRDUPD_OFFSET          (0x10)         /**< (PWMC_CPRDUPD) PWMC Channel Period Update Register (ch_num = 0) Offset */
#define PWMC_CCNT_OFFSET             (0x14)         /**< (PWMC_CCNT) PWMC Channel Counter Register (ch_num = 0) Offset */
#define PWMC_DT_OFFSET               (0x18)         /**< (PWMC_DT) PWMC Channel Dead Time Register (ch_num = 0) Offset */
#define PWMC_DTUPD_OFFSET            (0x1C)         /**< (PWMC_DTUPD) PWMC Channel Dead Time Update Register (ch_num = 0) Offset */
/** \brief PWMC_CMP register offsets definitions */
#define PWMC_CMPV_OFFSET             (0x00)         /**< (PWMC_CMPV) PWMC Comparison 0 Value Register Offset */
#define PWMC_CMPVUPD_OFFSET          (0x04)         /**< (PWMC_CMPVUPD) PWMC Comparison 0 Value Update Register Offset */
#define PWMC_CMPM_OFFSET             (0x08)         /**< (PWMC_CMPM) PWMC Comparison 0 Mode Register Offset */
#define PWMC_CMPMUPD_OFFSET          (0x0C)         /**< (PWMC_CMPMUPD) PWMC Comparison 0 Mode Update Register Offset */
/** \brief PWMC register offsets definitions */
#define PWMC_CLK_OFFSET              (0x00)         /**< (PWMC_CLK) PWMC Clock Register Offset */
#define PWMC_ENA_OFFSET              (0x04)         /**< (PWMC_ENA) PWMC Enable Register Offset */
#define PWMC_DIS_OFFSET              (0x08)         /**< (PWMC_DIS) PWMC Disable Register Offset */
#define PWMC_SR_OFFSET               (0x0C)         /**< (PWMC_SR) PWMC Status Register Offset */
#define PWMC_IER1_OFFSET             (0x10)         /**< (PWMC_IER1) PWMC Interrupt Enable Register 1 Offset */
#define PWMC_IDR1_OFFSET             (0x14)         /**< (PWMC_IDR1) PWMC Interrupt Disable Register 1 Offset */
#define PWMC_IMR1_OFFSET             (0x18)         /**< (PWMC_IMR1) PWMC Interrupt Mask Register 1 Offset */
#define PWMC_ISR1_OFFSET             (0x1C)         /**< (PWMC_ISR1) PWMC Interrupt Status Register 1 Offset */
#define PWMC_SCM_OFFSET              (0x20)         /**< (PWMC_SCM) PWMC Sync Channels Mode Register Offset */
#define PWMC_DMAR_OFFSET             (0x24)         /**< (PWMC_DMAR) PWMC DMA Register Offset */
#define PWMC_SCUC_OFFSET             (0x28)         /**< (PWMC_SCUC) PWMC Sync Channels Update Control Register Offset */
#define PWMC_SCUP_OFFSET             (0x2C)         /**< (PWMC_SCUP) PWMC Sync Channels Update Period Register Offset */
#define PWMC_SCUPUPD_OFFSET          (0x30)         /**< (PWMC_SCUPUPD) PWMC Sync Channels Update Period Update Register Offset */
#define PWMC_IER2_OFFSET             (0x34)         /**< (PWMC_IER2) PWMC Interrupt Enable Register 2 Offset */
#define PWMC_IDR2_OFFSET             (0x38)         /**< (PWMC_IDR2) PWMC Interrupt Disable Register 2 Offset */
#define PWMC_IMR2_OFFSET             (0x3C)         /**< (PWMC_IMR2) PWMC Interrupt Mask Register 2 Offset */
#define PWMC_ISR2_OFFSET             (0x40)         /**< (PWMC_ISR2) PWMC Interrupt Status Register 2 Offset */
#define PWMC_OOV_OFFSET              (0x44)         /**< (PWMC_OOV) PWMC Output Override Value Register Offset */
#define PWMC_OS_OFFSET               (0x48)         /**< (PWMC_OS) PWMC Output Selection Register Offset */
#define PWMC_OSS_OFFSET              (0x4C)         /**< (PWMC_OSS) PWMC Output Selection Set Register Offset */
#define PWMC_OSC_OFFSET              (0x50)         /**< (PWMC_OSC) PWMC Output Selection Clear Register Offset */
#define PWMC_OSSUPD_OFFSET           (0x54)         /**< (PWMC_OSSUPD) PWMC Output Selection Set Update Register Offset */
#define PWMC_OSCUPD_OFFSET           (0x58)         /**< (PWMC_OSCUPD) PWMC Output Selection Clear Update Register Offset */
#define PWMC_FMR_OFFSET              (0x5C)         /**< (PWMC_FMR) PWMC Fault Mode Register Offset */
#define PWMC_FSR_OFFSET              (0x60)         /**< (PWMC_FSR) PWMC Fault Status Register Offset */
#define PWMC_FCR_OFFSET              (0x64)         /**< (PWMC_FCR) PWMC Fault Clear Register Offset */
#define PWMC_FPV1_OFFSET             (0x68)         /**< (PWMC_FPV1) PWMC Fault Protection Value Register 1 Offset */
#define PWMC_FPE_OFFSET              (0x6C)         /**< (PWMC_FPE) PWMC Fault Protection Enable Register Offset */
#define PWMC_ELMR_OFFSET             (0x7C)         /**< (PWMC_ELMR) PWMC Event Line 0 Mode Register 0 Offset */
#define PWMC_SSPR_OFFSET             (0xA0)         /**< (PWMC_SSPR) PWMC Spread Spectrum Register Offset */
#define PWMC_SSPUP_OFFSET            (0xA4)         /**< (PWMC_SSPUP) PWMC Spread Spectrum Update Register Offset */
#define PWMC_SMMR_OFFSET             (0xB0)         /**< (PWMC_SMMR) PWMC Stepper Motor Mode Register Offset */
#define PWMC_FPV2_OFFSET             (0xC0)         /**< (PWMC_FPV2) PWMC Fault Protection Value 2 Register Offset */
#define PWMC_WPCR_OFFSET             (0xE4)         /**< (PWMC_WPCR) PWMC Write Protection Control Register Offset */
#define PWMC_PWM_WPSR_OFFSET         (0xE8)         /**< (PWMC_PWM_WPSR) PWMC Write Protection Status Register Offset */
#define PWMC_CMUPD0_OFFSET           (0x400)        /**< (PWMC_CMUPD0) PWMC Channel Mode Update Register (ch_num = 0) Offset */
#define PWMC_CMUPD1_OFFSET           (0x420)        /**< (PWMC_CMUPD1) PWMC Channel Mode Update Register (ch_num = 1) Offset */
#define PWMC_ETRG1_OFFSET            (0x42C)        /**< (PWMC_ETRG1) PWMC External Trigger Register (trg_num = 1) Offset */
#define PWMC_LEBR1_OFFSET            (0x430)        /**< (PWMC_LEBR1) PWMC Leading-Edge Blanking Register (trg_num = 1) Offset */
#define PWMC_CMUPD2_OFFSET           (0x440)        /**< (PWMC_CMUPD2) PWMC Channel Mode Update Register (ch_num = 2) Offset */
#define PWMC_ETRG2_OFFSET            (0x44C)        /**< (PWMC_ETRG2) PWMC External Trigger Register (trg_num = 2) Offset */
#define PWMC_LEBR2_OFFSET            (0x450)        /**< (PWMC_LEBR2) PWMC Leading-Edge Blanking Register (trg_num = 2) Offset */
#define PWMC_CMUPD3_OFFSET           (0x460)        /**< (PWMC_CMUPD3) PWMC Channel Mode Update Register (ch_num = 3) Offset */

/** \brief PWMC_CH_NUM register API structure */
typedef struct
{
  __IO  __PWMC_CMR_bits_t              PWMC_CMR;      /**< Offset: 0x00 (R/W  32) PWMC Channel Mode Register (ch_num = 0) */
  __IO  __PWMC_CDTY_bits_t             PWMC_CDTY;     /**< Offset: 0x04 (R/W  32) PWMC Channel Duty Cycle Register (ch_num = 0) */
  __O   __PWMC_CDTYUPD_bits_t          PWMC_CDTYUPD;  /**< Offset: 0x08 ( /W  32) PWMC Channel Duty Cycle Update Register (ch_num = 0) */
  __IO  __PWMC_CPRD_bits_t             PWMC_CPRD;     /**< Offset: 0x0C (R/W  32) PWMC Channel Period Register (ch_num = 0) */
  __O   __PWMC_CPRDUPD_bits_t          PWMC_CPRDUPD;  /**< Offset: 0x10 ( /W  32) PWMC Channel Period Update Register (ch_num = 0) */
  __I   __PWMC_CCNT_bits_t             PWMC_CCNT;     /**< Offset: 0x14 (R/   32) PWMC Channel Counter Register (ch_num = 0) */
  __IO  __PWMC_DT_bits_t               PWMC_DT;       /**< Offset: 0x18 (R/W  32) PWMC Channel Dead Time Register (ch_num = 0) */
  __O   __PWMC_DTUPD_bits_t            PWMC_DTUPD;    /**< Offset: 0x1C ( /W  32) PWMC Channel Dead Time Update Register (ch_num = 0) */
} pwmcchnum_registers_t;

/** \brief PWMC_CMP register API structure */
typedef struct
{
  __IO  __PWMC_CMPV_bits_t             PWMC_CMPV;     /**< Offset: 0x00 (R/W  32) PWMC Comparison 0 Value Register */
  __O   __PWMC_CMPVUPD_bits_t          PWMC_CMPVUPD;  /**< Offset: 0x04 ( /W  32) PWMC Comparison 0 Value Update Register */
  __IO  __PWMC_CMPM_bits_t             PWMC_CMPM;     /**< Offset: 0x08 (R/W  32) PWMC Comparison 0 Mode Register */
  __O   __PWMC_CMPMUPD_bits_t          PWMC_CMPMUPD;  /**< Offset: 0x0C ( /W  32) PWMC Comparison 0 Mode Update Register */
} pwmccmp_registers_t;

#define PWMCCMP_NUMBER 8
#define PWMCCHNUM_NUMBER 4
/** \brief PWMC register API structure */
typedef struct
{
  __IO  __PWMC_CLK_bits_t              PWMC_CLK;      /**< Offset: 0x00 (R/W  32) PWMC Clock Register */
  __O   __PWMC_ENA_bits_t              PWMC_ENA;      /**< Offset: 0x04 ( /W  32) PWMC Enable Register */
  __O   __PWMC_DIS_bits_t              PWMC_DIS;      /**< Offset: 0x08 ( /W  32) PWMC Disable Register */
  __I   __PWMC_SR_bits_t               PWMC_SR;       /**< Offset: 0x0C (R/   32) PWMC Status Register */
  __O   __PWMC_IER1_bits_t             PWMC_IER1;     /**< Offset: 0x10 ( /W  32) PWMC Interrupt Enable Register 1 */
  __O   __PWMC_IDR1_bits_t             PWMC_IDR1;     /**< Offset: 0x14 ( /W  32) PWMC Interrupt Disable Register 1 */
  __I   __PWMC_IMR1_bits_t             PWMC_IMR1;     /**< Offset: 0x18 (R/   32) PWMC Interrupt Mask Register 1 */
  __I   __PWMC_ISR1_bits_t             PWMC_ISR1;     /**< Offset: 0x1C (R/   32) PWMC Interrupt Status Register 1 */
  __IO  __PWMC_SCM_bits_t              PWMC_SCM;      /**< Offset: 0x20 (R/W  32) PWMC Sync Channels Mode Register */
  __O   __PWMC_DMAR_bits_t             PWMC_DMAR;     /**< Offset: 0x24 ( /W  32) PWMC DMA Register */
  __IO  __PWMC_SCUC_bits_t             PWMC_SCUC;     /**< Offset: 0x28 (R/W  32) PWMC Sync Channels Update Control Register */
  __IO  __PWMC_SCUP_bits_t             PWMC_SCUP;     /**< Offset: 0x2C (R/W  32) PWMC Sync Channels Update Period Register */
  __O   __PWMC_SCUPUPD_bits_t          PWMC_SCUPUPD;  /**< Offset: 0x30 ( /W  32) PWMC Sync Channels Update Period Update Register */
  __O   __PWMC_IER2_bits_t             PWMC_IER2;     /**< Offset: 0x34 ( /W  32) PWMC Interrupt Enable Register 2 */
  __O   __PWMC_IDR2_bits_t             PWMC_IDR2;     /**< Offset: 0x38 ( /W  32) PWMC Interrupt Disable Register 2 */
  __I   __PWMC_IMR2_bits_t             PWMC_IMR2;     /**< Offset: 0x3C (R/   32) PWMC Interrupt Mask Register 2 */
  __I   __PWMC_ISR2_bits_t             PWMC_ISR2;     /**< Offset: 0x40 (R/   32) PWMC Interrupt Status Register 2 */
  __IO  __PWMC_OOV_bits_t              PWMC_OOV;      /**< Offset: 0x44 (R/W  32) PWMC Output Override Value Register */
  __IO  __PWMC_OS_bits_t               PWMC_OS;       /**< Offset: 0x48 (R/W  32) PWMC Output Selection Register */
  __O   __PWMC_OSS_bits_t              PWMC_OSS;      /**< Offset: 0x4C ( /W  32) PWMC Output Selection Set Register */
  __O   __PWMC_OSC_bits_t              PWMC_OSC;      /**< Offset: 0x50 ( /W  32) PWMC Output Selection Clear Register */
  __O   __PWMC_OSSUPD_bits_t           PWMC_OSSUPD;   /**< Offset: 0x54 ( /W  32) PWMC Output Selection Set Update Register */
  __O   __PWMC_OSCUPD_bits_t           PWMC_OSCUPD;   /**< Offset: 0x58 ( /W  32) PWMC Output Selection Clear Update Register */
  __IO  __PWMC_FMR_bits_t              PWMC_FMR;      /**< Offset: 0x5C (R/W  32) PWMC Fault Mode Register */
  __I   __PWMC_FSR_bits_t              PWMC_FSR;      /**< Offset: 0x60 (R/   32) PWMC Fault Status Register */
  __O   __PWMC_FCR_bits_t              PWMC_FCR;      /**< Offset: 0x64 ( /W  32) PWMC Fault Clear Register */
  __IO  __PWMC_FPV1_bits_t             PWMC_FPV1;     /**< Offset: 0x68 (R/W  32) PWMC Fault Protection Value Register 1 */
  __IO  __PWMC_FPE_bits_t              PWMC_FPE;      /**< Offset: 0x6C (R/W  32) PWMC Fault Protection Enable Register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  __PWMC_ELMR_bits_t             PWMC_ELMR[2];  /**< Offset: 0x7C (R/W  32) PWMC Event Line 0 Mode Register 0 */
  __I   uint8_t                        Reserved2[0x1C];
  __IO  __PWMC_SSPR_bits_t             PWMC_SSPR;     /**< Offset: 0xA0 (R/W  32) PWMC Spread Spectrum Register */
  __O   __PWMC_SSPUP_bits_t            PWMC_SSPUP;    /**< Offset: 0xA4 ( /W  32) PWMC Spread Spectrum Update Register */
  __I   uint8_t                        Reserved3[0x08];
  __IO  __PWMC_SMMR_bits_t             PWMC_SMMR;     /**< Offset: 0xB0 (R/W  32) PWMC Stepper Motor Mode Register */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  __PWMC_FPV2_bits_t             PWMC_FPV2;     /**< Offset: 0xC0 (R/W  32) PWMC Fault Protection Value 2 Register */
  __I   uint8_t                        Reserved5[0x20];
  __O   __PWMC_WPCR_bits_t             PWMC_WPCR;     /**< Offset: 0xE4 ( /W  32) PWMC Write Protection Control Register */
  __I   __PWMC_PWM_WPSR_bits_t         PWM_WPSR;      /**< Offset: 0xE8 (R/   32) PWMC Write Protection Status Register */
  __I   uint8_t                        Reserved6[0x44];
        pwmccmp_registers_t            PWMC_CMP[PWMCCMP_NUMBER]; /**< Offset: 0x130 PWMC Comparison 0 Value Register */
  __I   uint8_t                        Reserved7[0x50];
        pwmcchnum_registers_t          PWMC_CH_NUM[PWMCCHNUM_NUMBER]; /**< Offset: 0x200 PWMC Channel Mode Register (ch_num = 0) */
  __I   uint8_t                        Reserved8[0x180];
  __O   __PWMC_CMUPD0_bits_t           PWMC_CMUPD0;   /**< Offset: 0x400 ( /W  32) PWMC Channel Mode Update Register (ch_num = 0) */
  __I   uint8_t                        Reserved9[0x1C];
  __O   __PWMC_CMUPD1_bits_t           PWMC_CMUPD1;   /**< Offset: 0x420 ( /W  32) PWMC Channel Mode Update Register (ch_num = 1) */
  __I   uint8_t                        Reserved10[0x08];
  __IO  __PWMC_ETRG1_bits_t            PWMC_ETRG1;    /**< Offset: 0x42C (R/W  32) PWMC External Trigger Register (trg_num = 1) */
  __IO  __PWMC_LEBR1_bits_t            PWMC_LEBR1;    /**< Offset: 0x430 (R/W  32) PWMC Leading-Edge Blanking Register (trg_num = 1) */
  __I   uint8_t                        Reserved11[0x0C];
  __O   __PWMC_CMUPD2_bits_t           PWMC_CMUPD2;   /**< Offset: 0x440 ( /W  32) PWMC Channel Mode Update Register (ch_num = 2) */
  __I   uint8_t                        Reserved12[0x08];
  __IO  __PWMC_ETRG2_bits_t            PWMC_ETRG2;    /**< Offset: 0x44C (R/W  32) PWMC External Trigger Register (trg_num = 2) */
  __IO  __PWMC_LEBR2_bits_t            PWMC_LEBR2;    /**< Offset: 0x450 (R/W  32) PWMC Leading-Edge Blanking Register (trg_num = 2) */
  __I   uint8_t                        Reserved13[0x0C];
  __O   __PWMC_CMUPD3_bits_t           PWMC_CMUPD3;   /**< Offset: 0x460 ( /W  32) PWMC Channel Mode Update Register (ch_num = 3) */
} pwmc_registers_t;
/** @}  end of Pulse Width Modulation Controller */

#endif /* _PIC32CZ_CA70_PWMC_COMPONENT_H_ */
